////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПолучитьСуммуПоСтрокам() Экспорт
	
	СуммаПоСтрокам = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
	Возврат СуммаПоСтрокам;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Ваучер = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетКнигиПокупокСуммы.Ссылка.Ваучер
		|ИЗ
		|	Документ.СчетКнигиПокупок.Суммы КАК СчетКнигиПокупокСуммы
		|ГДЕ
		|	СчетКнигиПокупокСуммы.ПоступлениеТоваровИУслуг = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 Ваучер = Ваучер + Выборка.Ваучер + ", ";
	КонецЦикла;

	Если Ваучер <> "" Тогда
		Ваучер = Сред(Ваучер, 1, СтрДлина(Ваучер) - 3);
	КонецЕсли;	
	СуммаДокумента = ПолучитьСуммуПоСтрокам();

КонецПроцедуры
