
Функция ПолучитьЗначениеПоляРасшифровки(Расшифровка)
   
   ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
   
   ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ОтчетОбъект.СхемаКомпоновкиДанных);
   ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, ИсточникНастроек);
   
   // Создадим и инициализируем обработчик расшифровки.
   СтруктураРасшифровки = Новый Структура;
   
   ДанныеРасшифровкиИзХранилища = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	   ЭлементРасшифровки = ДанныеРасшифровкиИзХранилища.Элементы.Получить(Расшифровка);
	   
	   Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
       Для каждого ЗначениеПоляРасшифровки Из ЭлементРасшифровки.ПолучитьПоля() Цикл 

             // заполняем СтруктураРасшифровки 
             СтруктураРасшифровки.Вставить(ЗначениеПоляРасшифровки.Поле, ЗначениеПоляРасшифровки.Значение);

       КонецЦикла;  
       Возврат СтруктураРасшифровки;
   КонецЕсли;
   
   Возврат Неопределено;
   
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Перем текДействие;
	
	ЗначениеПоляРасшифровки = ПолучитьЗначениеПоляРасшифровки(Расшифровка);
	Если ЗначениеПоляРасшифровки.Свойство("ПроводкаDSS") Тогда
		Если ТипЗнч(ЗначениеПоляРасшифровки.ПроводкаDSS) = Тип("ДокументСсылка.ПроводкаDSS") Тогда
			текИсточник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьАдресСхемыКомпоновки());
			
			текОбработка = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, текИсточник);
			мсвДействия = Новый Массив();
			мсвДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
			спзДополнительныеПункты = Новый СписокЗначений;
			спзДополнительныеПункты.Добавить("УстановитьКомментарий", "Установить комментарий");
			
			текНастройка = Неопределено;
			ДействиеРасшифровки = Неопределено;
			текОбработка.ВыбратьДействие(Расшифровка, ДействиеРасшифровки, текНастройка, мсвДействия, спзДополнительныеПункты);
			Если ДействиеРасшифровки = "УстановитьКомментарий" тогда
				СтандартнаяОбработка = Ложь;
				
				//код по установке комментария
				Коммент = "";
				Если ВвестиСтроку(Коммент,"Введите текст комментария:") Тогда
					УстановитьКомментарийНаСервере(ЗначениеПоляРасшифровки, Коммент);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКомментарийНаСервере(ЗначениеПоляРасшифровки, Коммент)
		  Проводка = ЗначениеПоляРасшифровки.ПроводкаDSS.ПолучитьОбъект();
		  Проводка.Комментарий = Коммент;
		  Проводка.Записать();
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСхемыКомпоновки()
	текДанные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	текОтчет = РеквизитФормыВЗначение("Отчет");
	Возврат ПоместитьВоВременноеХранилище(текОтчет.СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
КонецФункции


