
Функция ПолучитьPOLineПоPOnoИPOLineNo(PONo, POLineNo) Экспорт
	
	Если НЕ ЗначениеЗаполнено(PONo) Тогда
		ВызватьИсключение "PO no. is empty!";
	КонецЕсли;
	
	Если ТипЗнч(PONo) <> Тип("Строка") Тогда
		ВызватьИсключение "PO no. must be in text form!";	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(POLineNo) Тогда
		ВызватьИсключение "PO line no. is empty!";
	КонецЕсли;
	
	Если ТипЗнч(POLineNo) <> Тип("Число") Тогда
		ВызватьИсключение "PO line no. must be a number!";	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("PONo", PONo);
	Запрос.УстановитьПараметр("POLineNo", POLineNo);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	POLines.Ссылка
		|ИЗ
		|	Справочник.СтрокиЗаявкиНаЗакупку КАК POLines
		|ГДЕ
		|	POLines.Владелец.Код = &PONo
		|	И POLines.НомерСтрокиЗаявкиНаЗакупку = &POLineNo";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// { RGS DKazanskiy 17.12.2018 15:00:57 - S-I-0006321
Функция ПолучитьСтатусDOC(ЗаяввкаНаЗакупку) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонсолидированныйПакетЗаявокНаПеревозкуИнвойсы.Ссылка.CurrentStatus как Статус
	|ИЗ
	|	Документ.КонсолидированныйПакетЗаявокНаПеревозку.Инвойсы КАК КонсолидированныйПакетЗаявокНаПеревозкуИнвойсы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтрокиИнвойса КАК СтрокиИнвойса
	|		ПО КонсолидированныйПакетЗаявокНаПеревозкуИнвойсы.Инвойс = СтрокиИнвойса.Инвойс
	|			И (СтрокиИнвойса.СтрокаЗаявкиНаЗакупку.Владелец = &ЗаяввкаНаЗакупку)";
	
	Запрос.УстановитьПараметр("ЗаяввкаНаЗакупку", ЗаяввкаНаЗакупку);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Статус;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции
// } RGS DKazanskiy 17.12.2018 15:00:59 - S-I-0006321

// { RGS DKazanskiy 20.12.2018 13:52:25 - S-I-0006324
Процедура ОбновитьФлагEUCNotRequired(POLine) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиИнвойса.Ссылка
	|ИЗ
	|	Справочник.СтрокиИнвойса КАК СтрокиИнвойса
	|ГДЕ
	|	СтрокиИнвойса.СтрокаЗаявкиНаЗакупку = &СтрокаЗаявкиНаЗакупку
	|	И СтрокиИнвойса.EUCNotRequired";
	
	Запрос.УстановитьПараметр("СтрокаЗаявкиНаЗакупку", POLine);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Объект = Результат.ссылка.ПолучитьОбъект();
		Объект.Заблокировать();
		Объект.ОбменДанными.Загрузка = Истина;
		
		Объект.EUCNotRequired = Ложь;
		
		Попытка 
			Объект.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
// } RGS DKazanskiy 20.12.2018 13:52:33 - S-I-0006324