Функция ПолучитьДанныеОрганизацияПриИзменении(ПараметрыДокумента) Экспорт

	ТекПользователь = Пользователи.ТекущийПользователь();

	Если ПараметрыДокумента.Свойство("Организация") Тогда

		Если ПараметрыДокумента.Свойство("ПодразделениеОрганизации")
		   И ЗначениеЗаполнено(ПараметрыДокумента.Организация) Тогда

			ПодразделениеПоУмолчанию = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");

			// Если ПодразделениеОрганизации не заполнено.
			Если НЕ ЗначениеЗаполнено(ПараметрыДокумента.ПодразделениеОрганизации) Тогда
				// Если ПодразделениеПоУмолчанию соответствует выбранной организации, подставляем его.
				Если БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ПодразделениеПоУмолчанию, ПараметрыДокумента.Организация) Тогда
					ПараметрыДокумента.ПодразделениеОрганизации = ПодразделениеПоУмолчанию;
				КонецЕсли;
			Иначе
				// Если ПодразделениеОрганизации не соответствует выбранной организации.
				Если НЕ БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ПараметрыДокумента.ПодразделениеОрганизации, ПараметрыДокумента.Организация) Тогда
					// Если ПодразделениеПоУмолчанию соответствует выбранной организации, подставляем его.
					Если БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ПодразделениеПоУмолчанию, ПараметрыДокумента.Организация) Тогда
						ПараметрыДокумента.ПодразделениеОрганизации = ПодразделениеПоУмолчанию;
					Иначе // Выбрана не основная организация. ПодразделениеОрганизации нужно очистить.
						ПараметрыДокумента.ПодразделениеОрганизации = БухгалтерскийУчетПереопределяемый.ПустоеПодразделение();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если ПараметрыДокумента.Свойство("ДоговорКонтрагента")
		   И ЗначениеЗаполнено(ПараметрыДокумента.Организация)
		   И ЗначениеЗаполнено(ПараметрыДокумента.ДоговорКонтрагента)
		   И НЕ ПараметрыДокумента.ДоговорКонтрагента.Организация = ПараметрыДокумента.Организация Тогда
			ПараметрыДокумента.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;

	Возврат ПараметрыДокумента;

КонецФункции

Функция ПолучитьДанныеКонтрагентПриИзменении(ПараметрыДокумента, СписокВидовДоговоров = Неопределено,
	                                         СтруктураДополнительныхПараметров = Неопределено) Экспорт

	Если ПараметрыДокумента.Свойство("ДоговорКонтрагента") Тогда
	 	БухгалтерскийУчетПереопределяемый.УстановитьДоговорКонтрагента(ПараметрыДокумента.ДоговорКонтрагента,
									ПараметрыДокумента.Контрагент,
									ПараметрыДокумента.Организация,
									СписокВидовДоговоров,
									СтруктураДополнительныхПараметров);
	КонецЕсли;

	Если ПараметрыДокумента.Свойство("Сделка") Тогда
		Если ПараметрыДокумента.Сделка <> Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
			ПараметрыДокумента.Вставить("Сделка", Неопределено);
		КонецЕсли;
	КонецЕсли;

	Возврат ПараметрыДокумента;

КонецФункции

// Процедура выполняет общие действия при изменении контрагента
//
// Параметры:
//  ДокументОбъект - объект редактируемого документа
//
Процедура ПриИзмененииЗначенияКонтрагента(ДокументОбъект,СписокВидовДоговоров = Неопределено,СтруктураДополнительныхПараметров = Неопределено,
	                                      НаименованиеРеквизитаДоговора = "", НаименованиеРеквизитаКонтрагента = "") Экспорт

	Если НЕ ЗначениеЗаполнено(НаименованиеРеквизитаКонтрагента) Тогда
	    НаименованиеРеквизитаКонтрагента = "Контрагент";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НаименованиеРеквизитаДоговора) Тогда
	    НаименованиеРеквизитаДоговора = "ДоговорКонтрагента";
	КонецЕсли;

	МетаданныеДокумента = ДокументОбъект.Ссылка.Метаданные();

	Если ОбщегоНазначения.ЕстьРеквизитОбъекта(НаименованиеРеквизитаДоговора, МетаданныеДокумента) Тогда

	 	БухгалтерскийУчетПереопределяемый.УстановитьДоговорКонтрагента(ДокументОбъект[НаименованиеРеквизитаДоговора],
									ДокументОбъект[НаименованиеРеквизитаКонтрагента],
									ДокументОбъект["Организация"],
									СписокВидовДоговоров,
									СтруктураДополнительныхПараметров);

	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Сделка", МетаданныеДокумента)
		И НЕ ТипЗнч(ДокументОбъект.Сделка) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда

		ДокументОбъект.Сделка = Неопределено;

	КонецЕсли;

КонецПроцедуры // ПриИзмененииЗначенияКонтрагента()

// Процедура - обработчик события ПриИзменении поля ввода Организация
//
// Параметры:
//  ДокументОбъект - объект документ в форме которого произошло событие.
//  ТекПользователь - текущий пользователь, настройки которого используются
//                 по умолчанию.
//
Процедура ПриИзмененииЗначенияОрганизации(ДокументОбъект, ТекПользователь) Экспорт

	МетаданныеДокумента = ДокументОбъект.Ссылка.Метаданные();
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеДокумента) Тогда

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПодразделениеОрганизации", МетаданныеДокумента)
		   И ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда

			ПодразделениеПоУмолчанию = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");

			// Если ПодразделениеОрганизации не заполнено.
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.ПодразделениеОрганизации) Тогда

				// Если ПодразделениеПоУмолчанию соответствует выбранной организации, подставляем его.
				Если БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ПодразделениеПоУмолчанию, ДокументОбъект.Организация) Тогда
					ДокументОбъект.ПодразделениеОрганизации = ПодразделениеПоУмолчанию;
				КонецЕсли;

			Иначе // Если ПодразделениеОрганизации заполнено.

				// Если ПодразделениеОрганизации не соответствует выбранной организации.
				Если НЕ БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ДокументОбъект.ПодразделениеОрганизации, ДокументОбъект.Организация) Тогда

					// Если ПодразделениеПоУмолчанию соответствует выбранной организации, подставляем его.
					Если БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ПодразделениеПоУмолчанию, ДокументОбъект.Организация) Тогда
						ДокументОбъект.ПодразделениеОрганизации = ПодразделениеПоУмолчанию;
					Иначе // Выбрана не основная организация. ПодразделениеОрганизации нужно очистить.
						ДокументОбъект.ПодразделениеОрганизации = БухгалтерскийУчетПереопределяемый.ПустоеПодразделение();
					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКонтрагента", МетаданныеДокумента)
		   И ЗначениеЗаполнено(ДокументОбъект.Организация)
		   И ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда
		   
		   	РеквизитыДоговора = БухгалтерскийУчетПереопределяемый.ПолучитьРеквизитыДоговораКонтрагента(ДокументОбъект.ДоговорКонтрагента);
		   
		   	Если РеквизитыДоговора.Организация <> ДокументОбъект.Организация Тогда
				ДокументОбъект.ДоговорКонтрагента = Неопределено;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ПриИзмененииЗначенияОрганизации()

// Определяет курс документа, который равен либо курсу документа (если в документе он существует),
// либо курсу взаиморасчетов, либо 1.
//
// Параметры:
//  ДокументОбъект                 - объект документа, курс которого надо получить
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//
// Возвращаемое значение:
//  Число - курс документа.
//
Функция КурсДокумента(ДокументОбъект, ВалютаРегламентированногоУчета) Экспорт

	МетаданныеДокумента = ДокументОбъект.Ссылка.Метаданные();

	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", МетаданныеДокумента) Тогда
		// Если валюта документа совпадает с валютой регл. учета, то курс 1.
		Если (ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента)) И (ДокументОбъект.ВалютаДокумента <> ВалютаРегламентированногоУчета) Тогда

			МетаданныеДокумента = ДокументОбъект.Ссылка.Метаданные();

			// Если есть реквизит КурсДокумента - его и вернем
			Если ТипЗнч(ДокументОбъект) = Тип("Структура") И ДокументОбъект.Свойство("КурсДокумента")
				ИЛИ ТипЗнч(ДокументОбъект) <> Тип("Структура") И ОбщегоНазначения.ЕстьРеквизитОбъекта("КурсДокумента", МетаданныеДокумента) Тогда
				Возврат ДокументОбъект.КурсДокумента;
			КонецЕсли;

			// Если нет КурсДокумента и валюта документа не совпадает с валютой регл. учета,
			// то такой документ может быть выписан только в валюте взаиморасчетов,
			// если есть реквизит КурсВзаиморасчетов - его и вернем.
			Если ТипЗнч(ДокументОбъект) = Тип("Структура") И ДокументОбъект.Свойство("КурсВзаиморасчетов")
				ИЛИ ТипЗнч(ДокументОбъект) <> Тип("Структура") И ОбщегоНазначения.ЕстьРеквизитОбъекта("КурсВзаиморасчетов", МетаданныеДокумента) Тогда
				Возврат ДокументОбъект.КурсВзаиморасчетов;
			КонецЕсли;

			// Если нет КурсВзаиморасчетов и валюта документа не совпадает с валютой регл. учета,
			// то КурсВзаиморасчетов должен быть в табличной части документа или может вообще отсутствовать.
			// Тогда возьмем курс из справочника на дату документа.
			Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,ДокументОбъект.Дата).Курс;

		КонецЕсли;
	КонецЕсли;

	Возврат 1;

КонецФункции // КурсДокумента()

// Определяет кратность документа, которая равен либо кратности документа (если в документе она существует),
// либо кратности взаиморасчетов, либо 1.
//
// Параметры:
//  ДокументОбъект - объект документа, курс которого надо получить
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//
// Возвращаемое значение:
//  Число - кратность валюты в документе.
//
Функция КратностьДокумента(ДокументОбъект, ВалютаРегламентированногоУчета) Экспорт

	МетаданныеДокумента = ДокументОбъект.Ссылка.Метаданные();

	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", МетаданныеДокумента) Тогда
		// Если валюта документа совпадает с валютой регл. учета, то кратность 1.
		Если (ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента)) И (ДокументОбъект.ВалютаДокумента <> ВалютаРегламентированногоУчета) Тогда

			// Если есть реквизит КратностьДокумента - его и вернем
			Если ТипЗнч(ДокументОбъект) = Тип("Структура") И ДокументОбъект.Свойство("КратностьДокумента")
				ИЛИ ТипЗнч(ДокументОбъект) <> Тип("Структура") И ОбщегоНазначения.ЕстьРеквизитОбъекта("КратностьДокумента", МетаданныеДокумента) Тогда
				Возврат ДокументОбъект.КратностьДокумента;
			КонецЕсли;

			// Если нет КратностьДокумента и валюта документа не совпадает с валютой регл. учета,
			// то такой документ может быть выписан только в валюте взаиморасчетов,
			// если есть реквизит КратностьВзаиморасчетов - его и вернем.
			Если ТипЗнч(ДокументОбъект) = Тип("Структура") И ДокументОбъект.Свойство("КратностьВзаиморасчетов")
				ИЛИ ТипЗнч(ДокументОбъект) <> Тип("Структура") И ОбщегоНазначения.ЕстьРеквизитОбъекта("КратностьВзаиморасчетов", МетаданныеДокумента) Тогда
				Возврат ДокументОбъект.КратностьВзаиморасчетов;
			КонецЕсли;

			// Если нет КратностьВзаиморасчетов и валюта документа не совпадает с валютой регл. учета,
			// то КратностьВзаиморасчетов должна быть в табличной части документа или может вообще отсутствовать.
			//Тогда возьмем Кратность из справочника на дату документа.
			Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,ДокументОбъект.Дата).Кратность;

		КонецЕсли;
    КонецЕсли;

	Возврат 1;

КонецФункции // КратностьДокумента()

Процедура УдалитьКлючИзСтруктуры(Структура, Ключ)

	Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство(Ключ) Тогда
		Структура.Удалить(Ключ);
	КонецЕсли;

КонецПроцедуры

// Для реквизита ПодразделениеОрганизации.
// Как правило, не следует применять для ПодразделениеЗатрат
Функция ПолучитьПодразделениеПоУмолчанию(ДокументОбъект, МетаданныеДокумента)
	ПодразделениеОрганизации = БухгалтерскийУчетПереопределяемый.ПустоеПодразделение();
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеДокумента)
		И ЗначениеЗаполнено(ДокументОбъект.Склад)
		И ДокументОбъект.Склад.Метаданные().Реквизиты.Найти("ПодразделениеОрганизации") <> Неопределено Тогда
		РеквизитыСклада = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.Склад, "ПодразделениеОрганизации");
		ПодразделениеОрганизации = РеквизитыСклада.ПодразделениеОрганизации;
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("СчетОрганизации", МетаданныеДокумента)
		И ЗначениеЗаполнено(ДокументОбъект.СчетОрганизации)
		И ДокументОбъект.СчетОрганизации.Метаданные().Реквизиты.Найти("ПодразделениеОрганизации") <> Неопределено Тогда
		РеквизитыСчетаОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.СчетОрганизации, "ПодразделениеОрганизации");
		ПодразделениеОрганизации = РеквизитыСчетаОрганизации.ПодразделениеОрганизации;
	Иначе
		ПодразделениеОрганизации = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");
	КонецЕсли;

    Возврат(ПодразделениеОрганизации);

КонецФункции

// Процедура предназначена для заполнения общих реквизитов документов,
// вызывается в обработчиках событий "ОбработкаЗаполнения" в модулях документов.
//
// Параметры:
//  ДокументОбъект   - <ДокументОбъект> - документ, реквизиты которого необходимо заполнить
//  ДанныеЗаполнения - <Структура> или <Неопределено> - одноименный параметр обработчика ОбработкаЗаполнения документа
//
Процедура Заполнить(ДокументОбъект, ДанныеЗаполнения = Неопределено, ЗаполнятьСчетаУчета = Ложь) Экспорт
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДокументОбъект.Дата = НачалоДня(ОбщегоНазначенияБП.ПолучитьРабочуюДату());
	КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьПоСтруктуре(ДокументОбъект, ДанныеЗаполнения, МетаданныеДокумента);
	КонецЕсли;
	                                 
	ЕстьРеквизитОрганизация          = ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация",          МетаданныеДокумента);
	ЕстьРеквизитКонтрагент           = ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент",           МетаданныеДокумента);
	ЕстьРеквизитДоговор              = ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКонтрагента",   МетаданныеДокумента);
	ЕстьРеквизитВалютаДокумента      = ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента",      МетаданныеДокумента);
	ЕстьРеквизитВалютаВзаиморасчетов = ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаВзаиморасчетов", МетаданныеДокумента);
	ЕстьРеквизитСчетОрганизации      = ОбщегоНазначения.ЕстьРеквизитОбъекта("СчетОрганизации",      МетаданныеДокумента);
	ЕстьРеквизитСчетКасса            = ОбщегоНазначения.ЕстьРеквизитОбъекта("СчетКасса",            МетаданныеДокумента);
	
	// Проверяем корректность связанных реквизитов, заполненных из ДанныхЗаполнения документа:
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("РучнаяКорректировка", МетаданныеДокумента) Тогда
		ДокументОбъект.РучнаяКорректировка = Ложь;
	КонецЕсли;
	
	Если ЕстьРеквизитДоговор
		И ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда
		
		СвойстваДоговора = БухгалтерскийУчетПереопределяемый.ПолучитьРеквизитыДоговораКонтрагента(ДокументОбъект.ДоговорКонтрагента);
		       
		Если ЕстьРеквизитКонтрагент Тогда
			Если ЗначениеЗаполнено(ДокументОбъект.Контрагент)
				И ДокументОбъект.Контрагент <> СвойстваДоговора.Владелец Тогда
				ДокументОбъект.ДоговорКонтрагента = Неопределено;
				СвойстваДоговора = Неопределено;
				УдалитьКлючИзСтруктуры(ДанныеЗаполнения, "ДоговорКонтрагента");
			Иначе
				ДокументОбъект.Контрагент = СвойстваДоговора.Владелец;
			КонецЕсли;       
		КонецЕсли;
		
		Если СвойстваДоговора <> Неопределено
			И ЕстьРеквизитОрганизация Тогда
			Если ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
				Если ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(ДокументОбъект.Организация) <> СвойстваДоговора.Организация Тогда
					ДокументОбъект.ДоговорКонтрагента = Неопределено;
					Если ЕстьРеквизитКонтрагент Тогда
						ДокументОбъект.Контрагент = Неопределено
					КонецЕсли;
					СвойстваДоговора    = Неопределено;
					УдалитьКлючИзСтруктуры(ДанныеЗаполнения, "ДоговорКонтрагента");
				КонецЕсли;
			Иначе
				ДокументОбъект.Организация = СвойстваДоговора.Организация;
			КонецЕсли;
		КонецЕсли;
		
		Если СвойстваДоговора <> Неопределено Тогда
			Если ЕстьРеквизитВалютаДокумента Тогда
				ДокументОбъект.ВалютаДокумента = ?(СвойстваДоговора.РасчетыВУсловныхЕдиницах
					И ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета,
					ВалютаРегламентированногоУчета, СвойстваДоговора.ВалютаВзаиморасчетов);
			КонецЕсли;
			Если ЕстьРеквизитВалютаВзаиморасчетов Тогда
				ДокументОбъект.ВалютаВзаиморасчетов = СвойстваДоговора.ВалютаВзаиморасчетов;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполняем реквизиты значениями по умолчанию:
	Если ЕстьРеквизитОрганизация И НЕ ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
		ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		Если НЕ ЗначениеЗаполнено(ОсновнаяОрганизация) И НЕ Справочники.Организации.ИспользуетсяНесколькоОрганизаций() Тогда
			ВызватьИсключение ВернутьСтр("ru = 'Не заполнены реквизиты организации'");
		КонецЕсли;
		ДокументОбъект.Организация = ОсновнаяОрганизация;
	КонецЕсли;
	
	ПлательщикНДС = ЕстьРеквизитОрганизация И УчетнаяПолитика.ПлательщикНДС(ДокументОбъект.Организация, ДокументОбъект.Дата);
	
	Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("СтруктурнаяЕдиница", ДокументОбъект, МетаданныеДокумента)
		И ЕстьРеквизитОрганизация Тогда
		ДокументОбъект.СтруктурнаяЕдиница = БухгалтерскийУчетПереопределяемый.ПолучитьБанковскийСчетПоУмолчанию(ДокументОбъект.Организация);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответственный", МетаданныеДокумента) Тогда
		ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("ВидОперации", ДокументОбъект, МетаданныеДокумента) Тогда
		ДокументОбъект.ВидОперации = Перечисления[ДокументОбъект.ВидОперации.Метаданные().Имя][0];
	КонецЕсли;
	
	Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("Склад", ДокументОбъект, МетаданныеДокумента) Тогда
		ДокументОбъект.Склад = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");
	КонецЕсли;
	
	Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("СкладОрдер", ДокументОбъект, МетаданныеДокумента) Тогда
		ДокументОбъект.СкладОрдер = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");
	КонецЕсли;
	
	ИмяРеквизитаСтавкаНДС = "";
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СтавкаНДС", МетаданныеДокумента) Тогда
		ИмяРеквизитаСтавкаНДС = "СтавкаНДС";
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("СтавкаНДСВознаграждения", МетаданныеДокумента) Тогда
		ИмяРеквизитаСтавкаНДС = "СтавкаНДСВознаграждения";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяРеквизитаСтавкаНДС) И НЕ ЗначениеЗаполнено(ДокументОбъект[ИмяРеквизитаСтавкаНДС]) Тогда
		
		ДокументЯвляетсяРеализацией	= БухгалтерскийУчетКлиентСерверПереопределяемый.ДокументЯвляетсяРеализацией(ДокументОбъект.Ссылка);
		
		Если НЕ ПлательщикНДС И ДокументЯвляетсяРеализацией Тогда
			ДокументОбъект[ИмяРеквизитаСтавкаНДС]	= Перечисления.СтавкиНДС.БезНДС;
		Иначе
			ДокументОбъект[ИмяРеквизитаСтавкаНДС]	= РГСофт.ПолучитьСсылкуСтавкаНДСОтПериода(ДокументОбъект.Дата);// { RGS EParshina 29.12.2018 16:01:54 - SLI-0007797
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("БанковскийСчет", ДокументОбъект, МетаданныеДокумента) Тогда
		ДокументОбъект.БанковскийСчет = БухгалтерскийУчетПереопределяемый.ПолучитьБанковскийСчетПоУмолчанию(ДокументОбъект.Организация);
		Если ЕстьРеквизитВалютаДокумента Тогда
			ДокументОбъект.ВалютаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.БанковскийСчет, "ВалютаДенежныхСредств");
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("СчетОрганизации", ДокументОбъект, МетаданныеДокумента) Тогда
		Если ТипДанныхЗаполнения = Тип("Структура") И ДанныеЗаполнения.Свойство("БанковскийСчет")
			И ЗначениеЗаполнено(ДанныеЗаполнения.БанковскийСчет) Тогда
			ДокументОбъект.СчетОрганизации = ДанныеЗаполнения.БанковскийСчет;
		Иначе
			УчетДенежныхСредствБП.УстановитьБанковскийСчет(
				ДокументОбъект.СчетОрганизации, ДокументОбъект.Организация, ДокументОбъект.ВалютаДокумента, ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента));
		КонецЕсли;
		
		Если ЕстьРеквизитВалютаДокумента И НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
			ДокументОбъект.ВалютаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.СчетОрганизации, "ВалютаДенежныхСредств");
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьРеквизитСчетОрганизации И ЕстьРеквизитВалютаДокумента И ЗначениеЗаполнено(ДокументОбъект.СчетОрганизации) Тогда
		ВалютаСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.СчетОрганизации, "ВалютаДенежныхСредств");
		Если ВалютаСчета <> ДокументОбъект.ВалютаДокумента Тогда
			ДокументОбъект.ВалютаДокумента = ВалютаСчета;
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация
		И ЗначениеЗаполнено(ДокументОбъект.Организация)
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("ПодразделениеОрганизации", МетаданныеДокумента)
		И НЕ БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ДокументОбъект.ПодразделениеОрганизации, ДокументОбъект.Организация) Тогда
		
		ПодразделениеОрганизации = ПолучитьПодразделениеПоУмолчанию(ДокументОбъект, МетаданныеДокумента);
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) 
			И БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ПодразделениеОрганизации, ДокументОбъект.Организация) Тогда
			ДокументОбъект.ПодразделениеОрганизации = ПодразделениеОрганизации;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация
		И ЗначениеЗаполнено(ДокументОбъект.Организация)
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("МестонахождениеОС", МетаданныеДокумента)
		И НЕ БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ДокументОбъект.МестонахождениеОС, ДокументОбъект.Организация) Тогда
		
		МестонахождениеОС = ПолучитьПодразделениеПоУмолчанию(ДокументОбъект, МетаданныеДокумента);
		Если ЗначениеЗаполнено(МестонахождениеОС) 
			И БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(МестонахождениеОС, ДокументОбъект.Организация) Тогда
			ДокументОбъект.МестонахождениеОС = МестонахождениеОС;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация
		И ЗначениеЗаполнено(ДокументОбъект.Организация)
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("Местонахождение", МетаданныеДокумента)
		И НЕ БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ДокументОбъект.Местонахождение, ДокументОбъект.Организация) Тогда
		
		Местонахождение = ПолучитьПодразделениеПоУмолчанию(ДокументОбъект, МетаданныеДокумента);
		Если ЗначениеЗаполнено(Местонахождение) 
			И БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(Местонахождение, ДокументОбъект.Организация) Тогда
			ДокументОбъект.Местонахождение = Местонахождение;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьРеквизитВалютаДокумента И НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
		ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета;
	КонецЕсли;
	
	Если ЕстьРеквизитВалютаВзаиморасчетов И НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаВзаиморасчетов) Тогда
		ДокументОбъект.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КурсДокумента", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.КурсДокумента)
			ИЛИ ДокументОбъект.ВалютаДокумента <> ВалютаРегламентированногоУчета И ДокументОбъект.КурсДокумента = 1 Тогда
			
			СтруктураКурсаДокумента      = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
			ДокументОбъект.КурсДокумента = СтруктураКурсаДокумента.Курс;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КратностьДокумента", МетаданныеДокумента) Тогда
				ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КурсВзаиморасчетов", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.КурсВзаиморасчетов)
			ИЛИ ДокументОбъект.ВалютаДокумента <> ВалютаРегламентированногоУчета И ДокументОбъект.КурсВзаиморасчетов = 1 Тогда
			
			СтруктураКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
			ДокументОбъект.КурсВзаиморасчетов = СтруктураКурсаДокумента.Курс;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КратностьВзаиморасчетов", МетаданныеДокумента) Тогда
				ДокументОбъект.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("ЗанимаемыхСтавок", ДокументОбъект, МетаданныеДокумента) Тогда
		ДокументОбъект.ЗанимаемыхСтавок = 1;
	КонецЕсли;
	
	Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("ДатаС", ДокументОбъект, МетаданныеДокумента) Тогда
		ДокументОбъект.ДатаС = ДокументОбъект.Дата;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НДСВключенВСтоимость", МетаданныеДокумента) Тогда
		
		ДокументОбъект.НДСВключенВСтоимость = НЕ ПлательщикНДС;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДокументБезНДС", МетаданныеДокумента)
		И НЕ ТипДанныхЗаполнения = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		
		ДокументОбъект.ДокументБезНДС = НЕ ПлательщикНДС;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("ПериодРегистрации", ДокументОбъект, МетаданныеДокумента) Тогда
		ДокументОбъект.ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("СпособЗачетаАвансов", ДокументОбъект, МетаданныеДокумента) Тогда
		ДокументОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
	КонецЕсли;
	
	//Обновление на бух. корп. 3.0.38.43
	//Если (ДанныеЗаполнения = Неопределено ИЛИ ТипДанныхЗаполнения = Тип("Структура"))
	//	И ОбщегоНазначения.ЕстьРеквизитОбъекта("ДеятельностьНаПатенте", МетаданныеДокумента) Тогда
	//	
	//	ЗаполнитьЗначенияСвойств(ДокументОбъект, НалоговыйУчетУСН.ДеятельностьНаПатентеПоУмолчанию(ДокументОбъект.Организация, ДокументОбъект.Дата));
	//	
	//	Если ТипДанныхЗаполнения = Тип("Структура") И ДанныеЗаполнения.Свойство("ДеятельностьНаПатенте") Тогда
	//		ДокументОбъект.ДеятельностьНаПатенте	= ДанныеЗаполнения.ДеятельностьНаПатенте;
	//		Если НЕ ДанныеЗаполнения.ДеятельностьНаПатенте Тогда
	//			ДокументОбъект.Патент	= Справочники.Патенты.ПустаяСсылка();
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//<=
	
	//Обновление на бух. корп. 3.0.38.43
	//Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("Руководитель", ДокументОбъект, МетаданныеДокумента)
	//	ИЛИ ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("ГлавныйБухгалтер", ДокументОбъект, МетаданныеДокумента)
	//	ИЛИ ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("Исполнитель", ДокументОбъект, МетаданныеДокумента)Тогда
	//	
	//	ОтветственныеЛицаБП.УстановитьОтветственныхЛиц(ДокументОбъект);
	//	
	//КонецЕсли;
	//<=
	
	// Заполнение реквизитов расчетного документа
	Если ОбщегоНазначенияБП.ЕстьТабЧастьДокумента("РасшифровкаПлатежа", МетаданныеДокумента) Тогда
		Если ДокументОбъект.РасшифровкаПлатежа.Количество() = 0 Тогда
			СтрокаПлатеж = ДокументОбъект.РасшифровкаПлатежа.Добавить();
			Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитТабЧастиДокумента("СтавкаНДС", СтрокаПлатеж, МетаданныеДокумента, "РасшифровкаПлатежа") Тогда
				Если ЕстьРеквизитОрганизация И ЗначениеЗаполнено(ДокументОбъект.Организация) 
					И (МетаданныеДокумента.Имя = "ПриходныйКассовыйОрдер" ИЛИ МетаданныеДокумента.Имя = "ПоступлениеНаРасчетныйСчет") Тогда
					// { RGS EParshina 29.12.2018 16:04:28 - SLI-0007797					
					СтрокаПлатеж.СтавкаНДС = ?(НЕ ПлательщикНДС, Перечисления.СтавкиНДС.БезНДС, РГСофт.ПолучитьСсылкуСтавкаНДСОтПериода(ДокументОбъект.Дата));
					//СтрокаПлатеж.СтавкаНДС = ?(НЕ ПлательщикНДС, Перечисления.СтавкиНДС.БезНДС, Перечисления.СтавкиНДС.НДС18);
					// } RGS EParshina 29.12.2018 16:04:28 - SLI-0007797
				Иначе					
					// { RGS EParshina 29.12.2018 16:04:28 - SLI-0007797					
					СтрокаПлатеж.СтавкаНДС = РГСофт.ПолучитьСсылкуСтавкаНДСОтПериода(ДокументОбъект.Дата);
					//СтрокаПлатеж.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
					// } RGS EParshina 29.12.2018 16:04:28 - SLI-0007797
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтрокаПлатеж = ДокументОбъект.РасшифровкаПлатежа[0];
		КонецЕсли;
		
		Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("СчетОрганизации", ДокументОбъект, МетаданныеДокумента) Тогда
			ДокументОбъект.СчетОрганизации = Неопределено;
			Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПриобретениеИностраннойВалюты Тогда
				УчетДенежныхСредствБП.УстановитьБанковскийСчет(
					ДокументОбъект.СчетОрганизации, ДокументОбъект.Организация, ВалютаРегламентированногоУчета, Ложь);
				Если ЗначениеЗаполнено(ДокументОбъект.СчетОрганизации) Тогда
					РеквизитыСчетаОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.СчетОрганизации, "ВалютаДенежныхСредств");
					ДокументОбъект.ВалютаДокумента = РеквизитыСчетаОрганизации.ВалютаДенежныхСредств;
				КонецЕсли;
			Иначе
				УчетДенежныхСредствБП.УстановитьБанковскийСчет(
					ДокументОбъект.СчетОрганизации, ДокументОбъект.Организация, ДокументОбъект.ВалютаДокумента);
			КонецЕсли;
		КонецЕсли;
		Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("ПодразделениеОрганизации", ДокументОбъект, МетаданныеДокумента) Тогда
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СчетОрганизации", МетаданныеДокумента)
				И ТипЗнч(ДокументОбъект.СчетОрганизации) = БухгалтерскийУчетКлиентСерверПереопределяемый.ТипЗначенияБанковскогоСчетаОрганизации() Тогда
				
				РеквизитыСчетаОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.СчетОрганизации, "ПодразделениеОрганизации");
				Если ЗначениеЗаполнено(РеквизитыСчетаОрганизации.ПодразделениеОрганизации) Тогда
					ДокументОбъект.ПодразделениеОрганизации = РеквизитыСчетаОрганизации.ПодразделениеОрганизации;
				КонецЕсли;
			Иначе
				ОсновноеПодразделение = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(ОсновноеПодразделение)
					И БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ОсновноеПодразделение, ДокументОбъект.Организация) Тогда
					ДокументОбъект.ПодразделениеОрганизации = ОсновноеПодразделение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Обновление на бух. корп. 3.0.38.43
		//Если УчетУСН.ЕстьАвансыПокупателей(ДокументОбъект.ВидОперации)
		//	И ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитТабЧастиДокумента(
		//		"ПорядокОтраженияАванса", СтрокаПлатеж, МетаданныеДокумента, "РасшифровкаПлатежа") Тогда
		//		
		//		СтруктураПорядокОтраженияАвансов = НалоговыйУчетУСН.ПорядокОтраженияАвансовПоУмолчанию(ДокументОбъект.Организация, ДокументОбъект.Дата);
		//		СтрокаПлатеж.ПорядокОтраженияАванса = ?(СтруктураПорядокОтраженияАвансов.ПорядокОтраженияАванса = Перечисления.ПорядокОтраженияАвансов.ДоходПатент,
		//			СтруктураПорядокОтраженияАвансов.Патент, СтруктураПорядокОтраженияАвансов.ПорядокОтраженияАванса);
		//			
		//КонецЕсли;
		//<=
		
		//Обновление на бух. корп. 3.0.38.43
		//ЕстьРасчетыСКонтрагентами = УчетДенежныхСредствКлиентСервер.ЕстьРасчетыСКонтрагентами(ДокументОбъект.ВидОперации);
		//ЕстьРасчетыПоКредитам     = УчетДенежныхСредствКлиентСервер.ЕстьРасчетыПоКредитам(ДокументОбъект.ВидОперации);
		//
		//Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		//	Если ОбщегоНазначенияБП.ЕстьНезаполненныйРеквизитДокумента("СчетКонтрагента", ДокументОбъект, МетаданныеДокумента)
		//		И ТипЗнч(ДокументОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		//		БанковскийСчетКонтрагента = БухгалтерскийУчетПереопределяемый.ПолучитьБанковскийСчетПоУмолчанию(ДокументОбъект.Контрагент);
		//		Если ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
		//			ВалютаБанковскогоСчетаКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчетКонтрагента, "ВалютаДенежныхСредств");
		//			ВалютаБанковскогоСчетаОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.СчетОрганизации, "ВалютаДенежныхСредств");
		//			Если ВалютаБанковскогоСчетаКонтрагента = ВалютаБанковскогоСчетаОрганизации
		//				ИЛИ НЕ ЗначениеЗаполнено(ВалютаБанковскогоСчетаОрганизации)
		//				И ЕстьРеквизитВалютаДокумента И ВалютаБанковскогоСчетаКонтрагента = ДокументОбъект.ВалютаДокумента Тогда
		//				ДокументОбъект.СчетКонтрагента = БанковскийСчетКонтрагента;
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//	Если НЕ ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента)
		//		И ЗначениеЗаполнено(ДокументОбъект.Контрагент)
		//		И ТипЗнч(ДокументОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		//		РеквизитыКонтрагента 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.Контрагент, "ОсновнойДоговорКонтрагента");
		//		ОсновнойДоговорКонтрагента = УчетВзаиморасчетов.ДоступныйДоговорКонтрагента(РеквизитыКонтрагента.ОсновнойДоговорКонтрагента);
		//		РеквизитыДоговора		= БухгалтерскийУчетПереопределяемый.ПолучитьРеквизитыДоговораКонтрагента(ОсновнойДоговорКонтрагента);
		//		Если УчетДенежныхСредствКлиентСервер.ОпределитьВидДоговораСКонтрагентом(
		//				ДокументОбъект.ВидОперации).Найти(ОсновнойДоговорКонтрагента.ВидДоговора) <> Неопределено Тогда
		//			Если ДокументОбъект.Организация.Пустая() Тогда
		//				СтрокаПлатеж.ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
		//				Организация = РеквизитыДоговора.Организация;
		//			ИначеЕсли РеквизитыДоговора.Организация.Пустая()
		//				ИЛИ РеквизитыДоговора.Организация=ДокументОбъект.Организация Тогда
		//				СтрокаПлатеж.ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
		//			КонецЕсли;
		//		КонецЕсли;
		//		Если ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента) Тогда
		//			СтруктураКурсаВзаиморасчетов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(
		//				РеквизитыДоговора.ВалютаВзаиморасчетов, ДокументОбъект.Дата);
		//			СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		//			СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
		//			Если НЕ РеквизитыДоговора.РасчетыВУсловныхЕдиницах Тогда
		//				ДокументОбъект.ВалютаДокумента = РеквизитыДоговора.ВалютаВзаиморасчетов;
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		//<=
		
		
	КонецЕсли;
	
	//Обновление на бух. корп. 3.0.38.43
	//Если ЗаполнятьСчетаУчета Тогда
	//	СчетаУчетаВДокументах.ЗаполнитьПередОтображениемПользователю(ДокументОбъект);
	//КонецЕсли;
	//<=
	
КонецПроцедуры

// Процедура предназначена для заполнения общих реквизитов документов по документу основанию,
//	вызывается в обработчиках событий "ОбработкаЗаполнения" в модулях документов.
//
// Параметры:
//  ДокументОбъект  - объект редактируемого документа,
//  ДокументОснование - объект документа основания
//  КопироватьПодразделение - булево - если да - подразделение организации берется из документа-основания,
//										если нет - из реквизита СчетОрганизации или настройки пользователя
//
Процедура ЗаполнитьПоОснованию(ДокументОбъект, ДокументОснование, КопироватьПодразделение = Истина) Экспорт

	МетаданныеДокумента          = ДокументОбъект.Метаданные();
	МетаданныеДокументаОснования = ДокументОснование.Метаданные();

	// Дата
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДокументОбъект.Дата = НачалоДня(ОбщегоНазначенияБП.ПолучитьРабочуюДату());
	КонецЕсли;

	// Организация.
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеДокумента)
	   И ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.Организация = ДокументОснование.Организация;
	КонецЕсли;

	// Склад.
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеДокумента)
	   И ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.Склад = ДокументОснование.Склад;
	КонецЕсли;

	// Контрагент.
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеДокумента)
	   И ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.Контрагент = ДокументОснование.Контрагент;
	КонецЕсли;

	// ДоговорКонтрагента.
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКонтрагента", МетаданныеДокумента)
	   И ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКонтрагента", МетаданныеДокументаОснования) Тогда
	   
	   РеквизитыДоговора = БухгалтерскийУчетПереопределяемый.ПолучитьРеквизитыДоговораКонтрагента(ДокументОснование.ДоговорКонтрагента);
	   
	   Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеДокумента)
	      ИЛИ ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(ДокументОбъект.Организация) =
		  	ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(РеквизитыДоговора.Организация) Тогда

			ДокументОбъект.ДоговорКонтрагента = ДокументОснование.ДоговорКонтрагента;

			// КурсВзаиморасчетов.
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КурсВзаиморасчетов", МетаданныеДокумента) Тогда
				СтруктураКурсаВзаиморасчетов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(РеквизитыДоговора.ВалютаВзаиморасчетов, ДокументОбъект.Дата);
				ДокументОбъект.КурсВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Курс;

				// КратностьВзаиморасчетов.
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КратностьВзаиморасчетов", МетаданныеДокумента) Тогда
					ДокументОбъект.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
				КонецЕсли;
			КонецЕсли;
		
		КонецЕсли;

	КонецЕсли;

	// Банковский счет
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("БанковскийСчет", МетаданныеДокумента) Тогда

		// Если в документе-основании есть структурная единица, то берем ее оттуда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СтруктурнаяЕдиница", МетаданныеДокументаОснования) Тогда
			Если ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиница)
			   И ТипЗнч(ДокументОснование.СтруктурнаяЕдиница) = БухгалтерскийУчетКлиентСерверПереопределяемый.ТипЗначенияБанковскогоСчетаОрганизации() Тогда
				ДокументОбъект.БанковскийСчет = ДокументОснование.СтруктурнаяЕдиница;
			КонецЕсли;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("БанковскийСчет", МетаданныеДокументаОснования) Тогда
			Если ЗначениеЗаполнено(ДокументОснование.БанковскийСчет) Тогда
				ДокументОбъект.БанковскийСчет = ДокументОснование.БанковскийСчет;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СчетОрганизации", МетаданныеДокумента) Тогда

		// Если в документе-основании есть структурная единица, то берем ее оттуда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СтруктурнаяЕдиница", МетаданныеДокументаОснования) Тогда
			Если ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиница)
			   И ТипЗнч(ДокументОснование.СтруктурнаяЕдиница) = БухгалтерскийУчетКлиентСерверПереопределяемый.ТипЗначенияБанковскогоСчетаОрганизации() Тогда
				ДокументОбъект.СчетОрганизации = ДокументОснование.СтруктурнаяЕдиница;
			КонецЕсли;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("СчетОрганизации", МетаданныеДокументаОснования) Тогда
			Если ЗначениеЗаполнено(ДокументОснование.СчетОрганизации) Тогда
				ДокументОбъект.СчетОрганизации = ДокументОснование.СчетОрганизации;
			КонецЕсли;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("БанковскийСчет", МетаданныеДокументаОснования) Тогда
			Если ЗначениеЗаполнено(ДокументОснование.БанковскийСчет) Тогда
				ДокументОбъект.СчетОрганизации = ДокументОснование.БанковскийСчет;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	// Подразделение организации
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПодразделениеОрганизации", МетаданныеДокумента) Тогда

		Если КопироватьПодразделение Тогда

			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПодразделениеОрганизации", МетаданныеДокументаОснования) Тогда
				ДокументОбъект.ПодразделениеОрганизации = ДокументОснование.ПодразделениеОрганизации;
			КонецЕсли;

		Иначе

			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СчетОрганизации", МетаданныеДокумента) Тогда
				Если ЗначениеЗаполнено(ДокументОбъект.СчетОрганизации)
					И (ДокументОбъект.СчетОрганизации.Метаданные().Реквизиты.Найти("ПодразделениеОрганизации") <> Неопределено) Тогда
					РеквизитыСчетаОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.СчетОрганизации, "ПодразделениеОрганизации");
					ДокументОбъект.ПодразделениеОрганизации = РеквизитыСчетаОрганизации.ПодразделениеОрганизации;
				КонецЕсли;
			Иначе
				ОсновноеПодразделение = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(ОсновноеПодразделение)
					И БухгалтерскийУчетПереопределяемый.ПодразделениеПринадлежитОрганизации(ОсновноеПодразделение, ДокументОбъект.Организация) Тогда
					ДокументОбъект.ПодразделениеОрганизации = ОсновноеПодразделение;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	// ВалютаДокумента.
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", МетаданныеДокумента)
	   И ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", МетаданныеДокументаОснования) Тогда

		// Если есть касса или банковский счет, то валюта должна браться только оттуда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Касса", МетаданныеДокумента) Тогда
			Если ЗначениеЗаполнено(ДокументОбъект.Касса) Тогда
				РеквизитыКассы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.Касса, "ВалютаДенежныхСредств");
				ДокументОбъект.ВалютаДокумента = РеквизитыКассы.ВалютаДенежныхСредств;
			КонецЕсли;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("БанковскийСчет", МетаданныеДокумента) Тогда
			Если ЗначениеЗаполнено(ДокументОбъект.БанковскийСчет) Тогда
				РеквизитыБанковскогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.БанковскийСчет, "ВалютаДенежныхСредств");
				ДокументОбъект.ВалютаДокумента = РеквизитыБанковскогоСчета.ВалютаДенежныхСредств;
		    КонецЕсли;
		Иначе
			ДокументОбъект.ВалютаДокумента = ДокументОснование.ВалютаДокумента;
		КонецЕсли;

		// КурсДокумента.
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КурсДокумента", МетаданныеДокумента) Тогда
			СтруктураКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
			ДокументОбъект.КурсДокумента = СтруктураКурсаДокумента.Курс;

			// КратностьДокумента.
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КратностьДокумента", МетаданныеДокумента) Тогда
				ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	// ТипЦен.
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ТипЦен", МетаданныеДокумента)
	   И ОбщегоНазначения.ЕстьРеквизитОбъекта("ТипЦен", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.ТипЦен = ДокументОснование.ТипЦен;
	КонецЕсли;

	// СуммаВключаетНДС.
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаВключаетНДС", МетаданныеДокумента)
	   И ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаВключаетНДС", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.СуммаВключаетНДС = ДокументОснование.СуммаВключаетНДС;
	КонецЕсли;

	// НДСВключенВСтоимость.
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НДСВключенВСтоимость", МетаданныеДокумента)
	   И ОбщегоНазначения.ЕстьРеквизитОбъекта("НДСВключенВСтоимость", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.НДСВключенВСтоимость = ДокументОснование.НДСВключенВСтоимость;
	КонецЕсли;
	
	// ДокументБезНДС.
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДокументБезНДС", МетаданныеДокумента)
	   И ОбщегоНазначения.ЕстьРеквизитОбъекта("ДокументБезНДС", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.ДокументБезНДС = ДокументОснование.ДокументБезНДС;
	КонецЕсли;
	
	// СпособЗачетаАвансов
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СпособЗачетаАвансов", МетаданныеДокумента) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СпособЗачетаАвансов", МетаданныеДокументаОснования) Тогда
			ДокументОбъект.СпособЗачетаАвансов = ДокументОснование.СпособЗачетаАвансов;
		Иначе
			ДокументОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
		КонецЕсли;
	КонецЕсли;
	
	// ДеятельностьНаПатенте
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДеятельностьНаПатенте", МетаданныеДокумента) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДеятельностьНаПатенте", МетаданныеДокументаОснования) Тогда
			ДокументОбъект.ДеятельностьНаПатенте = ДокументОснование.ДеятельностьНаПатенте;
		КонецЕсли;
	КонецЕсли;
	
	// Патент
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Патент", МетаданныеДокумента) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Патент", МетаданныеДокументаОснования) Тогда
			ДокументОбъект.Патент = ДокументОснование.Патент;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет реквизиты объекта значениями, полученными в структуре ДанныхЗаполнения.
//	Заполнение возможно только в случае, когда в качестве ДанныхЗаполнения получена структура.
//	Заполнены будут только те реквизиты, для которых в метаданных установлен флаг "ЗаполнятьИзДанныхЗаполнения"
//
//
// Параметры
//  <Объект>  - <СправочникОбъект>, <ДокументОбъект> и т.д. - Заполняемый объект
//  <ДанныеЗаполнения>  - <произвольный тип> - параметр, полученный в ОбработкеЗаполнения объекта
//  <МетаданныеОбъекта>  - <Метаданные> -
//
//
Процедура ЗаполнитьПоСтруктуре(Объект, ДанныеЗаполнения, МетаданныеОбъекта = Неопределено)	Экспорт

	Если Объект = Неопределено
		ИЛИ ТипЗнч(ДанныеЗаполнения) <> Тип("Структура")
		ИЛИ ДанныеЗаполнения.Количество() = 0 Тогда

		Возврат;

	КонецЕсли;

	Если МетаданныеОбъекта = Неопределено Тогда
		МетаданныеОбъекта = Объект.Метаданные();
	КонецЕсли;
	Если  Метаданные.Справочники.Содержит(МетаданныеОбъекта)
		ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеОбъекта) Тогда
		РазличатьГруппыИЭлементы = МетаданныеОбъекта.Иерархический;
	Иначе
		РазличатьГруппыИЭлементы = Ложь;
	КонецЕсли;

	СтруктураЗаполнения = Новый Структура;
	Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		Если Реквизит.ЗаполнятьИзДанныхЗаполнения
			И ДанныеЗаполнения.Свойство(Реквизит.Имя) Тогда
			СтруктураЗаполнения.Вставить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		Если Реквизит.ЗаполнятьИзДанныхЗаполнения
			И ДанныеЗаполнения.Свойство(Реквизит.Имя) Тогда
			Если РазличатьГруппыИЭлементы Тогда
				Если (Объект.ЭтоГруппа И Реквизит.Использование <> Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента)
					ИЛИ
					(НЕ Объект.ЭтоГруппа И Реквизит.Использование <> Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы)
					Тогда
					СтруктураЗаполнения.Вставить(Реквизит.Имя);
				КонецЕсли;
			Иначе
				СтруктураЗаполнения.Вставить(Реквизит.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ЗаполняемыйЭлемент Из СтруктураЗаполнения Цикл
		ЗначениеЗаполнения = ДанныеЗаполнения[ЗаполняемыйЭлемент.Ключ];
		Если ТипЗнч(ЗначениеЗаполнения) = Тип("Массив")
			ИЛИ ТипЗнч(ЗначениеЗаполнения) = Тип("ФиксированныйМассив") Тогда
			СтруктураЗаполнения[ЗаполняемыйЭлемент.Ключ] = ЗначениеЗаполнения[0];
		Иначе
			СтруктураЗаполнения[ЗаполняемыйЭлемент.Ключ] = ЗначениеЗаполнения;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Объект, СтруктураЗаполнения);

КонецПроцедуры

Процедура ЗаполнитьПодразделениеЗатрат(ПодразделениеЗатрат, Знач Организация) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетЗатратПоПодразделениям") Тогда
		
		Если Не ЗначениеЗаполнено(ПодразделениеЗатрат) Тогда
			ПодразделениеЗатрат = ОбщегоНазначенияБПВызовСервераПовтИсп.ПодразделениеПоУмолчанию(Организация);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
