
&НаКлиенте
Процедура БазаРаспределенияБазаПриИзменении(Элемент)
	
	ПерезаполнитьПроценты();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПроценты()
	
	ИтогБазы = Объект.БазаРаспределения.Итог("База");
	Для Каждого СтрокаТЧ ИЗ Объект.БазаРаспределения Цикл
		СтрокаТЧ.Доля = Окр(СтрокаТЧ.База / ИтогБазы, Объект.Точность);	
	КонецЦикла;
	Объект.БазаРаспределения[0].Доля = Объект.БазаРаспределения[0].Доля + (1 - Объект.БазаРаспределения.Итог("Доля"))	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоAU(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Документ) Тогда
		Сообщить("Выберите документ.");
		Возврат;
	КонецЕсли;	
	ЗаполнитьПоAUнаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоAUнаСервере()
	
	РаспределяемыеЗатраты = Справочники.СпособыРаспределенияРасходов.ПолучитьСуммуРасходовПоAU(Объект);
	
	Объект.РаспределяемыеЗатраты.Загрузить(РаспределяемыеЗатраты);
	
КонецПроцедуры

// { RGS MYurkevich 25.11.2015 11:11:15 - RCA-0000098
&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Документ) Тогда
		Объект.Период = КонецКвартала(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Документ, "Дата"));
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоСегментамНаСервере()
	
	РаспределяемыеЗатраты = Справочники.СпособыРаспределенияРасходов.ПолучитьСуммуРасходовПоСегментам(Объект);
	
	Объект.РаспределяемыеЗатраты.Загрузить(РаспределяемыеЗатраты);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоСегментам(Команда)
	ЗаполнитьПоСегментамНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если Объект.СписокAU.Количество() Тогда
	ПериодПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СправочникКостЦентры.Ссылка КАК AU,
		|	МАКСИМУМ(AUsAndLegalEntities.LegalEntity) КАК PALegalEntity,
		|	МАКСИМУМ(СегментыКостЦентров.Период) КАК Период
		|ИЗ
		|	Справочник.КостЦентры КАК СправочникКостЦентры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AUsAndLegalEntities КАК AUsAndLegalEntities
		|		ПО СправочникКостЦентры.Ссылка = AUsAndLegalEntities.AU
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СегментыКостЦентров КАК СегментыКостЦентров
		|		ПО (СегментыКостЦентров.КостЦентр = СправочникКостЦентры.Ссылка)
		|ГДЕ
		|	СправочникКостЦентры.Код В(&СписокКостЦентров)
		|
		|СГРУППИРОВАТЬ ПО
		|	СправочникКостЦентры.Ссылка";
	СписокКостЦентров = Новый Массив();
	Для Каждого КостЦЕнтр Из Объект.СписокAU Цикл
		СписокКостЦентров.Добавить(КостЦЕнтр.AU.Код);
	КонецЦикла;	
	Запрос.УстановитьПараметр("СписокКостЦентров", СписокКостЦентров);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Свернуть("AU");
	Объект.СписокAU.Очистить();
	Объект.СписокAU.Загрузить(РезультатЗапроса);
КонецПроцедуры
// } RGS MYurkevich 25.11.2015 11:11:15 - RCA-0000098
