
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьДляВыбораИзJob();
		
	Отбор = Параметры.Отбор;
	
	// Если передан фильтр по родителю - сменим режим отображения на список
	Если Отбор.Свойство("Родитель") Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
	Отбор.Вставить("ПометкаУдаления", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзJob()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("RCA", Справочники.GeoMarkets.НайтиПоКоду("RCA"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GeoMarkets.Ссылка
	|ИЗ
	|	Справочник.GeoMarkets КАК GeoMarkets
	|ГДЕ
	|	НЕ GeoMarkets.ПометкаУдаления
	|	И GeoMarkets.Ссылка В ИЕРАРХИИ(&RCA)";
	
	GeoMarketsRCA = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СтруктураОтбора = Параметры.Отбор;
	СтруктураОтбора.Вставить("Ссылка", GeoMarketsRCA);
	
КонецПроцедуры

