
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураНастройки") Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ВыборИзРИЗП" Тогда
			НастроитьДляВыбораИзРИЗП(СтруктураНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Отбор = Параметры.Отбор;
	
	Отбор.Вставить("ПометкаУдаления", Ложь);
	
	Если НЕ Отбор.Свойство("ProcessLevel") Тогда
		
		ProcessLevel = РГСофтСерверПовтИспСеанс.ПолучитьЗначениеРеквизита(ПараметрыСеанса.ТекущийПользователь, "ProcessLevel");
		Если ЗначениеЗаполнено(ProcessLevel) Тогда
			
			МассивProcessLevels = Новый Массив;
			МассивProcessLevels.Добавить(ProcessLevel);
			МассивProcessLevels.Добавить(Справочники.ProcessLevels.ПустаяСсылка());
			Отбор.Вставить("ProcessLevel", ProcessLevel);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзРИЗП(СтруктураНастройки)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("CurrentРИЗП", СтруктураНастройки.CurrentРИЗП);
	Запрос.УстановитьПараметр("НачалоСозданияРИЗПов", Дата(2011,07,01));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	InvoiceLinesMatchingMatching.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗакрытиеПоставки.Сопоставление КАК InvoiceLinesMatchingMatching
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеИмпортаПоЗакрытиюПоставки КАК РаспределениеИмпортаПоЗакрытиюПоставки
		|		ПО InvoiceLinesMatchingMatching.Ссылка = РаспределениеИмпортаПоЗакрытиюПоставки.ShipmentСlosing
		|			И ((НЕ РаспределениеИмпортаПоЗакрытиюПоставки.Ссылка = &CurrentРИЗП))
		|ГДЕ
		|	РаспределениеИмпортаПоЗакрытиюПоставки.Ссылка ЕСТЬ NULL 
		|	И InvoiceLinesMatchingMatching.СтрокаИнвойса.Инвойс.Покупатель.Код = ""SLI RU""
		|	И (НЕ InvoiceLinesMatchingMatching.Ссылка.ПометкаУдаления)
		|	И InvoiceLinesMatchingMatching.Ссылка.Дата >= &НачалоСозданияРИЗПов
		|	И InvoiceLinesMatchingMatching.Ссылка.Поставка.ИмпортЭкспорт = ЗНАЧЕНИЕ(Перечисление.ИмпортЭкспорт.Import)";
	InvoiceLinesMatchings = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	СтруктураОтбора = Параметры.Отбор;
	СтруктураОтбора.Вставить("Ссылка", InvoiceLinesMatchings);
	
КонецПроцедуры
