Процедура ЗаписьОУведомлении() Экспорт
	//Статус = Перечисления.СтатусыЗадачПоКредитНотам.ОтветственныйОсведомлен;
	Выполнена = Истина;
	Записать();
КонецПроцедуры

Процедура ОтменитьКредитНоту() Экспорт
	//Статус = Перечисления.СтатусыЗадачПоКредитНотам.Отклонена;
		
	//Меняем статусы задач на "Отклонена другим пользователем"
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                |	УтверждениеКН.КредитНота,
	                |	УтверждениеКН.Статус,
	                |	УтверждениеКН.Ссылка
	                |ИЗ
	                |	Задача.УтверждениеКН КАК УтверждениеКН
	                |ГДЕ
	                |	УтверждениеКН.КредитНота = &КредитНота
	                |	И УтверждениеКН.Статус = &Статус";
	Запрос.УстановитьПараметр("КредитНота",КредитНота);
	//Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыЗадачПоКредитНотам.НоваяЗадача);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗадачаОбъект.Выполнена = Истина;
		ЗадачаОбъект.Утверждать = Ложь;
		//ЗадачаОбъект.Статус = Перечисления.СтатусыЗадачПоКредитНотам.ОтклоненаДругимПользователем;
		ЗадачаОбъект.Записать();
	КонецЦикла;
	
	ЗаписьОСтатусе = РегистрыСведений.СтатусыУтвержденияКорректировок.СоздатьМенеджерЗаписи();
	ЗаписьОСтатусе.КредитНота = КредитНота;
	ЗаписьОСтатусе.Прочитать();
	//ЗаписьОСтатусе.Статус = Перечисления.СтатусыКредитНот.Отклонена;
	ЗаписьОСтатусе.Записать();	
	
	//ЗаписьИсторииКН = РегистрыСведений.ИсторияУтвержденияКредитНот.СоздатьМенеджерЗаписи();
	//ЗаписьИсторииКН.КредитНота = КредитНота;
	//ЗаписьИсторииКН.Статус = Перечисления.СтатусыКредитНот.Отклонена;
	//ЗаписьИсторииКН.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	//ЗаписьИсторииКН.Период = ТекущаяДата();
	//ЗаписьИсторииКН.Записать();	 
	
КонецПроцедуры

Процедура ПриВыполнении()
	Если Утверждать = Ложь Тогда
		Сообщить ("Нельзя утверждать эту задачу, либо она уже утверждена");
		Возврат;
	КонецЕсли;
	//Утверждаем Кредит-ноту
	//ТекСтатус = Перечисления.СтатусыЗадачПоКредитНотам.Утверждена;	
	ЗаписьОСтатусе = РегистрыСведений.СтатусыУтвержденияКорректировок.СоздатьМенеджерЗаписи();
	ЗаписьОСтатусе.КредитНота = КредитНота;
	ЗаписьОСтатусе.Прочитать();
	//СтатусНач = ЗаписьОСтатусе.Статус;
	КоличествоУтверждающих = ЗаписьОСтатусе.КоличествоУтверждающих;
	ЗаписьОСтатусе.КоличествоУтвердивших = ЗаписьОСтатусе.КоличествоУтвердивших+1;

	
	Если КоличествоУтверждающих = 1 Тогда
		
		//ТекСтатус = Перечисления.СтатусыКредитНот.Утверждена;
		//ЗаписьОСтатусе.Статус = ТекСтатус;		
				
		//Меняем статусы задач на "Утверждена другим пользователем"
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	УтверждениеКН.КредитНота,
		               |	УтверждениеКН.Статус,
		               |	УтверждениеКН.Ссылка
		               |ИЗ
		               |	Задача.УтверждениеКН КАК УтверждениеКН
		               |ГДЕ
		               |	УтверждениеКН.КредитНота = &КредитНота
		               |	И УтверждениеКН.Статус = &Статус";
		Запрос.УстановитьПараметр("КредитНота",КредитНота);
		//Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыЗадачПоКредитНотам.НоваяЗадача);
		ВыборкаПоЗапросу = Запрос.Выполнить().Выбрать();
		Пока ВыборкаПоЗапросу.Следующий() Цикл
			Если Не ВыборкаПоЗапросу.Ссылка=Ссылка Тогда
				ЗадачаОбъект = ВыборкаПоЗапросу.Ссылка.ПолучитьОбъект();
				ЗадачаОбъект.Утверждать = Ложь;
				//ТекСтатус = Перечисления.СтатусыЗадачПоКредитНотам.УтвержденаДругимПользователем;
				//ЗадачаОбъект.Статус = ТекСтатус;
				ЗадачаОбъект.Записать();
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
	
	Иначе
		Если КоличествоУтверждающих = ЗаписьОСтатусе.КоличествоУтвердивших Тогда
			//ТекСтатус = Перечисления.СтатусыКредитНот.Утверждена;
		Иначе       //Иначе - утверждают несколько человек и кредит-нота утверждена еще не всеми
			//ТекСтатус = Перечисления.СтатусыКредитНот.ВПроцессеУтверждения;
		КонецЕсли;
		//ЗаписьОСтатусе.Статус = ТекСтатус;
		
	КонецЕсли;
	
  	ЗаписьОСтатусе.Записать();  // записываем все изменение, произведенные в регистре СтатусИсторияКН
	Утверждать = Ложь;
	
	//ЗаписьИсторииКН = РегистрыСведений.ИсторияУтвержденияКредитНот.СоздатьМенеджерЗаписи();
	//ЗаписьИсторииКН.КредитНота = КредитНота;
	//ЗаписьИсторииКН.Статус = ТекСтатус;
	//ЗаписьИсторииКН.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	//ЗаписьИсторииКН.Период = ТекущаяДата();
	//ЗаписьИсторииКН.Записать();	 

	
	//Если НЕ СтатусНач = ЗаписьОСтатусе.Статус 
	//	И ЗаписьОСтатусе.Статус = Перечисления.СтатусыКредитНот.Утверждена Тогда
	//	Док = КредитНота.ПолучитьОбъект();
	//	Док.УтвержденаКредитНота = Истина;
	//	Док.Утвердил = глТекущийПользователь;
	//	Попытка
	//		Док.Записать();
	//	Исключение
	//	КонецПопытки;
		//Сообщить("Была утверждена кредит-нота: " + Док);
	//КонецЕсли;
КонецПроцедуры