////////////////////////////////////////////////////////////////////////////////
// Проверка одного или нескольких контрагентов при помощи веб-сервиса ФНС
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ОпределитьВидДокумента(Форма,
	
		КонтрагентНаходитсяВШапке = Ложь,
		КонтрагентНаходитсяВТабличнойЧасти = Ложь,
		СчетФактураНаходитсяВПодвале = Ложь,
		ЯвляетсяСчетомФактурой = Ложь) Экспорт
		
	ДокументСсылка = Форма.Объект.Ссылка;
		
	ТипСсылки = ТипЗнч(ДокументСсылка);
	
	Если ТипСсылки = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		 ИЛИ ТипСсылки = Тип("ДокументСсылка.ПередачаОС")
		 ИЛИ ТипСсылки = Тип("ДокументСсылка.СчетКнигиПокупок")
		 Тогда
		
		КонтрагентНаходитсяВШапке			= Истина;
		КонтрагентНаходитсяВТабличнойЧасти 	= Ложь;
		СчетФактураНаходитсяВПодвале		= Истина;
		ЯвляетсяСчетомФактурой				= Ложь;
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		КонтрагентНаходитсяВШапке			= Ложь;
		КонтрагентНаходитсяВТабличнойЧасти 	= Ложь;
		СчетФактураНаходитсяВПодвале		= Ложь;
		ЯвляетсяСчетомФактурой				= Истина;
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ОтчетАгентаПоРасходам") Тогда
		
		КонтрагентНаходитсяВШапке			= Истина;
		КонтрагентНаходитсяВТабличнойЧасти 	= Истина;
		СчетФактураНаходитсяВПодвале		= Истина;
		ЯвляетсяСчетомФактурой				= Ложь;
		
	КонецЕсли;		

	
	//Если 
	//	ТипСсылки = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") И СтрНайти(Форма.ИмяФормы, "ФормаДокументаОбщая") <> 0
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.РеализацияТоваровУслуг") И СтрНайти(Форма.ИмяФормы, "ФормаДокументаОбщая") <> 0
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
	//	
	//	КонтрагентНаходитсяВШапке			= Истина;
	//	КонтрагентНаходитсяВТабличнойЧасти 	= Истина;
	//	СчетФактураНаходитсяВПодвале		= Истина;
	//	ЯвляетсяСчетомФактурой				= Ложь;
	//	
	//ИначеЕсли ТипСсылки = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.ПередачаНМА")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.ПередачаОС")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеДопРасходов")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеИзПереработки")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеНМА")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.РеализацияУслугПоПереработке") 
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") И СтрНайти(Форма.ИмяФормы, "ФормаДокументаОбщая") = 0
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.РеализацияТоваровУслуг") И СтрНайти(Форма.ИмяФормы, "ФормаДокументаОбщая") = 0 Тогда
	//	
	//	КонтрагентНаходитсяВШапке			= Истина;
	//	КонтрагентНаходитсяВТабличнойЧасти 	= Ложь;
	//	СчетФактураНаходитсяВПодвале		= Истина;
	//	ЯвляетсяСчетомФактурой				= Ложь;

	//ИначеЕсли ТипСсылки = Тип("ДокументСсылка.СчетНаОплатуПокупателю")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
	//	
	//	КонтрагентНаходитсяВШапке			= Истина;
	//	КонтрагентНаходитсяВТабличнойЧасти 	= Ложь;
	//	СчетФактураНаходитсяВПодвале		= Ложь;
	//	ЯвляетсяСчетомФактурой				= Ложь;
	//	
	//ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ОказаниеУслуг")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
	//	
	//	КонтрагентНаходитсяВШапке			= Ложь;
	//	КонтрагентНаходитсяВТабличнойЧасти 	= Истина;
	//	СчетФактураНаходитсяВПодвале		= Ложь;
	//	ЯвляетсяСчетомФактурой				= Ложь;
	//	
	//ИначеЕсли ТипСсылки = Тип("ДокументСсылка.КорректировкаПоступления") Тогда

	//	КонтрагентНаходитсяВШапке			= Ложь;
	//	КонтрагентНаходитсяВТабличнойЧасти 	= Истина;
	//	СчетФактураНаходитсяВПодвале		= Истина;
	//	ЯвляетсяСчетомФактурой				= Ложь;
	//	
	//ИначеЕсли ТипСсылки = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
	//	
	//	КонтрагентНаходитсяВШапке			= Ложь;
	//	КонтрагентНаходитсяВТабличнойЧасти 	= Ложь;
	//	СчетФактураНаходитсяВПодвале		= Истина;
	//	ЯвляетсяСчетомФактурой				= Ложь;
	//	
	//ИначеЕсли ТипСсылки = Тип("ДокументСсылка.СчетФактураПолученный")
	//	ИЛИ ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
	//	
	//	КонтрагентНаходитсяВШапке			= Ложь;
	//	КонтрагентНаходитсяВТабличнойЧасти 	= Ложь;
	//	СчетФактураНаходитсяВПодвале		= Ложь;
	//	ЯвляетсяСчетомФактурой				= Истина;
	//	
	//КонецЕсли;
		
	
КонецПроцедуры
	
Процедура ПолучитьСчетФактуру(Форма, СчетФактура) Экспорт
	
	ДокументОбъект = Форма.Объект;
	ДокументСсылка = ДокументОбъект.Ссылка;
	
	//Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
	//	ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")Тогда
	//	СчетФактура = Форма.СчетФактураНаВознаграждение;
	//ИначеЕсли ПроверкаКонтрагентовКлиентСервер.ЭтоДокументСоСчетомФактуройВПодвале(Форма) Тогда
	//	СчетФактура = Форма.СчетФактура;
	//Иначе
	//	СчетФактура = Неопределено;
	//КонецЕсли;
	
	Если ПроверкаКонтрагентовКлиентСервер.ЭтоДокументСоСчетомФактуройВПодвале(Форма) Тогда
		СчетФактура = Форма.СчетФактура;
	Иначе
		СчетФактура = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции


#КонецОбласти