
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Recipients", 	Recipients);
	Параметры.Свойство("ReplyTo", 		ReplyTo);
	Параметры.Свойство("Subject", 		Subject);
	Параметры.Свойство("Copy", 			Copy);
	Параметры.Свойство("PartNo", 		PartNo);
	
	// ++ RG-Soft КДС 24.11.2016
	Параметры.Свойство("TechDOC", TechDOC);
	
	Body = "<html>
			|<head><title>Анкета</title></head>
			|<body>" + Параметры.Body + "
			|</body>
			|</html>";
	
	// -- RG-Soft КДС 24.11.2016
	
КонецПроцедуры

&НаКлиенте
Процедура Send(Команда)
	
	Индекс = 0;
	Пока Индекс < Recipients.Количество() Цикл
		
		Recipient = Recipients[Индекс];
		Recipient.Значение = СокрЛП(Recipient.Значение);
		Если ЗначениеЗаполнено(Recipient.Значение) Тогда
			Индекс = Индекс + 1;
		Иначе
			Recipients.Удалить(Индекс);
		КонецЕсли; 
		
	КонецЦикла; 
	
	ReplyTo = СокрЛП(ReplyTo);
	Subject = СокрЛП(Subject);
	Body = СокрЛП(Body);
	Copy = СокрЛП(Copy);
	
	Отказ = Ложь;
	Если Recipients.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Recipients"" не заполнено",
			, "Recipients", , Отказ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ReplyTo) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Reply to"" не заполнено",
			, "ReplyTo", , Отказ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Subject) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Subject"" не заполнено",
			, "Subject", , Отказ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Body) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Body"" не заполнено",
			, "Body", , Отказ);
	КонецЕсли; 

		// { RGS ASeryakov, 23.08.2018 19:32:03 S-I-0005867
	Если ЗначениеЗаполнено(Copy) Тогда
		
		Если НЕ РГСофт.СоответствуетМаскеRegExp(СокрЛП(Copy),"\w[.\w]*\@\w[.\w]*(\.\w[.\w]*)+") Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Copy"" не соответствует формату электронной почты",
			, "Copy", , Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	// } RGS ASeryakov 23.08.2018 19:32:05 S-I-0005867

	
	Если Отказ Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Please send request via RIET-support!",
			, "ОбщаяКомандаrgsМониторСопровождения", , Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Recipients", 	Recipients.ВыгрузитьЗначения());
		СтруктураВозврата.Вставить("ReplyTo", 		ReplyTo);
		СтруктураВозврата.Вставить("Subject", 		Subject);
		СтруктураВозврата.Вставить("Body", 			Body);
		СтруктураВозврата.Вставить("Copy", 			Copy);
				
		// ++ RG-Soft КДС 24.11.2016
		СтруктураВозврата.Вставить("TechDOC", 		TechDOC);
		СтруктураВозврата.Вставить("ТипТекста", 	ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.HTML"));
		
		Успех = Истина;
		// -- RG-Soft КДС 24.11.2016
		
		// { RGS AArsentev 17.05.2018
		СтруктураВозврата.Вставить("PartNo", 		PartNo);
		// } RGS AArsentev 17.05.2018
		
		ОповеститьОВыборе(СтруктураВозврата);

	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если TechDOC И НЕ Успех Тогда
		Оповестить("ОтказОтправкиЗапросаTechDOC", ЭтаФорма.ВладелецФормы);
	КонецЕсли;
	
	ОповеститьОбИзменении(PartNo);

КонецПроцедуры
