
Процедура ПриЗаписи(Отказ, Замещение)
	// Нужно отследить случаи перезаписи при пересчете разниц.
	// Или не нужно) Пересчитали разницы - повторно зарегили и сразу удаили.
	
	// Если регистратор - документ нужного типа, то отмечаем в регистре, что нужен пересчет разниц по данному документу.
	Если ТипЗнч(Отбор.Регистратор.Значение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Отбор.Регистратор.Значение) = Тип("ДокументСсылка.ПередачаОС") ИЛИ ТипЗнч(Отбор.Регистратор.Значение) = Тип("ДокументСсылка.СчетКнигиПокупок") Тогда
		ОбщегоНазначения.ЗарегистрироватьДокументДляПересчетаРазниц(Отбор.Регистратор.Значение);
	КонецЕсли; 
КонецПроцедуры
