#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		Если ЗначениеЗаполнено(Параметры.Отбор.Организация) Тогда
			Параметры.Отбор.Организация = РегламентированнаяОтчетность.ГоловнаяОрганизация(Параметры.Отбор.Организация);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКоличествоПодчиненныхЭлементовПоВладельцу(Владелец) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацииВНалоговомОргане.Ссылка
	|ИЗ
	|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|ГДЕ
	|	РегистрацииВНалоговомОргане.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Владелец);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество();

КонецФункции

Функция КодТерритории(РегистрацияВНалоговомОргане, Период) Экспорт
	
	Если Не ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
		
		Возврат "";
		
	КонецЕсли;
		
	Если Год(Период) < 2014 Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистрацияВНалоговомОргане, "КодПоОКАТО");
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистрацияВНалоговомОргане, "КодПоОКТМО");
	КонецЕсли;
	
КонецФункции

Функция НайтиПоКодуТерритории(Организация, КодТерритории) Экспорт
	
//Обновление рег. Отчетности на бух. Корп 3.0.36.18
	
	//// Ищем по ОКАТО или ОКТМО - по чему найдем.
	//
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация));
	//Запрос.УстановитьПараметр("КодТерритории",       КодТерритории);
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	РегистрацииВНалоговомОргане.Ссылка КАК Ссылка,
	//|	ИСТИНА КАК НайденПоОКТМО,
	//|	ЛОЖЬ КАК НайденПоОКАТО
	//|ИЗ
	//|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	//|ГДЕ
	//|	РегистрацииВНалоговомОргане.Владелец = &ГоловнаяОрганизация
	//|	И РегистрацииВНалоговомОргане.КодПоОКТМО = &КодТерритории
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РегистрацииВНалоговомОргане.Ссылка,
	//|	ЛОЖЬ,
	//|	ИСТИНА
	//|ИЗ
	//|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	//|ГДЕ
	//|	РегистрацииВНалоговомОргане.Владелец = &ГоловнаяОрганизация
	//|	И РегистрацииВНалоговомОргане.КодПоОКАТО = &КодТерритории
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Ссылка";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Количество() = 1 Тогда
	//	ОбластьПоиска = Неопределено;
	//Иначе
	//	
	//	// Выберем более адекватный
	//	
	//	ИскатьПоОКТМО = ПлатежиВБюджетКлиентСервер.ЭтоКодОКТМО(КодТерритории);
	//	ИскатьПоОКАТО = ПлатежиВБюджетКлиентСервер.ЭтоКодОКАТО(КодТерритории);
	//	Если ИскатьПоОКТМО = ИскатьПоОКАТО Тогда
	//		ОбластьПоиска = Неопределено;
	//	ИначеЕсли ИскатьПоОКТМО Тогда
	//		ОбластьПоиска = "ОКТМО";
	//	Иначе
	//		ОбластьПоиска = "ОКАТО";
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Результат = Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка();
	//Пока Выборка.Следующий() Цикл
	//	
	//	Результат = Выборка.Ссылка;
	//	
	//	Если (ОбластьПоиска = Неопределено)
	//		Или (ОбластьПоиска = "ОКТМО" И Выборка.НайденПоОКТМО)
	//		Или (ОбластьПоиска = "ОКАТО" И Выборка.НайденПоОКАТО) Тогда
	//		Прервать;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Возврат Результат;
	
	Возврат Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка();
							  
	//<=   
	
КонецФункции

Функция НайтиПоКПП(Организация, КПП) Экспорт
	
	//Обновление рег. Отчетности на бух. Корп 3.0.36.18  							  
							  
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация));
	//Запрос.УстановитьПараметр("КПП",                 КПП);
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 2
	//|	РегистрацииВНалоговомОргане.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	//|ГДЕ
	//|	РегистрацииВНалоговомОргане.Владелец = &ГоловнаяОрганизация
	//|	И РегистрацииВНалоговомОргане.КПП = &КПП";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Количество() <> 1 Тогда
	//	Возврат Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка();
	//Иначе
	//	Выборка.Следующий();
	//	Возврат Выборка.Ссылка;
	//КонецЕсли;
	
	Возврат Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка();
	//<=     
	
КонецФункции

#КонецЕсли