
&НаКлиенте
Процедура ReturnToRequestor(Команда)
	
	ДанныеВведеныПолностью = Истина;
	ДанныеДляЗаполнения = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(ReasonForReturn) Тогда
		ДанныеВведеныПолностью = Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'При возврате заявки необходимо указать причину!';en = 'When returning request, you must specify the reason!'");
		Сообщение.Сообщить();
	Иначе
		ДанныеДляЗаполнения.Вставить("ПричинаВозврата", ReasonForReturn);
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Comments) Тогда
		ДанныеВведеныПолностью = Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'При возврате заявки необходимо оставить комментарий!';en = 'When returning request, you must leave a comment!'");
		Сообщение.Сообщить();
	Иначе
		ДанныеДляЗаполнения.Вставить("Комментарий", Comments);
	КонецЕсли;		
	
	Если ДанныеВведеныПолностью Тогда
		Закрыть(ДанныеДляЗаполнения);
	КонецЕсли;		
	
КонецПроцедуры
