
&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	ЗначениеОтбора = ?(ТипЗнч(Элементы.Дерево.ТекущаяСтрока) = Тип("СправочникСсылка.LegalEntities"), 
		Элементы.Дерево.ТекущаяСтрока, Неопределено);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
															"Владелец",
															ЗначениеОтбора,
															ВидСравненияКомпоновкиДанных.Равно,
															, 
															Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененSegment" Тогда
		Элементы.Дерево.Обновить();
	КонецЕсли;
	
КонецПроцедуры
