////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ СВЯЗАННЫХ С ТАБЛИЦЕЙ КОНТАКТНОЙ ИНФОРМАЦИИ НА ФОРМАХ

Процедура ГиперссылкаНажатие(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
	
	ДанныеСтроки = ПолучитьСтрокуДополнительныхЗначений(Форма, Элемент);
	Если (ДанныеСтроки = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	Представление = Форма[ДанныеСтроки.ИмяРеквизита];
	Если Представление = УправлениеКонтактнойИнформациейКлиентСерверБП.ПредставлениеПустойГиперссылки() Тогда
		Представление = "";
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ДанныеСтроки.Вид);
	ПараметрыОткрытия.Вставить("ЗначенияПолей", ДанныеСтроки.ЗначенияПолей);
	ПараметрыОткрытия.Вставить("Представление", ДанныеСтроки.Представление);
	ПараметрыОткрытия.Вставить("Комментарий", ДанныеСтроки.Комментарий);
	ПараметрыОткрытия.Вставить("РедактированиеТолькоВДиалоге", Истина);
	ПараметрыОткрытия.Вставить("АдресТолькоРоссийский", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ГиперссылкаНажатиеЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             Форма);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия, Форма, Оповещение);
	
КонецПроцедуры

// Завершение немодальных диалогов
Процедура ГиперссылкаНажатиеЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Результат        = ДополнительныеПараметры.Результат;
	ДанныеСтроки     = ДополнительныеПараметры.ДанныеСтроки;
	Элемент          = ДополнительныеПараметры.Элемент;
	Форма            = ДополнительныеПараметры.Форма;
	
	Результат.Вставить("ЗначенияПолейДоИзменения", ДанныеСтроки.ЗначенияПолей);
	Результат.Вставить("ПредставлениеДоИзменения", ДанныеСтроки.Представление);
	Результат.Вставить("ЗначениеПоляДоИзменения", Форма[ДанныеСтроки.ИмяРеквизита]);
	
	Форма[ДанныеСтроки.ИмяРеквизита]	= ?(ПустаяСтрока(РезультатЗакрытия.Представление), УправлениеКонтактнойИнформациейКлиентСерверБП.ПредставлениеПустойГиперссылки(), РезультатЗакрытия.Представление);
	ДанныеСтроки.ЗначенияПолей			= РезультатЗакрытия.КонтактнаяИнформация;
	ДанныеСтроки.Представление			= РезультатЗакрытия.Представление;
	ДанныеСтроки.Комментарий			= РезультатЗакрытия.Комментарий;
	Форма.Модифицированность = Истина;
	
	Форма.ПослеИзмененияКонтактнойИнформации(Результат);
	Форма.ОбновитьКонтактнуюИнформацию(Результат);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ

Функция ПолучитьСтрокуДополнительныхЗначений(Форма, Элемент)
	
	Отбор = Новый Структура("ИмяРеквизита", Элемент.Имя);
	Строки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	
	Возврат ?(Строки.Количество() = 0, Неопределено, Строки[0]);
	
КонецФункции
