
&НаКлиенте
Процедура ЗакончитьРедактирование(Команда)
	СписокОтобранныхСчетов = ЗаполнитьСписокИзТаблицы();
	ЭтаФорма.Закрыть(СписокОтобранныхСчетов);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Параметры.Контрагент;
	Для каждого Элемент Из Параметры.СписокСчетов Цикл
		НоваяЗапись = СписокВыбораСчетов.Добавить();
		НоваяЗапись.СчетПокупателя = Элемент.Значение;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокИзТаблицы()
	СписокОтобранныхСчетов = Новый СписокЗначений;
	Для каждого СтрокаТаблицы Из СписокВыбораСчетов Цикл
		СписокОтобранныхСчетов.Добавить(СтрокаТаблицы.СчетПокупателя, Строка(СтрокаТаблицы.СчетПокупателя));
	КонецЦикла; 
	Возврат СписокОтобранныхСчетов;
КонецФункции