#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ОбъектСозданВТекущемУзле(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыИнформационныхБаз.УзелОбмена
		|ИЗ
		|	РегистрСведений.ОбъектыИнформационныхБаз КАК ОбъектыИнформационныхБаз
		|ГДЕ
		|	ОбъектыИнформационныхБаз.Объект = &Объект";

	Запрос.УстановитьПараметр("Объект", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();
	Возврат Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УзелОбмена);
	
КонецФункции
#КонецЕсли