
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.
	Для Каждого ТекСтрокаДекларации Из Декларации Цикл
		// register Оборудование Приход
		Движение = Движения.Оборудование.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.НалоговыйПериод = Дата;
		Движение.Декларация = ТекСтрокаДекларации.Декларация;
		Движение.Номенклатура = ТекСтрокаДекларации.Номенклатура;
		Движение.AU = ТекСтрокаДекларации.AccountingUnit;
		Движение.НомерСтрокиГТД = ТекСтрокаДекларации.НомерСтрокиГТД;
		Движение.Сумма = ТекСтрокаДекларации.Сумма;
		Движение.Количество = ТекСтрокаДекларации.Количество;
	КонецЦикла;
	// writing register movements
	Движения.Оборудование.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
