
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() И НЕ ПараметрыСеанса.ИспользованиеРИБ Тогда
		МассивСоединений = ПолучитьСоединенияИнформационнойБазы();
		НомерТекущегоСоединения = НомерСоединенияИнформационнойБазы();
		Для каждого Соединение ИЗ МассивСоединений Цикл
			Если Соединение.ИмяПриложения <> "Config" 
				И Соединение.НомерСоединения <> НомерТекущегоСоединения Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Первоначальное создание узла плана обмена должно выполняться в монопольном режиме!");
				Отказ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не ПараметрыСеанса.ИспользованиеРИБ И Ссылка <> ПланыОбмена.Полный.ЭтотУзел() Тогда
		Сообщить("Для задействования механизма установки префиксов объектов необходимо перезапустить текущий сеанс работы 1С:Предприятия.");
	КонецЕсли;
	
КонецПроцедуры

