
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Лев(СокрЛП(СтандартныеПодсистемыСервер.ВерсияБиблиотеки()) + ".", 4) = "2.1." Тогда
		ПутьМодуляКриптографии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ЭЦП", "ПутьМодуляКриптографии");
	Иначе
		ПутьМодуляКриптографии = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ЭлектроннаяПодписьКлиентСервер").ПерсональныеНастройки().ПутьМодуляКриптографии;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПутьМодуляКриптографии(ПутьМодуляКриптографии)
	
	ПерсональныеНастройки = Новый Структура;
	ПерсональныеНастройки.Вставить("ПутьМодуляКриптографии", ПутьМодуляКриптографии);
	ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ЭлектроннаяПодпись").СохранитьПерсональныеНастройки(ПерсональныеНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Лев(СокрЛП(ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПовтИсп.ВерсияБСП()) + ".", 4) = "2.1." Тогда
		МассивСтруктур = Новый Массив;
		
		Элемент = Новый Структура;
		Элемент.Вставить("Объект", "ЭЦП");
		Элемент.Вставить("Настройка", "ПутьМодуляКриптографии");
		Элемент.Вставить("Значение", ПутьМодуляКриптографии);
		МассивСтруктур.Добавить(Элемент);
		
		ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбщегоНазначенияВызовСервера").ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур);
		
	Иначе
		СохранитьПутьМодуляКриптографии(ПутьМодуляКриптографии);
	КонецЕсли;
	
	Закрыть(ПутьМодуляКриптографии);
	
КонецПроцедуры
