
Процедура ДобавитьЗапись(Период, DocumentBase, ЭлементФормированияСтоимости, AU, Activity=Неопределено, FiscalSum) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		ВызватьИсключение "Период is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(DocumentBase) Тогда
		ВызватьИсключение "Document base is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭлементФормированияСтоимости) Тогда
		ВызватьИсключение "Элемент формирования стоимости is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(AU) Тогда
		ВызватьИсключение "AU is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(FiscalSum) Тогда
		ВызватьИсключение "Fiscal sum is empty!";
	КонецЕсли;	
		
	Движение = Добавить();
	Движение.Период = Период;
	Движение.DocumentBase = DocumentBase;
	Движение.ЭлементФормированияСтоимости = ЭлементФормированияСтоимости;
	Движение.AU = AU;
	Движение.Activity = Activity;
	Движение.FiscalSum = FiscalSum;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	ЭлементыФормированияСтоимости = Справочники.ЭлементыФормированияСтоимости;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
							
		КлючЗаписи = Неопределено;
				
		Если Запись.ЭлементФормированияСтоимости = ЭлементыФормированияСтоимости.ТаможняНДС Тогда
			Запись.Activity = Неопределено;
		Иначе
			Запись.Activity = СокрЛП(Запись.Activity);
		КонецЕсли;
		
		//Запись.Account = СокрЛП(Запись.Account);

		Если НЕ ЗначениеЗаполнено(Запись.FiscalSum) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"В регистре ""Стоимость товаров по ТПО"" поле ""Fiscal sum"" не заполнены!",
				ПолучитьКлючЗаписи(Запись, КлючЗаписи), "Запись", Отказ);				
		КонецЕсли;
					
	КонецЦикла;
			
КонецПроцедуры

Функция ПолучитьКлючЗаписи(Запись, КлючЗаписи=Неопределено)
	
	Если КлючЗаписи = Неопределено Тогда
		СтруктураЗаписи = Новый Структура("НомерСтроки, Регистратор");
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
		КлючЗаписи = РегистрыНакопления.СтоимостьТоваровПоТПО.СоздатьКлючЗаписи(СтруктураЗаписи);
	КонецЕсли; 
		
	Возврат КлючЗаписи;
	
КонецФункции