Функция ПолучитьСуммуРасходовПоAU(Объект) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СпособыРаспределенияРасходовСписокAU.AU
	                      |ПОМЕСТИТЬ Список
	                      |ИЗ
	                      |	Справочник.СпособыРаспределенияРасходов.СписокAU КАК СпособыРаспределенияРасходовСписокAU
	                      |ГДЕ
	                      |	СпособыРаспределенияРасходовСписокAU.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЗагрузкаРасходовПоЗарплатеЗагрузка.ФактическоеПодразделение,
	                      |	ЗагрузкаРасходовПоЗарплатеЗагрузка.AU,
	                      |	ЗагрузкаРасходовПоЗарплатеЗагрузка.AccountLawson,
	                      |	"""" КАК ВидРасходов,
	                      |	СУММА(ЗагрузкаРасходовПоЗарплатеЗагрузка.Расходы) КАК Расходы,
	                      |	СУММА(ЗагрузкаРасходовПоЗарплатеЗагрузка.ПрочиеРасходы) КАК ПрочиеРасходы,
	                      |	СУММА(ЗагрузкаРасходовПоЗарплатеЗагрузка.СтраховыеВзносы) КАК СтраховыеВзносы,
	                      |	СУММА(ЗагрузкаРасходовПоЗарплатеЗагрузка.ВзносыФСС) КАК ВзносыФСС,
	                      |	NULL КАК Сегмент
	                      |ИЗ
	                      |	Документ.ЗагрузкаРасходовПоЗарплате.Загрузка КАК ЗагрузкаРасходовПоЗарплатеЗагрузка
	                      |ГДЕ
	                      |	ЗагрузкаРасходовПоЗарплатеЗагрузка.Ссылка = &Документ
	                      |	И ЗагрузкаРасходовПоЗарплатеЗагрузка.AU В
	                      |			(ВЫБРАТЬ
	                      |				список.AU
	                      |			ИЗ
	                      |				список)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗагрузкаРасходовПоЗарплатеЗагрузка.ФактическоеПодразделение,
	                      |	ЗагрузкаРасходовПоЗарплатеЗагрузка.AU,
	                      |	ЗагрузкаРасходовПоЗарплатеЗагрузка.AccountLawson
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.ФактическоеПодразделение,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AU,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AccountLawson,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.ВидРасходов,
	                      |	СУММА(ЗагрузкаИРаспределениеРасходовЗагрузка.Расходы),
	                      |	СУММА(ЗагрузкаИРаспределениеРасходовЗагрузка.ПрочиеРасходы),
	                      |	СУММА(0),
	                      |	СУММА(0),
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.Сегмент
	                      |ИЗ
	                      |	Документ.ЗагрузкаИРаспределениеРасходов.Загрузка КАК ЗагрузкаИРаспределениеРасходовЗагрузка
	                      |ГДЕ
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.Ссылка = &Документ
	                      |	И ВЫБОР
	                      |			КОГДА &РучноеОпределениеСуммы
	                      |				ТОГДА НЕ ЗагрузкаИРаспределениеРасходовЗагрузка.ВидРасходов ПОДОБНО ""M&S%""
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |	И ЗагрузкаИРаспределениеРасходовЗагрузка.AU В
	                      |			(ВЫБРАТЬ
	                      |				список.AU
	                      |			ИЗ
	                      |				список)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.ФактическоеПодразделение,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AU,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AccountLawson,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.Сегмент,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.ВидРасходов
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.ФактическоеПодразделение,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AU,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AccountLawson,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.СтрокаТВ.Код,
	                      |	СУММА(ЗагрузкаИРаспределениеРасходовЗагрузка.Расходы),
	                      |	СУММА(0),
	                      |	СУММА(0),
	                      |	СУММА(0),
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.Сегмент
	                      |ИЗ
	                      |	Документ.ЗагрузкаИРаспределениеРасходов.ДанныеСтрокТВ КАК ЗагрузкаИРаспределениеРасходовЗагрузка
	                      |ГДЕ
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.Ссылка = &Документ
	                      |	И НЕ &РучноеОпределениеСуммы
	                      |	И ЗагрузкаИРаспределениеРасходовЗагрузка.AU В
	                      |			(ВЫБРАТЬ
	                      |				список.AU
	                      |			ИЗ
	                      |				список)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.ФактическоеПодразделение,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AU,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AccountLawson,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.Сегмент,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.СтрокаТВ.Код
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.ФактическоеПодразделение,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AU,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AccountLawson,
	                      |	ВЫБОР
	                      |		КОГДА ЗагрузкаИРаспределениеРасходовЗагрузка.ВидРасходов = """"
	                      |			ТОГДА ЗагрузкаИРаспределениеРасходовЗагрузка.СтрокаТВ.Код
	                      |		ИНАЧЕ ЗагрузкаИРаспределениеРасходовЗагрузка.ВидРасходов
	                      |	КОНЕЦ,
	                      |	СУММА(ЗагрузкаИРаспределениеРасходовЗагрузка.Расходы),
	                      |	СУММА(0),
	                      |	СУММА(0),
	                      |	СУММА(0),
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.Сегмент
	                      |ИЗ
	                      |	Документ.ЗагрузкаИРаспределениеРасходов.РаспределениеРучное КАК ЗагрузкаИРаспределениеРасходовЗагрузка
	                      |ГДЕ
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.Ссылка = &Документ
	                      |	И ЗагрузкаИРаспределениеРасходовЗагрузка.Способ = &Способ
	                      |	И ЗагрузкаИРаспределениеРасходовЗагрузка.Распределять
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.ФактическоеПодразделение,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AU,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.AccountLawson,
	                      |	ЗагрузкаИРаспределениеРасходовЗагрузка.Сегмент,
	                      |	ВЫБОР
	                      |		КОГДА ЗагрузкаИРаспределениеРасходовЗагрузка.ВидРасходов = """"
	                      |			ТОГДА ЗагрузкаИРаспределениеРасходовЗагрузка.СтрокаТВ.Код
	                      |		ИНАЧЕ ЗагрузкаИРаспределениеРасходовЗагрузка.ВидРасходов
	                      |	КОНЕЦ");
	
	// } RGS MYurkevich 25.11.2015 10:56:00 - RCA-0000098 
	Запрос.УстановитьПараметр("дата", 					Объект.Период);
	Запрос.УстановитьПараметр("ссылка", 				Объект.Ссылка);
	Запрос.УстановитьПараметр("Документ", 				Объект.Документ);
	Запрос.УстановитьПараметр("Способ", 				Объект.Ссылка);
	Запрос.УстановитьПараметр("РучноеОпределениеСуммы", Объект.РучноеОпределениеСуммы);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ВыбратьДанныеПоАУ(Способ, ТаблицаИсходныхДанных) Экспорт
	
	таблицаРезультат = ТаблицаИсходныхДанных.СкопироватьКолонки();
	
	массивАУ = Способ.СписокAU.Выгрузить().ВыгрузитьКолонку("AU");
	
	Для каждого текСтр из ТаблицаИсходныхДанных Цикл
		
		Если НЕ массивАУ.Найти(текСтр.AU) = Неопределено Тогда
			стрНов = таблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(стрНов, текСтр);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат таблицаРезультат;
	
КонецФункции

Функция ПолучитьСуммуРасходовПоСегментам(Объект) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СпособыРаспределенияРасходовСписокСегментов.Сегмент
	|ПОМЕСТИТЬ Список
	|ИЗ
	|	Справочник.СпособыРаспределенияРасходов.СписокСегментов КАК СпособыРаспределенияРасходовСписокСегментов
	|ГДЕ
	|	СпособыРаспределенияРасходовСписокСегментов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗагрузкаИРаспределениеРасходовЗагрузка.ФактическоеПодразделение,
	|	ЗагрузкаИРаспределениеРасходовЗагрузка.AU,
	|	ЗагрузкаИРаспределениеРасходовЗагрузка.AccountLawson,
	|	СУММА(ЗагрузкаИРаспределениеРасходовЗагрузка.Расходы) КАК Расходы,
	|	СУММА(ЗагрузкаИРаспределениеРасходовЗагрузка.ПрочиеРасходы) КАК ПрочиеРасходы,
	|	СУММА(0) КАК СтраховыеВзносы,
	|	СУММА(0) КАК ВзносыФСС,
	|	ЗагрузкаИРаспределениеРасходовЗагрузка.Сегмент КАК Сегмент
	|ИЗ
	|	Документ.ЗагрузкаИРаспределениеРасходов.Загрузка КАК ЗагрузкаИРаспределениеРасходовЗагрузка
	|ГДЕ
	|	ЗагрузкаИРаспределениеРасходовЗагрузка.Ссылка = &Документ
	|	И ЗагрузкаИРаспределениеРасходовЗагрузка.Сегмент В
	|			(ВЫБРАТЬ
	|				список.Сегмент
	|			ИЗ
	|				список)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗагрузкаИРаспределениеРасходовЗагрузка.ФактическоеПодразделение,
	|	ЗагрузкаИРаспределениеРасходовЗагрузка.AU,
	|	ЗагрузкаИРаспределениеРасходовЗагрузка.AccountLawson,
	|	ЗагрузкаИРаспределениеРасходовЗагрузка.Сегмент");
	Запрос.УстановитьПараметр("ссылка", 	Объект.Ссылка);
	Запрос.УстановитьПараметр("Документ", 	Объект.Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьРаспределяемыеРасходыПоAU(Ссылка) Экспорт
	
	Объект = Ссылка.ПолучитьОбъект();
	РаспределяемыеЗатраты = ПолучитьСуммуРасходовПоAU(Объект);
	
	Объект.РаспределяемыеЗатраты.Загрузить(РаспределяемыеЗатраты);
	
	Объект.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьРаспределяемыеРасходыПоСегменту(Ссылка) Экспорт
	
	Объект = Ссылка.ПолучитьОбъект();
	РаспределяемыеЗатраты = ПолучитьСуммуРасходовПоСегментам(Объект);
	
	Объект.РаспределяемыеЗатраты.Загрузить(РаспределяемыеЗатраты);
	
	Объект.Записать();	
	
КонецПроцедуры