
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	FinalTrips = Истина;
	
	Для Каждого Док Из ПараметрКоманды Цикл 
		       				
		Если Не ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "Final")) Тогда
			
			FinalTrips = Ложь;

			Сообщить("'"+ СокрЛП(Док) +"' is not final.  
				|Non-PO can be printed only for final trips!");
						   		
		КонецЕсли;
	
	КонецЦикла;
	
	Если FinalTrips Тогда 
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
				"Документ.Trip", 
				"NonPO", 
				ПараметрКоманды,
				ПараметрыВыполненияКоманды);
				
	КонецЕсли;		

КонецПроцедуры

