Перем мУдалятьДвижения;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	КонецЕсли;
	
	Если СокрЛП(MovementType) = "DISPOSAL" ИЛИ СокрЛП(MovementType) = "TRANSFER OSS" Тогда
		СостояниеОСLawson = Перечисления.СостояниеОСLawson.Disposed;
	Иначе	
		СостояниеОСLawson = Перечисления.СостояниеОСLawson.Active;
	КонецЕсли; 
	
	//Проверим состояние на дату документа, и записи в регистр 
	//будем вносить только, если состояние изменилось
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОперацияОСLawsonОС.Asset
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ОперацияОСLawson.ОС КАК ОперацияОСLawsonОС
	|ГДЕ
	|	ОперацияОСLawsonОС.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.Asset
	|ПОМЕСТИТЬ Assets
	|ИЗ
	|	ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Assets.Asset,
	|	СостоянияОСLawsonСрезПоследних.Состояние
	|ИЗ
	|	Assets КАК Assets
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСLawson.СрезПоследних(
	|				&Дата,
	|				ОСLawson В
	|					(ВЫБРАТЬ
	|						ВТ.Asset
	|					ИЗ
	|						ВТ КАК ВТ)) КАК СостоянияОСLawsonСрезПоследних
	|		ПО Assets.Asset = СостоянияОСLawsonСрезПоследних.ОСLawson
	|ГДЕ
	|	(СостоянияОСLawsonСрезПоследних.Состояние ЕСТЬ NULL 
	|			ИЛИ (НЕ СостоянияОСLawsonСрезПоследних.Состояние = &Состояние))";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 Запрос.УстановитьПараметр("Состояние", СостояниеОСLawson);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.СостоянияОСLawson.Добавить();
		Движение.Период = Дата;
		Движение.ОСLawson = ВыборкаДетальныеЗаписи.Asset;
		Движение.Состояние = СостояниеОСLawson;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если MovementType = "ADDITION" ИЛИ  MovementType = "TRANSFER OSS" Тогда
		Для Каждого СтрокаТЧ Из ОС Цикл
			Если СтрокаТЧ.Asset.Deferred <> СтрокаТЧ.Deferred Тогда
				Эл = СтрокаТЧ.Asset.ПолучитьОбъект();
				Эл.Deferred = СтрокаТЧ.Deferred;
				Эл.Записать();
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
