
Процедура СоздатьВерсию(DOC, MOT, CCA, Requested, Знач POA = Неопределено, ИзменилсяСостав = Ложь) Экспорт
	
	НаборЗаписей = РегистрыСведений.DOCVersions.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	НаборЗаписей.Отбор.DOC.Установить(DOC);
	НаборЗаписей.Прочитать();
	Запись = НаборЗаписей.Добавить();
	Запись.Период 			= ТекущаяДата();
	Запись.Version 			= Документы.КонсолидированныйПакетЗаявокНаПеревозку.rgsПолучитьМаксимальнуюВерсию(DOC) + 1;
	Запись.DOC 				= DOC;
	Запись.Регистратор 		= DOC;
	Запись.CCA 				= CCA;
	Запись.MOT 				= MOT;
	Запись.Received 		= Дата("01.01.0001 00:00:00");
	Запись.Accepted 		= Дата("01.01.0001 00:00:00");
	Запись.ИзменилсяСостав 	= ИзменилсяСостав;
	Запись.Requested 		= Requested;
	Запись.POA				= POA;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьВерсию(НомерВерсии, DOC, MOT, CCA, Requested, POA, Received, Accepted, ИзменилсяСостав = Ложь) Экспорт
	
	НаборЗаписей = РегистрыСведений.DOCVersions.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	НаборЗаписей.Отбор.DOC.Установить(DOC);
	НаборЗаписей.Прочитать();
	Запись = НаборЗаписей.Добавить();
	Запись.Период 			= ТекущаяДата();
	Запись.Version 			= НомерВерсии;//Документы.КонсолидированныйПакетЗаявокНаПеревозку.rgsПолучитьКоличествоВерсий(DOC) + 1;
	Запись.DOC 				= DOC;
	Запись.Регистратор 		= DOC;
	Запись.CCA 				= CCA;
	Запись.MOT 				= MOT;
	Запись.Received 		= Received;
	Запись.Accepted 		= Accepted;
	Запись.ИзменилсяСостав 	= ИзменилсяСостав;
	Запись.Requested 		= Requested;
	Запись.POA				= POA;
	НаборЗаписей.Записать();
	
КонецПроцедуры