
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Approval = ПолучитьСсылкуНаApproval(ПараметрКоманды);
	
	Если Approval = Неопределено Тогда 
		СтруктураПараметров = Новый Структура("Основание", ПараметрКоманды);
	иначе
		СтруктураПараметров = Новый Структура("Ключ", Approval);
	КонецЕсли;
	
	ОткрытьФорму("Задача.RentalCostsApproval.ФормаОбъекта", СтруктураПараметров,
	ПараметрыВыполненияКоманды.Источник,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаApproval(RentalCost)
	
	Возврат Задачи.RentalCostsApproval.ПолучитьСсылкуНаApproval(RentalCost);
	
КонецФункции
