
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	
	//добавила два "если" Федотова Л., РГ-Софт, 25.06.15, вопросы SLI-0005525, SLI-0005526
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.InventoryСписание.Форма.ФормаСписка" Тогда
		ОСLawson = Справочники.ОсновныеСредстваLawson.ПустаяСсылка();
	ИначеЕсли ПараметрыВыполненияКоманды.Источник.Элементы.Goods.ТекущиеДанные = Неопределено Тогда
		ОСLawson = Справочники.ОсновныеСредстваLawson.ПустаяСсылка();
	Иначе	
		ОСLawson = ПараметрыВыполненияКоманды.Источник.Элементы.Goods.ТекущиеДанные.ОСLawson;
	КонецЕсли; 
	ПараметрКоманды.Добавить(ОСLawson);
	
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	Документы.InventoryСписание.ПечатьОС(ТабДок, ПараметрКоманды);
КонецПроцедуры
