
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Если Не ДополнительныеСвойства.Свойство("ПропуститьОбновлениеВерсииДатЗапретаИзменения") Тогда
			ДатыЗапретаИзмененияСлужебный.ОбновитьВерсиюДатЗапретаИзмененияПриЗагрузкеДанных(ЭтотОбъект);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ПропуститьОбновлениеВерсииДатЗапретаИзменения") Тогда
		ДатыЗапретаИзмененияСлужебный.ОбновитьВерсиюДатЗапретаИзменения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

// {RGS SEmelyanova 08.08.2017 12:59:39 - Запись в журнал регистрации при изменении
Процедура ПередЗаписью(Отказ, Замещение)
	Если ЭтотОбъект.Количество() > 0 тогда
		Для Каждого ТекЗапись Из ЭтотОбъект Цикл
			ДаныеДоИзменения = rgsПолучитьДанныеДоИзменения(ТекЗапись);
			ЕстьИзменения = rgsСравнитьДанные(ДаныеДоИзменения, ТекЗапись);
			Если ЕстьИзменения тогда
				Если ДаныеДоИзменения = Неопределено тогда
					Сообщение = "Добавлена дата запрета: Объект - "+ТекЗапись.Объект+", Раздел - "+ТекЗапись.Раздел
					+", Пользователь - "+ТекЗапись.Пользователь+", Дата запрета - "+ТекЗапись.ДатаЗапрета;
				Иначе	
					Сообщение = "До изменений: Объект - "+ДаныеДоИзменения.Объект+", Раздел - "+ДаныеДоИзменения.Раздел+", Пользователь - "+ДаныеДоИзменения.Пользователь
					+", Дата запрета - "+ДаныеДоИзменения.ДатаЗапрета+";"+Символы.ПС+"После изменений: Объект - "+ТекЗапись.Объект+", Раздел - "+ТекЗапись.Раздел
					+", Пользователь - "+ТекЗапись.Пользователь+", Дата запрета - "+ТекЗапись.ДатаЗапрета;
				КонецЕсли;	
				ЗаписьЖурналаРегистрации("Изменение дат запрета редактирования",,Метаданные.РегистрыСведений.ДатыЗапретаИзменения,,Сообщение); 
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		Сообщение = "Сброшена дата запрета: Объект - "+ЭтотОбъект.Отбор.Объект.Значение+", Раздел - "+ЭтотОбъект.Отбор.Раздел.Значение
		+", Пользователь - "+ЭтотОбъект.Отбор.Пользователь.Значение;
		ЗаписьЖурналаРегистрации("Изменение дат запрета редактирования",,Метаданные.РегистрыСведений.ДатыЗапретаИзменения,,Сообщение);	
	КонецЕсли;

КонецПроцедуры 

Функция rgsПолучитьДанныеДоИзменения(Запись)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДатыЗапретаИзменения.Раздел,
	               |	ДатыЗапретаИзменения.Объект,
	               |	ДатыЗапретаИзменения.Пользователь,
	               |	ДатыЗапретаИзменения.ДатаЗапрета
	               |ИЗ
	               |	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	               |ГДЕ
	               |	ДатыЗапретаИзменения.Раздел = &Раздел
	               |	И ДатыЗапретаИзменения.Объект = &Объект
	               |	И ДатыЗапретаИзменения.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Объект", Запись.Объект);	
	Запрос.УстановитьПараметр("Раздел", Запись.Раздел);	
	Запрос.УстановитьПараметр("Пользователь", Запись.Пользователь);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() тогда
		Структура = Новый Структура;
		Структура.Вставить("Объект", Результат.Объект);
		Структура.Вставить("Раздел", Результат.Раздел);
		Структура.Вставить("Пользователь", Результат.Пользователь);
		Структура.Вставить("ДатаЗапрета", Результат.ДатаЗапрета);
		
		Возврат Структура;
		
	Иначе
		Возврат Неопределено;	
	КонецЕсли;	
	
КонецФункции

Функция rgsСравнитьДанные(ЗаписьДоИзменений, ТекущаяЗапись)

	ЕстьИзменения = Ложь;
	Если ЗаписьДоИзменений = Неопределено тогда
		ЕстьИзменения = Истина;
	Иначе
		Если ЗаписьДоИзменений.ДатаЗапрета <> ТекущаяЗапись.ДатаЗапрета или ЗаписьДоИзменений.Пользователь <> ТекущаяЗапись.Пользователь 
			или ЗаписьДоИзменений.Раздел <> ТекущаяЗапись.Раздел или ЗаписьДоИзменений.Объект <> ТекущаяЗапись.Объект тогда
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьИзменения;
	
КонецФункции	
// }RGS SEmelyanova 08.08.2017 13:00:05 - Запись в журнал регистрации при изменении
