////////////////////////////////////////////////////////////////////////////////
// Подсистема "Даты запрета изменения".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет изменить работу интерфейса при встраивании.
//
// Параметры:
//  НастройкиРаботыИнтерфейса - Структура - содержит свойство:
//   * ИспользоватьВнешнихПользователей - Булево - (начальное значение Ложь),
//     если установить Истина, тогда даты запрета можно будет настраивать для внешних пользователей.
//
Процедура НастройкаИнтерфейса(НастройкиРаботыИнтерфейса) Экспорт
	
	
	
КонецПроцедуры

// Содержит описание таблиц и полей объектов для проверки запретов изменения данных.
//   Вызывается из процедуры ИзменениеЗапрещено общего модуля ДатыЗапретаИзменения,
//   используемой в подписке на событие ПередЗаписью объекта для проверки наличия
//   запретов и отказа от изменений запрещенного объекта.
//
// Параметры:
//  ИсточникиДанных - ТаблицаЗначений - с колонками:
//   * Таблица     - Строка - полное имя объекта метаданных,
//                   например, Метаданные.Документы.ПриходнаяНакладная.ПолноеИмя().
//   * ПолеДаты    - Строка - имя реквизита объекта или табличной части,
//                   например "Дата", "Товары.ДатаОтгрузки".
//   * Раздел      - Строка - имя предопределенного элемента
//                   "ПланВидовХарактеристикСсылка.РазделыДатЗапрета".
//   * ПолеОбъекта - Строка - имя реквизита объекта или реквизита табличной части,
//                   например "Организация", "Товары.Склад".
//
//  Для добавления строки имеется процедура ДобавитьСтроку в общем модуле ДатыЗапретаИзменения.
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	// Раздел "Sales book"
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.КорректировкаДолга.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя(), "ДатаПроведения");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ОтчетАгентаПоРасходам.ПолноеИмя(), "ДатаПроведения");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПередачаОС.ПолноеИмя(), "ДатаПроведения");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СчетФактураВыданный.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СчетНаОплатуПокупателю.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗакрытиеСчетовНаПредоплату.ПолноеИмя(), "Дата");
	// { RGS LFedotova 14.09.2017 16:58:46 - вопрос SLI-0007356
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Tickets.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.Tickets.ПолноеИмя(), "ДатаПроведения");
	// } RGS LFedotova 14.09.2017 16:59:17 - вопрос SLI-0007356
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.SiebelOrders.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ФормированиеЗаписейКнигиПродаж.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПлатежноеПоручениеВходящее.ПолноеИмя(), "Дата");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПлатежноеПоручениеИсходящее.ПолноеИмя(), "Дата");	

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаДолга", "Дата", "SalesBook", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РеализацияТоваровУслуг", "ДатаПроведения", "SalesBook");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетАгентаПоРасходам", "ДатаПроведения", "SalesBook", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаОС", "ДатаПроведения", "SalesBook", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетФактураВыданный", "Дата", "SalesBook", "Организация");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетНаОплатуПокупателю", "Дата", "SalesBook", "Организация");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗакрытиеСчетовНаПредоплату", "Дата", "SalesBook", "Организация");
	// { RGS LFedotova 14.09.2017 17:00:16 - вопрос SLI-0007356
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Tickets", "Дата", "SalesBook");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Tickets", "ДатаПроведения", "SalesBook");
	// } RGS LFedotova 14.09.2017 17:00:34 - вопрос SLI-0007356
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.SiebelOrders", "Дата", "SalesBook");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ФормированиеЗаписейКнигиПродаж", "Дата", "SalesBook", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПлатежноеПоручениеИсходящее", "Дата", "SalesBook", "Организация");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ДокументРасчетовСКонтрагентом", "Дата", "SalesBook", "Организация");	
	// { RGS LFedotova 06.03.2018 11:41:36 - вопрос SLI-0007503
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетПринципалуОПродажах", "Дата", "SalesBook", "Организация");	
	
	// } RGS LFedotova 06.03.2018 11:42:07 - вопрос SLI-0007503
	
	// Раздел "Fixed Assets"
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПринятиеКУчетуОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ВводНачальныхОстатковОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИзменениеПараметровНачисленияАмортизацииОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИзменениеСостоянияОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ИзменениеСпециальногоКоэффициентаОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.МодернизацияОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.НачислениеАмортизации.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПеремещениеОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПеремещениеЛокальногоОборудования.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СписаниеОборудования.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ТранспортныеРасходыПоОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СписаниеОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ПодготовкаКПередачеОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.РазукрупнениеОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.КомплектацияОС.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ФормированиеНалогаНаИмущество.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.КорректировкаОС.ПолноеИмя(), "Дата");
	// { RGS LFedotova 06.03.2018 11:45:13 - SLI-0007503
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ОтчетПринципалуОПродажах.ПолноеИмя(), "Дата");
	// } RGS LFedotova 06.03.2018 11:45:17 - SLI-0007503 
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПринятиеКУчетуОС", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводНачальныхОстатковОС", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеПараметровНачисленияАмортизацииОС", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеСостоянияОС", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеСпециальногоКоэффициентаОС", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МодернизацияОС", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НачислениеАмортизации", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеОС", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеЛокальногоОборудования", "Дата", "FixedAssets");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеОборудования", "Дата", "FixedAssets");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ТранспортныеРасходыПоОС", "Дата", "FixedAssets");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеОС", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПодготовкаКПередачеОС", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РазукрупнениеОС", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КомплектацияОС", "Дата", "FixedAssets", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ФормированиеНалогаНаИмущество", "Дата", "FixedAssets");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаОС", "Дата", "FixedAssets");
	
	// Purchase book
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СчетКнигиПокупок.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ОплатаКнигиПокупок.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.СчетФактураАктУпр.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.РегистрацияПП.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ЗакрытиеПредоплаты.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.ФормированиеЗаписейКнигиПокупок.ПолноеИмя(), "Дата");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетКнигиПокупок", "Дата", "PurchaseBook", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОплатаКнигиПокупок", "Дата", "PurchaseBook", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетФактураАктУпр", "Дата", "PurchaseBook", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РегистрацияПП", "Дата", "PurchaseBook", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗакрытиеПредоплаты", "Дата", "PurchaseBook", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ФормированиеЗаписейКнигиПокупок", "Дата", "PurchaseBook", "Организация");
	
	// Inventory	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.InventoryПоступление.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.InventoryПеремещение.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.InventoryКорректировка.ПолноеИмя(), "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.Документы.InventoryСписание.ПолноеИмя(), "Дата");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.InventoryПоступление", "Дата", "Inventory");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.InventoryПеремещение", "Дата", "Inventory");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.InventoryКорректировка", "Дата", "Inventory");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.InventoryСписание", "Дата", "Inventory");
	
КонецПроцедуры

// Позволяет переопределить выполнение проверок запретов по произвольному условию.
//
// Параметры:
//  Объект       - СправочникОбъект,
//                 ДокументОбъект,
//                 ПланВидовХарактеристикОбъект,
//                 ПланСчетовОбъект,
//                 ПланВидовРасчетаОбъект,
//                 БизнесПроцессОбъект,
//                 ЗадачаОбъект,
//                 ПланОбменаОбъект - объект данных (ПередЗаписью или ПриЧтенииНаСервере).
//               - РегистрСведенийНаборЗаписей,
//                 РегистрНакопленияНаборЗаписей,
//                 РегистрБухгалтерииНаборЗаписей,
//                 РегистрРасчетаНаборЗаписей - набор записей (ПередЗаписью или ПриЧтенииНаСервере).
//
//                 Для документов в свойство ДополнительныеСвойства вставляется свойство РежимЗаписи,
//                 если вызов делается в процессе записи документа.
//  
//  ПроверкаЗапретаИзменения    - Булево - когда Истина, тогда проверка изменения выполняется.
//                                Если установить Ложь, тогда проверка запрета изменения будет пропущена.
//
//  УзелПроверкиЗапретаЗагрузки - Неопределено - проверка запрета загрузки не выполняется.
//                              - ПланыОбменаСсылка - проверка запрета загрузки выполняется. Если
//                                установить Неопределено, проверка запрета загрузки будет пропущена.
//
//  ВерсияОбъекта               - Строка - начальное значение "". Проверяются обе версии объекта.
//                                Если установить "СтараяВерсия" или "НоваяВерсия", тогда будет
//                                выполнена проверка только старой или только новой версии объекта.
//
Процедура ПередПроверкойЗапретаИзменения(Объект,
                                         ПроверкаЗапретаИзменения,
                                         УзелПроверкиЗапретаЗагрузки,
                                         ВерсияОбъекта) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
