
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		РГСофтКлиентСервер.УстановитьЗначение(Запись.Account, СокрЛП(Запись.Account));
		РГСофтКлиентСервер.УстановитьЗначение(Запись.SubAccount, СокрЛП(Запись.SubAccount));
		
		Если НЕ ЗначениеЗаполнено(Запись.Период) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Start date"" is empty!",
				, "Период", "Запись", Отказ);			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.AU) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""AU"" is empty!",
				, "AU", "Запись", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.Account) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Account"" is empty!",
				, "Account", "Запись", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
