
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;    	
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС, Строка(Перечисления.СтавкиНДС.БезНДС)); 		
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС0, Строка(Перечисления.СтавкиНДС.НДС0));
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18, Строка(Перечисления.СтавкиНДС.НДС18));
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС18_118, Строка(Перечисления.СтавкиНДС.НДС18_118));	
	// { RGS LFedotova 26.04.2017 15:39:45 - вопрос SLI-0007258
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10, Строка(Перечисления.СтавкиНДС.НДС10));
	ДанныеВыбора.Добавить(Перечисления.СтавкиНДС.НДС10_110, Строка(Перечисления.СтавкиНДС.НДС10_110));	
	// } RGS LFedotova 26.04.2017 15:39:51 - вопрос SLI-0007258
	
КонецПроцедуры
