
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Stage = ОпределитьStage(ПараметрКоманды);
	
	Если Stage = ПредопределенноеЗначение("Перечисление.TripNonLawsonCompaniesStages.Saved_ApprovalIsRequired")
		ИЛИ Stage = ПредопределенноеЗначение("Перечисление.TripNonLawsonCompaniesStages.Rejected") Тогда
		
		Approval = ПолучитьСсылкуНаApproval(ПараметрКоманды);
		
		Если Approval = Неопределено Тогда 
			СтруктураПараметров = Новый Структура("Основание", ПараметрКоманды);
		иначе
			СтруктураПараметров = Новый Структура("Ключ", Approval);
		КонецЕсли;

		ОткрытьФорму("Задача.TripsNonLawsonApproval.ФормаОбъекта", СтруктураПараметров,
			ПараметрыВыполненияКоманды.Источник,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
	иначе
		
		Сообщить("Approval is not required or Trip is not saved (draft) / Утверждение не требуется или Поставка не записана!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьStage(Trip)
	
	Возврат РегистрыСведений.StagesOfTripsNonLawsonCompanies.ОпределитьStage(Trip);	
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуНаApproval(Trip)
	
	Возврат Задачи.TripsNonLawsonApproval.ПолучитьСсылкуНаApproval(Trip);	
	
КонецФункции
