
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПровестиБезМодуляНаСервере(ПараметрКоманды);
КонецПроцедуры

&НаСервере
Процедура ПровестиБезМодуляНаСервере(Документ);
	
	//{RGS AFokin 03.03.2017 - если документ проведен, нет смысла проверять проведение (TCS-0003320)
	Если Документ.Проведен Тогда
		Сообщить("Документ проведен! Для проверки проведения документ должен быть непроведенным.");
		Возврат;
	КонецЕсли;	
	//}RGS AFokin 03.03.2017
	
	ДокументПроведен = Документ.Проведен;
	
	ДокументОбъект = Документ.ПолучитьОбъект();
	ДополнительныеСвойства = ДокументОбъект.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("ПроверкаПроведения", Истина);
	Если ДокументОбъект.ПроверитьЗаполнение() Тогда
		ДокументПроводится = ПровестиДокумент(ДокументОбъект, РежимЗаписиДокумента.Проведение); 
		
		Если НЕ ДокументПроводится Тогда
			Сообщить("Ошибка при проверке возможности проведения документа");
		Иначе
			Сообщить("Документ успешно прошел проверку проведения");
			//{RGS AFokin 03.03.2017
			//Если  НЕ ДокументПроведен Тогда
			//	ОтменаПроведения = ПровестиДокумент(ДокументОбъект, РежимЗаписиДокумента.ОтменаПроведения); 
			//КонецЕсли; 
			ОбщегоНазначения.УдалитьДвиженияРегистратора(ДокументОбъект, Ложь, Ложь, Истина);
			ОтменаПроведения = ПровестиДокумент(ДокументОбъект, РежимЗаписиДокумента.ОтменаПроведения); 
			//}RGS AFokin 03.03.2017
		КонецЕсли; 
	КонецЕсли;
	ДополнительныеСвойства.Удалить("ПроверкаПроведения"); 
		
КонецПроцедуры

&НаСервере
Функция ПровестиДокумент(ДокументОбъект, РежимЗаписиДокумента)
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции
	
