#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	// инициализируем контекст ЭДО - модуль обработки
	ТекстСообщения = "";
	КонтекстЭДО = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО(ТекстСообщения);
	Если КонтекстЭДО = Неопределено Тогда 
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	КонтекстЭДО.ОбработкаПолученияФормы("Документ", "ЗапросНаИнформационноеОбслуживаниеСтрахователя", ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПерезаполнитьЗначениеРеквизитаНаДату() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапросНаИнформационноеОбслуживаниеСтрахователя.Ссылка
	|ИЗ
	|	Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя КАК ЗапросНаИнформационноеОбслуживаниеСтрахователя
	|ГДЕ
	|	ЗапросНаИнформационноеОбслуживаниеСтрахователя.НаДату = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СверкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СверкаОбъект.НаДату = СверкаОбъект.Дата;
		СверкаОбъект.ОбменДанными.Загрузка = Истина;
		СверкаОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли