
Процедура PullDataFromTMS(Таймаут = 2, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт
	
	scr = Новый COMОбъект("WScript.Shell"); // для паузы между вызовами
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	OBNoQueue.OBNo
		|ИЗ
		|	РегистрСведений.OBNoQueue КАК OBNoQueue
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Trip.DomesticOB КАК TripDomesticOB
		|		ПО OBNoQueue.OBNo = TripDomesticOB.OBNo
		|	#ШаблонУсловия#
		|
		|УПОРЯДОЧИТЬ ПО
		|	TripDomesticOB.Ссылка.Дата УБЫВ";

	ШаблонУсловия = "";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		ШаблонУсловия = "ГДЕ TripDomesticOB.Ссылка.Дата >= &ДатаНачала";
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			ШаблонУсловия = ШаблонУсловия + " И TripDomesticOB.Ссылка.Дата <= &ДатаОкончания";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ДатаОкончания) Тогда
		ШаблонУсловия = "ГДЕ TripDomesticOB.Ссылка.Дата <= &ДатаОкончания";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ШаблонУсловия#", ШаблонУсловия);
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	НЗ_OBNoQueue = РегистрыСведений.OBNoQueue.СоздатьНаборЗаписей();
	НЗ_OBNoAndWONo = РегистрыСведений.OBNoAndWONo.СоздатьНаборЗаписей();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Таймаут > 0 Тогда
			scr.Run("timeout " + Формат(Таймаут, "ЧГ=0"),0,1);
		КонецЕсли;
		
		OBNo = ВыборкаДетальныеЗаписи.OBNo;
		
		Попытка
			СтруктураShipmentNoИStatus = Обработки.PullMasterDataFromTMS.ПолучитьСтруктуруShipmentNoИStatus(OBNo);
		Исключение
			Продолжить;
		КонецПопытки;
		
		ОтсортированныйМассивShipmentNo = РГСофтКлиентСервер.СортироватьМассив(СтруктураShipmentNoИStatus.МассивShipmentNo);
		МассивНомеровСтрокой = "";
		Для каждого ShipmentNo Из ОтсортированныйМассивShipmentNo Цикл
			МассивНомеровСтрокой = МассивНомеровСтрокой + ShipmentNo + ", ";
		КонецЦикла;
		МассивНомеровСтрокой = ?(МассивНомеровСтрокой = "", "", Лев(МассивНомеровСтрокой, СтрДлина(МассивНомеровСтрокой) - 2));
		
		НЗ_OBNoQueue.Отбор.OBNo.Установить(OBNo);
		НЗ_OBNoQueue.Очистить();
		НЗ_OBNoAndWONo.Отбор.OBNo.Установить(OBNo);
		НЗ_OBNoAndWONo.Очистить();
		НоваяЗапись = НЗ_OBNoAndWONo.Добавить();
		НоваяЗапись.OBNo = OBNo;
		НоваяЗапись.WO = МассивНомеровСтрокой;
		
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		
		Попытка
			НЗ_OBNoQueue.Записать(Истина);
			НЗ_OBNoAndWONo.Записать(Истина);
		Исключение
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки;
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;

КонецПроцедуры
