
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НачалоПериода") Тогда
		НачалоПериода = Параметры.НачалоПериода;
	КонецЕсли;
	Если Параметры.Свойство("КонецПериода") Тогда
		КонецПериода = Параметры.КонецПериода;
	КонецЕсли;
	
	Если Параметры.Свойство("Периодичность") Тогда
		ВидПериода = Параметры.Периодичность;
	Иначе
		ВидПериода = Перечисления.Периодичность.Год;
	КонецЕсли;
	
	Если Параметры.Свойство("СНачалаГода") Тогда
		НарастающимИтогомСНачалаГода = Параметры.СНачалаГода;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) ИЛИ Не ЗначениеЗаполнено(КонецПериода) Тогда
		ВидПериода = Перечисления.Периодичность.Квартал;
		НачалоПериода = НачалоКвартала(ДобавитьМесяц(НачалоКвартала(ТекущаяДатаСеанса()), -1));
		КонецПериода = КонецКвартала(НачалоПериода);
	КонецЕсли;
	
	ОпределитьИнтервал();
	
	ЗаполнитьСпискиВыбора(ЭтаФорма);
	УправлениеФормой(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаКвартал(Команда)
	
	Интервал = 0;
	ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал");
	ЗаполнитьИнтервал();
	ЗаполнитьСпискиВыбора(ЭтаФорма);
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаПолугодие(Команда)
	
	Интервал = 0;
	ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие");
	ЗаполнитьИнтервал();
	ЗаполнитьСпискиВыбора(ЭтаФорма);
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаГод(Команда)
	
	Интервал = 0;
	ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Год");
	ЗаполнитьИнтервал();
	ЗаполнитьСпискиВыбора(ЭтаФорма);
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаМесяц(Команда)
	
	Интервал = 0;
	ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
	ЗаполнитьИнтервал();
	ЗаполнитьСпискиВыбора(ЭтаФорма);
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнтервал()
	
	Если Не ЗначениеЗаполнено(Интервал) Тогда
		Если ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
			Интервал = Месяц(ТекущаяДата());
		ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
			Если Месяц(ТекущаяДата()) < 4 Тогда
				Интервал = 1;
			ИначеЕсли Месяц(ТекущаяДата()) > 3 И Месяц(ТекущаяДата()) < 7 Тогда
				Интервал = 2;
			ИначеЕсли Месяц(ТекущаяДата()) > 6 И Месяц(ТекущаяДата()) < 10 Тогда
				Интервал = 3;
			Иначе
				Интервал = 4;
			КонецЕсли;	
		ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
			Если Месяц(ТекущаяДата()) < 7 Тогда
				Интервал = 1;
			Иначе
				Интервал = 2;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		Элементы.ПодменюВидПериода.Заголовок = Элементы.ВидПериодаГод.Заголовок;
		УстановитьПометку(Форма, "ВидПериодаГод");
	ИначеЕсли Форма.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		Элементы.ПодменюВидПериода.Заголовок = Элементы.ВидПериодаПолугодие.Заголовок;
		УстановитьПометку(Форма, "ВидПериодаПолугодие");
	ИначеЕсли Форма.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Элементы.ПодменюВидПериода.Заголовок = Элементы.ВидПериодаКвартал.Заголовок;
		УстановитьПометку(Форма, "ВидПериодаКвартал");
	ИначеЕсли Форма.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		Элементы.ПодменюВидПериода.Заголовок = Элементы.ВидПериодаМесяц.Заголовок;
		УстановитьПометку(Форма, "ВидПериодаМесяц");
	КонецЕсли;
	
	Элементы.Интервал.Видимость = Форма.ВидПериода <> ПредопределенноеЗначение("Перечисление.Периодичность.Год");
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПометку(Форма, ИмяКнопки)
	
	Элементы = Форма.Элементы;
	
	СписокИменКнопок = Новый Массив;
	СписокИменКнопок.Добавить("ВидПериодаГод");
	СписокИменКнопок.Добавить("ВидПериодаПолугодие");
	СписокИменКнопок.Добавить("ВидПериодаКвартал");
	СписокИменКнопок.Добавить("ВидПериодаМесяц");
	
	// Снять пометки
	Для Каждого ТекущееИмяКнопки Из СписокИменКнопок Цикл
		Элементы[ТекущееИмяКнопки].Пометка = Ложь;	
	КонецЦикла;
	
	Элементы[ИмяКнопки].Пометка = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСпискиВыбора(Форма)
	
	ЗаполнитьСписокВыбораГод(Форма);
	ЗаполнитьСписокВыбораИнтервал(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораГод(Форма)
	
	Форма.Элементы.Год.СписокВыбора.Очистить();
	
	ТекущийГод = КонецГода(ТекущаяДата());
	
	Индекс = 0;
	Пока Индекс < 4 Цикл
		Значение = ДобавитьМесяц(ТекущийГод, - Индекс * 12);
		Форма.Элементы.Год.СписокВыбора.Вставить(0, Значение, Формат(Год(Значение), "ЧГ="));
		Индекс = Индекс + 1;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораИнтервал(Форма)
	
	Элементы = Форма.Элементы;
	СписокВыбора = Элементы.Интервал.СписокВыбора;
	СписокВыбора.Очистить();
	Если Форма.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		СписокВыбора.Добавить(1, ВернутьСтр("ru = '1 полугодие'"));
		СписокВыбора.Добавить(2, ВернутьСтр("ru = '2 полугодие'"));
	ИначеЕсли Форма.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		СписокВыбора.Добавить(1, ВернутьСтр("ru = '1 квартал'"));
		СписокВыбора.Добавить(2, ВернутьСтр("ru = '2 квартал'"));
		СписокВыбора.Добавить(3, ВернутьСтр("ru = '3 квартал'"));
		СписокВыбора.Добавить(4, ВернутьСтр("ru = '4 квартал'"));
	ИначеЕсли Форма.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		СписокВыбора.Добавить(1, ВернутьСтр("ru = 'Январь'"));
		СписокВыбора.Добавить(2, ВернутьСтр("ru = 'Февраль'"));
		СписокВыбора.Добавить(3, ВернутьСтр("ru = 'Март'"));
		СписокВыбора.Добавить(4, ВернутьСтр("ru = 'Апрель'"));
		СписокВыбора.Добавить(5, ВернутьСтр("ru = 'Май'"));
		СписокВыбора.Добавить(6, ВернутьСтр("ru = 'Июнь'"));
		СписокВыбора.Добавить(7, ВернутьСтр("ru = 'Июль'"));
		СписокВыбора.Добавить(8, ВернутьСтр("ru = 'Август'"));
		СписокВыбора.Добавить(9, ВернутьСтр("ru = 'Сентябрь'"));
		СписокВыбора.Добавить(10, ВернутьСтр("ru = 'Октябрь'"));
		СписокВыбора.Добавить(11, ВернутьСтр("ru = 'Ноябрь'"));
		СписокВыбора.Добавить(12, ВернутьСтр("ru = 'Декабрь'"));
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		НачалоПериода = НачалоГода(КонецПериода);
		КонецПериода = КонецГода(КонецПериода);
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		Если Интервал = 1 Тогда
			НачалоПериода = НачалоГода(КонецПериода);
			КонецПериода = КонецМесяца(Дата(Год(НачалоПериода), 6, 1));
		Иначе
			НачалоПериода = Дата(Год(КонецПериода), 7, 1);
			КонецПериода = КонецГода(КонецПериода);
		КонецЕсли;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		НачалоПериода = НачалоКвартала(Дата(Год(КонецПериода), Интервал * 3, 1));
		КонецПериода = КонецКвартала(НачалоПериода);
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		НачалоПериода = НачалоМесяца(Дата(Год(КонецПериода), Интервал, 1));
		КонецПериода = КонецМесяца(НачалоПериода);
	КонецЕсли;
	
	Если НарастающимИтогомСНачалаГода Тогда
		НачалоПериода = НачалоГода(НачалоПериода);
	КонецЕсли;
 
	Закрыть(Новый Структура("НачалоПериода,КонецПериода,Периодичность", НачалоПериода, КонецПериода, ВидПериода));
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьИнтервал()
	
	Если ВидПериода = Перечисления.Периодичность.Полугодие Тогда
		Если Месяц(КонецПериода) < 7 Тогда
			Интервал = 1;
		Иначе
			Интервал = 2;
		КонецЕсли;
	ИначеЕсли ВидПериода = Перечисления.Периодичность.Квартал Тогда
		Если Месяц(КонецПериода) < 4 Тогда
			Интервал = 1;
		ИначеЕсли Месяц(КонецПериода) > 3 И Месяц(КонецПериода) < 7 Тогда
			Интервал = 2;
		ИначеЕсли Месяц(КонецПериода) > 6 И Месяц(КонецПериода) < 10 Тогда
			Интервал = 3;
		Иначе
			Интервал = 4;
		КонецЕсли;
	ИначеЕсли ВидПериода = Перечисления.Периодичность.Месяц Тогда
		Интервал = Месяц(КонецПериода);
	Иначе
		Интервал = 1;
	КонецЕсли;
		
КонецПроцедуры
