
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НовыйКоммент = СокрЛП(ПараметрыВыполненияКоманды.Источник.НовыйКоммент);
	
	Если ЗначениеЗаполнено(НовыйКоммент) Тогда 
		ДобавитьКомментарийНаСервере(ПараметрКоманды, НовыйКоммент);
		Оповестить("ИзменилсяCommentTR");
	иначе
		Сообщить("Comment is empty / Комментарий не заполнен!");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьКомментарийНаСервере(TRСсылка, НовыйКоммент)
	
	УстановитьПривилегированныйРежим(Истина);
	
	TRОбъект = TRСсылка.ПолучитьОбъект();
	TRОбъект.ОбменДанными.Загрузка = Истина;
	TRОбъект.Comments = TRОбъект.Comments + ?(Не ПустаяСтрока(TRОбъект.Comments), "
		|", "") + НовыйКоммент;
	TRОбъект.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры