
&НаКлиенте
Процедура Передать(Команда)
	МассивНомеров = ВыгрузитьНомера();
	Оповестить("Номера документов", МассивНомеров);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьИЗакрыть(Команда)
	МассивНомеров = ВыгрузитьНомера();
	Оповестить("Номера документов", МассивНомеров);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНомера()
	Возврат Объект.СписокНомеров.Выгрузить().ВыгрузитьКолонку("НомерДокумента"); 
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НомераДокументов") Тогда 
		МассивНомеров = Параметры.НомераДокументов;

		Для к = 1 По МассивНомеров.Количество() Цикл
			НоваяСтрока = Объект.СписокНомеров.Добавить();
			НоваяСтрока.НомерДокумента = МассивНомеров[к-1];
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры

