
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТекстОтбора") Тогда
		Если ЗначениеЗаполнено(Параметры.ТекстОтбора) Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("SPN");
		    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НачинаетсяС;
		    ЭлементОтбора.Использование = Истина;
		    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		    ЭлементОтбора.ПравоеЗначение = Параметры.ТекстОтбора;	
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("BPN") Тогда
		Если ЗначениеЗаполнено(Параметры.BPN) Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("BPN");
		    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		    ЭлементОтбора.Использование = Истина;
		    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		    ЭлементОтбора.ПравоеЗначение = Параметры.BPN;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлемент(Команда)		
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Ответ = Новый Структура("SPN,BPN,BuyerPartDescription,SuppllerPartDescription,SuppllerName");
		ЗаполнитьЗначенияСвойств(Ответ,Элементы.Список.ТекущиеДанные);
		ОповеститьОВыборе(Ответ);
	Иначе		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьЭлемент(Неопределено);
КонецПроцедуры
