////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ УПРАВЛЕНИЯ ИНДЕКСОМ ПОЛНОТЕКСТОВОГО ПОИСКА

// Обновляет индекс полнотекстового поиска
Процедура ОбновлениеИндексаППД() Экспорт
	
	РазрешитьПолнотекстовыйПоиск = ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить;
	Если РазрешитьПолнотекстовыйПоиск = Ложь Тогда
		Возврат;
	КонецЕсли;	
	
	ПолнотекстовыйПоиск.ОбновитьИндекс(Ложь, Истина);
	
КонецПроцедуры

// Выполняет слияние индексов полнотекстового поиска
Процедура СлияниеИндексаППД() Экспорт
	
	РазрешитьПолнотекстовыйПоиск = ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить;
	Если РазрешитьПолнотекстовыйПоиск = Ложь Тогда
		Возврат;
	КонецЕсли;	

	ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
	
КонецПроцедуры

Процедура ОчисткаИндексаППД() Экспорт
	
	ПолнотекстовыйПоиск.ОчиститьИндекс();
	
КонецПроцедуры 