
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ДоговорЗаполнен(ПараметрКоманды) Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетНаОплатуПокупателю", "ОригиналСчета", ПараметрКоманды,
														 ПараметрыВыполненияКоманды);
	КонецЕсли;
													 
КонецПроцедуры

&НаСервере
Функция ДоговорЗаполнен(Док)
	
	Если Не ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Необходимо заполнить договор контрагента!");
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции
