
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Отбор.Вставить("Проведен", Ложь);
	ИсходныйТекстЗапроса = Список.ТекстЗапроса;
	
КонецПроцедуры

&НаКлиенте
Процедура СегментыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Сегменты) Тогда
		ОтборУстановлен = Истина;
	КонецЕсли;
	
	ОбновитьОтборПоСегменту();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборПоСегменту()
	
	ТекстЗапроса = ИсходныйТекстЗапроса;
	Если ЗначениеЗаполнено(Сегменты) И ОтборУстановлен Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСегментов", "ДокументРаспределениеИмпортаПоЗакрытиюПоставки.Ссылка В (&Ссылка)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСегментов", "Истина");
	КонецЕсли; 
	
	Список.ТекстЗапроса = ТекстЗапроса;
	Если ЗначениеЗаполнено(Сегменты)  И ОтборУстановлен Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Ссылка", ПолучитьСписокСсылок(Сегменты));
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСсылок(Сегменты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаспределениеИмпортаПоЗакрытиюПоставкиСопоставлениеInvoiceLinesИDSS.Ссылка
	|ИЗ
	|	Документ.РаспределениеИмпортаПоЗакрытиюПоставки.СопоставлениеInvoiceLinesИDSS КАК РаспределениеИмпортаПоЗакрытиюПоставкиСопоставлениеInvoiceLinesИDSS
	|ГДЕ
	|	РаспределениеИмпортаПоЗакрытиюПоставкиСопоставлениеInvoiceLinesИDSS.InvoiceLine.КостЦентр.Сегмент В ИЕРАРХИИ(&Сегменты)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределениеИмпортаПоЗакрытиюПоставкиСопоставлениеInvoiceLinesИDSS.Ссылка";
	
	Запрос.УстановитьПараметр("Сегменты", Сегменты);
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтборПоСегменту();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборУстановленПриИзменении(Элемент)
	
	ОбновитьОтборПоСегменту();
	
КонецПроцедуры
 
 