&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Подразделение") Тогда		
		Сообщить("Не заполнено подразделение! Берем случайное!");
		Выб = Справочники.ПодразделенияОрганизаций.Выбрать();
		Выб.Следующий();		
		Подразделение = Выб.Ссылка;	
	Иначе
		Подразделение = Параметры.Подразделение;		
	КонецЕсли;

	////////// Инициализация формы
	ЗагрузитьПоказателиИзМакета();
	УстановитьПривилегированныйРежим(Истина);
	СохраненныеДанные = ХранилищеОбщихНастроек.Загрузить("НастройкиПодразделенийДляОтчетаПрибыльИностраннойОрганизации", Подразделение, , "ПользовательОтчетаПрибыльИностраннойОрганизации");	
	УстановитьПривилегированныйРежим(Ложь);
	Если СохраненныеДанные = Неопределено Тогда		
		Сообщить("Это новые настройки!");      		
		ТаблицаG.Добавить();		
	Иначе                   		
		ЗаполнитьСохраненнымиДанными(СохраненныеДанные);		
		Сообщить("Загружены ранее сохраненные настройки!");      		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНастройки(Команда)

	ДаныеПоПодразделению = Новый Структура;
	
	//A
	ДаныеПоПодразделению.Вставить("ПодачаЗаПредПериодДа", 		ПодачаЗаПредПериод = "Да");
	ДаныеПоПодразделению.Вставить("ПодачаЗаПредПериодНет", 		ПодачаЗаПредПериод = "Нет");
	ДаныеПоПодразделению.Вставить("НачДеят", 					НачДеят);
	ДаныеПоПодразделению.Вставить("КонДеят", 					КонДеят);
	//B
	ДаныеПоПодразделению.Вставить("ОсДеятвРФДа", 				ОсДеятвРФ = "Да");
	ДаныеПоПодразделению.Вставить("ОсДеятвРФНет", 				ОсДеятвРФ = "Нет");
	//C
	ДаныеПоПодразделению.Вставить("ОсДеятвРФПредДа", 			ОсДеятвРФПред = "Да");
	ДаныеПоПодразделению.Вставить("ОсДеятвРФПредНет",			ОсДеятвРФПред = "Нет");
	//D
	ДаныеПоПодразделению.Вставить("П000020006000",				П000020006000);
	ДаныеПоПодразделению.Вставить("КодСтраныСогл",				КодСтраныСогл);	
	//E                 
	ДаныеПоПодразделению.Вставить("ТипОрг1",					ТипОрг = "отделения иностранной организации");
	ДаныеПоПодразделению.Вставить("ТипОрг2",					ТипОрг = "иной организации");
	ДаныеПоПодразделению.Вставить("ТипОрг3",					ТипОрг = "физического лица");
	//F
	ДаныеПоПодразделению.Вставить("П000020009000",				П000020009000);
	ДаныеПоПодразделению.Вставить("КодСтраны",					КодСтраны);
	ДаныеПоПодразделению.Вставить("П000020011000",				П000020011000);
	//G
	Массив = Новый Массив;
	Для каждого Строка из ТаблицаG Цикл
		Структура = Новый Структура;
		Структура.Вставить("П000020012002", Строка.П000020012002);
		Структура.Вставить("П000020012003", Строка.П000020012003);
		Структура.Вставить("П000020012004", Строка.П000020012004);
		Структура.Вставить("П000020012005", Строка.П000020012005);		
		Массив.Добавить(Структура);
	КонецЦикла;
	ДаныеПоПодразделению.Вставить("ТаблицаG",					Массив);
	//H
	ДаныеПоПодразделению.Вставить("РОВладИОДа", 				РОВладИО = "Да");
	ДаныеПоПодразделению.Вставить("РОВладИОНет",				РОВладИО = "Нет");
	//I
	ДаныеПоПодразделению.Вставить("П000020014000",				П000020014000); 		
	//J
	ДаныеПоПодразделению.Вставить("ИННРО1",						ИННРО1); 		
	ДаныеПоПодразделению.Вставить("КППРО1",						КППРО1); 
	//K
	ДаныеПоПодразделению.Вставить("ИОВладРОДа",					ИОВладРО = "Да"); 		
	ДаныеПоПодразделению.Вставить("ИОВладРОНет",				ИОВладРО = "Нет"); 
	//L
	ДаныеПоПодразделению.Вставить("П000020018000",				П000020018000); 		
	//M
	ДаныеПоПодразделению.Вставить("ИННРО2",						ИННРО2); 		
	ДаныеПоПодразделению.Вставить("КППРО2",						КППРО2); 
	//N
	ДаныеПоПодразделению.Вставить("СделкисАссЛицДа",			СделкисАссЛиц = "Да"); 		
	ДаныеПоПодразделению.Вставить("СделкисАссЛицНет",			СделкисАссЛиц = "Нет");  	
	
	//Сохранение	
	СохранитьНастройкиСервер(ДаныеПоПодразделению);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСервер(ДаныеПоПодразделению)
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("НастройкиПодразделенийДляОтчетаПрибыльИностраннойОрганизации", Подразделение, ДаныеПоПодразделению, ,"ПользовательОтчетаПрибыльИностраннойОрганизации");			                                              
	УстановитьПривилегированныйРежим(Ложь);
	Сообщить("Настройки сохранены!");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСохраненнымиДанными(СохраненныеДанные)
	
	Для каждого Элемент из СохраненныеДанные Цикл
		
		Если Элемент.Ключ = "ПодачаЗаПредПериодДа" Тогда
			
			Если Элемент.Значение = Истина Тогда
				ПодачаЗаПредПериод = "Да";					
			КонецЕсли;
			
		ИначеЕсли Элемент.Ключ = "ПодачаЗаПредПериодНет" Тогда
			
			Если Элемент.Значение = Истина Тогда
				ПодачаЗаПредПериод = "Нет";					
			КонецЕсли;  
			
		ИначеЕсли Элемент.Ключ = "НачДеят" Тогда
			
			НачДеят = Элемент.Значение;
			
		ИначеЕсли Элемент.Ключ = "КонДеят" Тогда
			
			КонДеят = Элемент.Значение;
			
		ИначеЕсли Элемент.Ключ = "ОсДеятвРФДа" Тогда
			
			Если Элемент.Значение = Истина Тогда
				ОсДеятвРФ = "Да";					
			КонецЕсли;  
			
		ИначеЕсли Элемент.Ключ = "ОсДеятвРФНет" Тогда
			
			Если Элемент.Значение = Истина Тогда
				ОсДеятвРФ = "Нет";					
			КонецЕсли;  
			
		ИначеЕсли Элемент.Ключ = "ОсДеятвРФПредДа" Тогда
			
			Если Элемент.Значение = Истина Тогда
				ОсДеятвРФПред = "Да";					
			КонецЕсли;       
			
		ИначеЕсли Элемент.Ключ = "ОсДеятвРФПредНет" Тогда
			
			Если Элемент.Значение = Истина Тогда
				ОсДеятвРФПред = "Нет";					
			КонецЕсли;       
			
		ИначеЕсли Элемент.Ключ = "П000020006000" Тогда
			
			П000020006000 = Элемент.Значение;
			
		ИначеЕсли Элемент.Ключ = "КодСтраныСогл" Тогда
			                              
			КодСтраныСогл = Элемент.Значение;
			
		ИначеЕсли Элемент.Ключ = "П000020011000" Тогда
			                              
			П000020011000 = Элемент.Значение;
			
		ИначеЕсли Элемент.Ключ = "ТипОрг1" Тогда
			
			Если Элемент.Значение = Истина Тогда
				ТипОрг = "отделения иностранной организации";
			КонецЕсли;   
			
		ИначеЕсли Элемент.Ключ = "ТипОрг2" Тогда
			
			Если Элемент.Значение = Истина Тогда
				ТипОрг = "иной организации";
			КонецЕсли;   
			
		ИначеЕсли Элемент.Ключ = "ТипОрг3" Тогда
			
			Если Элемент.Значение = Истина Тогда
				ТипОрг = "физического лица";
			КонецЕсли;   
			
		ИначеЕсли Элемент.Ключ = "П000020009000" Тогда
			
			П000020009000 = Элемент.Значение;
			
		ИначеЕсли Элемент.Ключ = "КодСтраны" Тогда
			
			КодСтраны = Элемент.Значение;
			
		ИначеЕсли Элемент.Ключ = "ТаблицаG" Тогда
			
			Если ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
				
				Для каждого ЭлементМассива из Элемент.Значение Цикл
					СтрокаТаблицыG = ТаблицаG.Добавить();						
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыG, ЭлементМассива);
				КонецЦикла;
				
			КонецЕсли;					
			
		ИначеЕсли Элемент.Ключ = "РОВладИОДа" Тогда
			
			Если Элемент.Значение = Истина Тогда
				РОВладИО = "Да";
			КонецЕсли;   
			
		ИначеЕсли Элемент.Ключ = "РОВладИОНет" Тогда
			
			Если Элемент.Значение = Истина Тогда
				РОВладИО = "Нет";
			КонецЕсли;  
			
		ИначеЕсли Элемент.Ключ = "П000020014000" Тогда
			
			П000020014000 = Элемент.Значение;     
			
		ИначеЕсли Элемент.Ключ = "ИННРО1" Тогда
			
			ИННРО1 = Элемент.Значение;     
			
		ИначеЕсли Элемент.Ключ = "КППРО1" Тогда
			
			КППРО1 = Элемент.Значение;     
			
		ИначеЕсли Элемент.Ключ = "ИОВладРОДа" Тогда
			
			Если Элемент.Значение = Истина Тогда
				ИОВладРО = "Да";					
			КонецЕсли;  
			
		ИначеЕсли Элемент.Ключ = "ИОВладРОНет" Тогда
			
			Если Элемент.Значение = Истина Тогда
				ИОВладРО = "Нет";					
			КонецЕсли; 
			
		ИначеЕсли Элемент.Ключ = "П000020018000" Тогда
			
			П000020018000 = Элемент.Значение;     
			
		ИначеЕсли Элемент.Ключ = "ИННРО2" Тогда
			
			ИННРО2 = Элемент.Значение;     
			
		ИначеЕсли Элемент.Ключ = "КППРО2" Тогда
			
			КППРО2 = Элемент.Значение;  
			
		ИначеЕсли Элемент.Ключ = "СделкисАссЛицДа" Тогда
			
			Если Элемент.Значение = Истина Тогда
				СделкисАссЛиц = "Да";					
			КонецЕсли;  
			
		ИначеЕсли Элемент.Ключ = "СделкисАссЛицНет" Тогда
			
			Если Элемент.Значение = Истина Тогда
				СделкисАссЛиц = "Нет";					
			КонецЕсли;  
			
		КонецЕсли;   
		
	КонецЦикла;
	
КонецПроцедуры

#Область G

&НаКлиенте
Процедура ТаблицаGП000020012002НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьВыборВидаДеятельности();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаGП000020012003НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьВыборВидаДеятельности();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораВидаДеятельностиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ТаблицаG.ТекущиеДанные.П000020012002 = Результат.Название;
	Элементы.ТаблицаG.ТекущиеДанные.П000020012003 = Результат.Код;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборВидаДеятельности()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          "Выбор вида деятельности");
	ПараметрыФормы.Вставить("ТаблицаЗначений",    мВидыДеятельности);
	ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура("Код", Элементы.ТаблицаG.ТекущиеДанные.П000020012003)); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораВидаДеятельностиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ОбщиеОбъектыРегламентированнойОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПоказателиИзМакета()
	
	МакетСоставаПоказателей = Отчеты["РегламентированныйОтчетПрибыльИностраннойОрганизации"].ПолучитьМакет("Списки2014Кв1");

	ТекОбласть = МакетСоставаПоказателей.Области.Найти("ВидыДеятельности");

	Если ТекОбласть <> Неопределено Тогда	

		Для Ном = ТекОбласть.Верх По ТекОбласть.Низ Цикл
			
			// Перебираем строки макета.
			КодПоказателя = СокрП(МакетСоставаПоказателей.Область(Ном, 1).Текст);
			Название = СокрП(МакетСоставаПоказателей.Область(Ном, 2).Текст);
			
			Если КодПоказателя = "###" Тогда
				
				Прервать;
			Иначе
				
				НовСтрока = мВидыДеятельности.Добавить();
				НовСтрока.Код = КодПоказателя;
				НовСтрока.Название = Название;
				
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти