
&НаКлиенте
Процедура ShowFilters(Команда)
	
	Элементы.ShowFilters.Пометка = НЕ Элементы.ShowFilters.Пометка;
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Элементы.ShowFilters.Пометка;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отсчет();
	
	ПодключитьОбработчикОжидания("Отсчет", 60);
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	Результат.ПоказатьУровеньГруппировокСтрок(0);
	
КонецПроцедуры

&НаКлиенте
Процедура Отсчет()
	
	MinutesRemaining = MinutesRemaining - 1;
	Если MinutesRemaining = 0 Тогда
		ЭтаФорма.СкомпоноватьРезультат();
	КонецЕсли;

	MinutesRemaining = 60;
	
КонецПроцедуры