
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Получим сумму доп. расходов
	СуммаДопРасходов = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДетализацияПоРОСостав.СуммаБезНДС КАК СуммаБезНДС
	|ИЗ
	|	Документ.ДетализацияПоРО.Состав КАК ДетализацияПоРОСостав
	|ГДЕ
	|	ДетализацияПоРОСостав.Ссылка = &Ссылка
	|	И ДетализацияПоРОСостав.ДопРасходы = ИСТИНА
	|ИТОГИ
	|	СУММА(СуммаБезНДС)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
	    ВыборкаОбщийИтог = Результат.Выбрать();
		ВыборкаОбщийИтог.Следующий();
		СуммаДопРасходов = ВыборкаОбщийИтог.СуммаБезНДС;
	КонецЕсли; 
	
	Если СуммаДопРасходов = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Если СуммаДопРасходов = Состав.Итог("СуммаБезНДС") Тогда
	    Сообщить("Документ не может содержать только доп. расходы");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Если НЕ Результат.Пустой() Тогда
	    ВыборкаОбщийИтог = Результат.Выбрать();
		ВыборкаОбщийИтог.Следующий();
		СуммаОборудования = ВыборкаОбщийИтог.СуммаБезНДС;
	КонецЕсли; 
	
	// регистр ДопРасходыПоPO Приход
	Движение = Движения.ДопРасходыПоPO.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.PO = РО;
	Движение.Сумма = Состав.Итог("СуммаБезНДС") - СуммаДопРасходов;
	Движение.СуммаДопРасходы = СуммаДопРасходов;
		
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
