// { RGS MYurkevich 03.02.2015 14:50:45 - TP-00000694
&НаКлиенте
Процедура РегистрНакопленияНаборЗаписейPOПриИзменении(Элемент)
	ТД = Элементы.НаборЗаписей.ТекущиеДанные;
	ТД.РучнаяКорректировка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РегистрНакопленияНаборЗаписейПоставщикПриИзменении(Элемент)
	ТД = Элементы.НаборЗаписей.ТекущиеДанные;
	ТД.РучнаяКорректировка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РегистрНакопленияНаборЗаписейСебестоимостьПриИзменении(Элемент)
	ТД = Элементы.НаборЗаписей.ТекущиеДанные;
	ТД.РучнаяКорректировка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РегистрНакопленияНаборЗаписейСтоимостьПродажиПриИзменении(Элемент)
	ТД = Элементы.НаборЗаписей.ТекущиеДанные;
	ТД.РучнаяКорректировка = Истина;
КонецПроцедуры
// } RGS MYurkevich 03.02.2015 14:51:07 - TP-00000694