
&НаКлиенте
Процедура ОК(Команда)
	
	Если ИмяСобытия = "ЗавершениеВопроса" Тогда
		Оповестить("ВопросОкЗавершение", ГУИДВопроса, ЭтаФорма);
		Закрыть();
	ИначеЕсли ИмяСобытия = "ЗавершениеВопросаИзДобавленияСообщения" Тогда
		Оповестить("ЗавершениеВопросаИзДобавленияСообщения", ГУИДВопроса, ЭтаФорма);
	Иначе
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗакрыватьПриЗакрытииВладельца = Истина;
	Если РежимВопроса = "ОкОтмена" Тогда
		Элементы.ГруппаСтраницыКнопок.ТекущаяСтраница = Элементы.ГруппаСтраницаОкОтмена;
	Иначе
		Элементы.ГруппаСтраницыКнопок.ТекущаяСтраница = Элементы.ГруппаСтраницаДаНет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Да(Команда)
	
	Если ИмяСобытия = "ЗаменитьПрисоединенныйФайл" Тогда
		Оповестить("ЗаменитьПрисоединенныйФайл", ГУИДФайла, ЭтаФорма);
	ИначеЕсли ИмяСобытия = "ЗаменитьПрисоединенныйФайл_ФормаПрикрепленныхФайлов" Тогда
		Оповестить("ЗаменитьПрисоединенныйФайл_ФормаПрикрепленныхФайлов", ГУИДФайла, ЭтаФорма);
	ИначеЕсли ИмяСобытия = "ПометкаУдаленияНаФайл" Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ГУИДФайла",ГУИДФайла);
		СтруктураВозврата.Вставить("ПометкаУдаленияФайла",ПометкаУдаления);
		Оповестить("ПометкаУдаленияНаФайл", СтруктураВозврата, ЭтаФорма);
	ИначеЕсли ИмяСобытия = "ПометкаУдаленияНаФайл_ФормаПрикрепленныхФайлов" Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ГУИДФайла",ГУИДФайла);
		СтруктураВозврата.Вставить("ПометкаУдаленияФайла",ПометкаУдаления);
		Оповестить("ПометкаУдаленияНаФайл_ФормаПрикрепленныхФайлов", СтруктураВозврата, ЭтаФорма);
	ИначеЕсли ИмяСобытия = "ПроверкаОрфографииЗаменитьВсе" Тогда
		Оповестить("ПроверкаОрфографииЗаменитьВсе", , ЭтаФорма);
	ИначеЕсли ИмяСобытия  = "ЗакрытиеПомощника" Тогда
		Оповестить("ЗакрытиеПомощникаДа", , ЭтаФорма);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекстВопроса") Тогда
		ТекстВопроса = Параметры.ТекстВопроса;
	КонецЕсли;
	Если Параметры.Свойство("ИмяСобытия") Тогда
		ИмяСобытия = Параметры.ИмяСобытия;
	КонецЕсли;
	Если Параметры.Свойство("ГУИДВопроса") Тогда
		ГУИДВопроса = Параметры.ГУИДВопроса;
	КонецЕсли;
	Если Параметры.Свойство("ГУИДФайла") Тогда
		ГУИДФайла = Параметры.ГУИДФайла;
	КонецЕсли;
	Если Параметры.Свойство("ГУИДФайла") Тогда
		ГУИДФайла = Параметры.ГУИДФайла;
	КонецЕсли;
	Если Параметры.Свойство("РежимВопроса") Тогда
		РежимВопроса = Параметры.РежимВопроса;
	КонецЕсли;
	
	// { RGS Лунякин Иван 27.10.2015 12:51:08 
	Администратор 		= Параметры.Администратор;
	// } RGS Лунякин Иван 27.10.2015 12:51:08
	
	// { RGS Лунякин Иван 03.11.2015 16:29:30 
	ПолучитьНастройкиФормы();
	// } RGS Лунякин Иван 03.11.2015 16:29:30
	
КонецПроцедуры

// { RGS Лунякин Иван 03.11.2015 16:26:16

&НаСервере
Процедура ПолучитьНастройкиФормы()

	СтруктураНастроекФормы = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "НастройкаФорм");
	Если СтруктураНастроекФормы <> Неопределено Тогда
	   ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы + "/НастройкиФормы",,СтруктураНастроекФормы);
	КонецЕсли;
	СтруктураНастроекОкна = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "НастройкаОкна");
	Если СтруктураНастроекФормы <> Неопределено Тогда
	   ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы + "/НастройкиОкна",,СтруктураНастроекОкна);
	КонецЕсли;

КонецПроцедуры

// } RGS Лунякин Иван 03.11.2015 16:26:16