// { RGS MYurkevich 11.02.2015 14:25:13 - RCA-0000030
Перем мУдалятьДвижения;
// } RGS MYurkevich 11.02.2015 14:25:35 - RCA-0000030

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// { RGS MYurkevich 11.02.2015 14:25:13 - RCA-0000030
	мУдалятьДвижения = НЕ ЭтоНовый();
	// } RGS MYurkevich 11.02.2015 14:25:35 - RCA-0000030
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Комментарий = "Переоценка регистра Взаиморасчетов с покупателями и курсовых разниц за "+Формат(Дата,"ДФ='MMMM yyyy'");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// { RGS MYurkevich 11.02.2015 14:25:13 - RCA-0000030
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	КонецЕсли;
	КурсовыеРазницы = Движения.КурсовыеРазницыAPAR;
	Если КурсовыеРазницыAR Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.ДоговорКонтрагента,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.ПодразделениеОрганизации,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.СчетНаПредоплату,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.КостЦентр,
		// { RGS MYurkevich 11.02.2016 12:36:52 - SLICR000761
		//|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.ИнвойсинговыйЦентр,
		// } RGS MYurkevich 11.02.2016 12:36:53 - 
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.WO,
		|	МАКСИМУМ(ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовРасход) КАК СуммаВзаиморасчетовРасход,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Период,
		|	МАКСИМУМ(ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаРеглРасход) КАК СуммаРеглРасход,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.КурсВзаиморасчетов ЕСТЬ НЕ NULL 
		|				ТОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.КурсВзаиморасчетов
		|			ИНАЧЕ КурсыВалют.Курс
		|		КОНЕЦ) КАК Курс,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Регистратор
		|ПОМЕСТИТЬ РасходыЗаМесяц
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Запись,
		|			,
		|			ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
		|				ИЛИ ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл) КАК ВзаиморасчетыСПокупателямиОстаткиИОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка.ВалютаДокумента = КурсыВалют.Валюта
		|			И (ВЫБОР
		|				КОГДА ВзаиморасчетыСПокупателямиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|					ТОГДА НАЧАЛОПЕРИОДА(ВзаиморасчетыСПокупателямиОстаткиИОбороты.Регистратор.ValueDate, ДЕНЬ) = КурсыВалют.Период
		|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВзаиморасчетыСПокупателямиОстаткиИОбороты.Период, ДЕНЬ) = КурсыВалют.Период
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
		|		ПО (ВЫБОР
		|				КОГДА ВзаиморасчетыСПокупателямиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|					ТОГДА ВзаиморасчетыСПокупателямиОстаткиИОбороты.Регистратор = ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка
		|							И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка = ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовРасход <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.ДоговорКонтрагента,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.ПодразделениеОрганизации,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.СчетНаПредоплату,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.КостЦентр,
		//|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.ИнвойсинговыйЦентр,// { RGS MYurkevich 11.02.2016 12:36:52 - SLICR000761
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.WO,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Период,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасходыЗаМесяц.Период,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка КАК ДокументРасчетов,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.КостЦентр КАК AU,
		|	СУММА(ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток * РасходыЗаМесяц.Курс - ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаРеглКонечныйОстаток) КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.МодулиРазработки.SalesBook) КАК Модуль,
		|	РасходыЗаМесяц.Регистратор КАК ПлатежныйДокумент
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			,
		|			Запись,
		|			,
		|			ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
		|				И НЕ ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
		|				И Сделка <> НЕОПРЕДЕЛЕНО
		|				И Сделка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК ВзаиморасчетыСПокупателямиОстаткиИОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыЗаМесяц КАК РасходыЗаМесяц
		|		ПО ВзаиморасчетыСПокупателямиОстаткиИОбороты.ДоговорКонтрагента = РасходыЗаМесяц.ДоговорКонтрагента
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.ПодразделениеОрганизации = РасходыЗаМесяц.ПодразделениеОрганизации
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка = РасходыЗаМесяц.Сделка
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.СчетНаПредоплату = РасходыЗаМесяц.СчетНаПредоплату
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.КостЦентр = РасходыЗаМесяц.КостЦентр
		//|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.ИнвойсинговыйЦентр = РасходыЗаМесяц.ИнвойсинговыйЦентр // { RGS MYurkevich 11.02.2016 12:36:52 - SLICR000761
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.WO = РасходыЗаМесяц.WO
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.Период <= РасходыЗаМесяц.Период
		|ГДЕ
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток <> 0
		|	И ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаРеглРасход = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходыЗаМесяц.Период,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.КостЦентр,
		|	РасходыЗаМесяц.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасходыЗаМесяц.Период,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.КостЦентр,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка.Дата >= &Дата2015
		|				И НАЧАЛОПЕРИОДА(РасходыЗаМесяц.Период, МЕСЯЦ) <> НАЧАЛОПЕРИОДА(ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка.Дата, МЕСЯЦ)
		|			ТОГДА РасходыЗаМесяц.СуммаВзаиморасчетовРасход * (РасходыЗаМесяц.Курс - КурсыВалютСрезПоследних.Курс)
		|		ИНАЧЕ РасходыЗаМесяц.СуммаВзаиморасчетовРасход * (РасходыЗаМесяц.Курс - КурсыВалют.Курс)
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Перечисление.МодулиРазработки.SalesBook),
		|	РасходыЗаМесяц.Регистратор
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			,
		|			Запись,
		|			,
		|			Сделка.ВалютаДокумента <> &ВалютаРегл
		|				И ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
		|				И Сделка <> НЕОПРЕДЕЛЕНО
		|				И Сделка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК ВзаиморасчетыСПокупателямиОстаткиИОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыЗаМесяц КАК РасходыЗаМесяц
		|		ПО ВзаиморасчетыСПокупателямиОстаткиИОбороты.ДоговорКонтрагента = РасходыЗаМесяц.ДоговорКонтрагента
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.ПодразделениеОрганизации = РасходыЗаМесяц.ПодразделениеОрганизации
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка = РасходыЗаМесяц.Сделка
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.СчетНаПредоплату = РасходыЗаМесяц.СчетНаПредоплату
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.КостЦентр = РасходыЗаМесяц.КостЦентр
		//|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.ИнвойсинговыйЦентр = РасходыЗаМесяц.ИнвойсинговыйЦентр // { RGS MYurkevich 11.02.2016 12:36:52 - SLICR000761
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.WO = РасходыЗаМесяц.WO
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.Период <= РасходыЗаМесяц.Период
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (НАЧАЛОПЕРИОДА(ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка.Дата, ДЕНЬ) = КурсыВалют.Период)
		|			И ВзаиморасчетыСПокупателямиОстаткиИОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыВалют.Валюта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПрошлогоМесяца, ) КАК КурсыВалютСрезПоследних
		|		ПО ВзаиморасчетыСПокупателямиОстаткиИОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток <> 0
		|	И ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаРеглРасход = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&КонецПериода,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.КостЦентр,
		|	СУММА(ВЫБОР
		|			КОГДА ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток <> ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка.СуммаДокумента
		|					ИЛИ НАЧАЛОПЕРИОДА(ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка.Дата, МЕСЯЦ) = &НачалоПериода
		|				ТОГДА ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток * КурсыВалютСрезПоследних.Курс - ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаРеглКонечныйОстаток
		|			ИНАЧЕ ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка.СуммаДокумента * (КурсыВалютСрезПоследних.Курс - КурсыВалютСрезПоследних1.Курс)
		|		КОНЕЦ),
		|	ЗНАЧЕНИЕ(Перечисление.МодулиРазработки.SalesBook),
		|	""""
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			,
		|			(Сделка.Дата >= &Дата2015
		|					И ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
		|				ИЛИ ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
		|					И НЕ ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
		|					И Сделка <> НЕОПРЕДЕЛЕНО)
		|				И НЕ Сделка В
		|						(ВЫБРАТЬ
		|							РасходыЗаМесяц.Сделка
		|						ИЗ
		|							РасходыЗаМесяц КАК РасходыЗаМесяц)) КАК ВзаиморасчетыСПокупателямиОстаткиИОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсыВалютСрезПоследних
		|		ПО ВзаиморасчетыСПокупателямиОстаткиИОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыВалютСрезПоследних.Валюта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПрошлогоМесяца, ) КАК КурсыВалютСрезПоследних1
		|		ПО ВзаиморасчетыСПокупателямиОстаткиИОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыВалютСрезПоследних1.Валюта
		|ГДЕ
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток > 0
		|	И ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка.СуммаДокумента * (КурсыВалютСрезПоследних.Курс - КурсыВалютСрезПоследних1.Курс) <> 0
		|	И НАЧАЛОПЕРИОДА(ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка.Дата, ДЕНЬ) <> НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.КостЦентр,
		|	КурсыВалютСрезПоследних.Курс,
		|	КурсыВалютСрезПоследних1.Курс
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&КонецПериода,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка,
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.КостЦентр,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка.Дата, МЕСЯЦ) = &НачалоПериода
		|			ТОГДА ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток * КурсыВалютСрезПоследних.Курс - ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаРеглКонечныйОстаток
		|		ИНАЧЕ ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток * (КурсыВалютСрезПоследних.Курс - КурсыВалютСрезПоследних1.Курс)
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Перечисление.МодулиРазработки.SalesBook),
		|	""""
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			,
		|			(Сделка.Дата >= &Дата2015
		|					И ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
		|				ИЛИ ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
		|					И НЕ ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
		|					И Сделка <> НЕОПРЕДЕЛЕНО)
		|				И Сделка В
		|					(ВЫБРАТЬ
		|						РасходыЗаМесяц.Сделка
		|					ИЗ
		|						РасходыЗаМесяц КАК РасходыЗаМесяц)) КАК ВзаиморасчетыСПокупателямиОстаткиИОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсыВалютСрезПоследних
		|		ПО ВзаиморасчетыСПокупателямиОстаткиИОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыВалютСрезПоследних.Валюта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПрошлогоМесяца, ) КАК КурсыВалютСрезПоследних1
		|		ПО ВзаиморасчетыСПокупателямиОстаткиИОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыВалютСрезПоследних1.Валюта
		|ГДЕ
		|	ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток > 0
		|	И НАЧАЛОПЕРИОДА(ВзаиморасчетыСПокупателямиОстаткиИОбороты.Сделка.Дата, ДЕНЬ) <> НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
		|	И ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток * КурсыВалютСрезПоследних.Курс - ВзаиморасчетыСПокупателямиОстаткиИОбороты.СуммаРеглКонечныйОстаток <> 0";
		
		Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
		Запрос.УстановитьПараметр("Дата2015", '20150101');
		Запрос.УстановитьПараметр("КонецПрошлогоМесяца", НачалоМесяца(Ссылка.Дата)-1);
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Ссылка.Дата));
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Ссылка.Дата));
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		КурсовыеРазницы.Загрузить(РезультатЗапроса);
	КонецЕсли;
	
	Если КурсовыеРазницыAP Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты.Ваучер,
		|	СУММА(НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты.СуммаРасход) КАК Оплата,
		|	МИНИМУМ(НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты.Период) КАК ПериодОплаты,
		|	МАКСИМУМ(НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты.Валюта) КАК ВалютаОплаты,
		|	НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты.Регистратор КАК ПлатежныйДокумент
		|ПОМЕСТИТЬ Ваучеры
		|ИЗ
		|	РегистрНакопления.НеоплаченныеОстаткиПоВаучерам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Запись, , Валюта <> &Руб) КАК НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты
		|ГДЕ
		|	НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты.СуммаНачальныйОстаток <> 0
		|	И НЕ(НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты.СуммаРасход <> 0
		|				И НАЧАЛОПЕРИОДА(НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты.Период, МЕСЯЦ) <> &НачалоПериода)
		|	И НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты.СуммаРасход <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты.Ваучер,
		|	НеоплаченныеОстаткиПоВаучерамОстаткиИОбороты.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеоплаченныеОстаткиПоВаучерамОстатки.Ваучер
		|ПОМЕСТИТЬ ВаучерыОстаток
		|ИЗ
		|	РегистрНакопления.НеоплаченныеОстаткиПоВаучерам.Остатки(&КонецПериода, Валюта <> &Руб) КАК НеоплаченныеОстаткиПоВаучерамОстатки
		|ГДЕ
		|	НеоплаченныеОстаткиПоВаучерамОстатки.СуммаОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетКнигиПокупок.Ссылка КАК ДокументРасчетов,
		|	СчетКнигиПокупок.ПроводкаDSS.AU КАК AU,
		|	СчетКнигиПокупок.СуммаДокументаСНДС КАК СуммаДокумента,
		|	ВЫБОР
		|		КОГДА СчетКнигиПокупок.ДатаПроведения >= &Дата2015
		|			ТОГДА СчетКнигиПокупок.КурсДокумента
		|		ИНАЧЕ КурсыВалютСрезНаНачало2015.Курс
		|	КОНЕЦ КАК КурсДокумента,
		|	Ваучеры.Оплата,
		|	Ваучеры.ПериодОплаты,
		|	Ваучеры.ВалютаОплаты,
		|	КурсыВалютСрезНаКонецПериода.Курс КАК КурсНаКонецПериода,
		|	КурсыВалютСрезНаПредМесяц.Курс КАК КурсНаПредыдущийМесяц,
		|	СчетКнигиПокупок.ДатаПроведения,
		|	ЕСТЬNULL(КурсовыеРазницыAPARОбороты.СуммаОборот, 0) КАК ОборотПоРазнице,
		|	ЗНАЧЕНИЕ(Перечисление.МодулиРазработки.PurchaseBook) КАК Модуль,
		|	Ваучеры.ПлатежныйДокумент
		|ИЗ
		|	Документ.СчетКнигиПокупок КАК СчетКнигиПокупок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ваучеры КАК Ваучеры
		|		ПО СчетКнигиПокупок.Ваучер = Ваучеры.Ваучер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата2014, ) КАК КурсыВалютСрезНаНачало2015
		|		ПО СчетКнигиПокупок.ВалютаДокумента = КурсыВалютСрезНаНачало2015.Валюта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПрошлогоМесяца, ) КАК КурсыВалютСрезНаПредМесяц
		|		ПО СчетКнигиПокупок.ВалютаДокумента = КурсыВалютСрезНаПредМесяц.Валюта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсыВалютСрезНаКонецПериода
		|		ПО СчетКнигиПокупок.ВалютаДокумента = КурсыВалютСрезНаКонецПериода.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КурсовыеРазницыAPAR.Обороты(&НачалоПериода, &КонецПериода, , ) КАК КурсовыеРазницыAPARОбороты
		|		ПО (КурсовыеРазницыAPARОбороты.ДокументРасчетов = СчетКнигиПокупок.Ссылка)
		|ГДЕ
		|	СчетКнигиПокупок.СуммаРубСНДС = 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СчетКнигиПокупок.Ссылка,
		|	СчетКнигиПокупок.ПроводкаDSS.AU,
		|	СчетКнигиПокупок.СуммаДокументаСНДС,
		|	ВЫБОР
		|		КОГДА СчетКнигиПокупок.ДатаПроведения >= &Дата2015
		|			ТОГДА СчетКнигиПокупок.КурсДокумента
		|		ИНАЧЕ КурсыВалютСрезНаНачало2015.Курс
		|	КОНЕЦ,
		|	0,
		|	"""",
		|	"""",
		|	КурсыВалютСрезНаКонецПериода.Курс,
		|	КурсыВалютСрезНаПредМесяц.Курс,
		|	СчетКнигиПокупок.ДатаПроведения,
		|	0,
		|	ЗНАЧЕНИЕ(Перечисление.МодулиРазработки.PurchaseBook),
		|	NULL
		|ИЗ
		|	Документ.СчетКнигиПокупок КАК СчетКнигиПокупок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВаучерыОстаток КАК ВаучерыОстаток
		|		ПО СчетКнигиПокупок.Ваучер = ВаучерыОстаток.Ваучер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата2014, ) КАК КурсыВалютСрезНаНачало2015
		|		ПО СчетКнигиПокупок.ВалютаДокумента = КурсыВалютСрезНаНачало2015.Валюта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПрошлогоМесяца, ) КАК КурсыВалютСрезНаПредМесяц
		|		ПО СчетКнигиПокупок.ВалютаДокумента = КурсыВалютСрезНаПредМесяц.Валюта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсыВалютСрезНаКонецПериода
		|		ПО СчетКнигиПокупок.ВалютаДокумента = КурсыВалютСрезНаКонецПериода.Валюта
		|ГДЕ
		|	СчетКнигиПокупок.СуммаРубСНДС = 0";
		
		Запрос.УстановитьПараметр("Дата2015", '20150101');
		Запрос.УстановитьПараметр("Дата2014", '20141231');
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПрошлогоМесяца", НачалоМесяца(Дата)-1);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("Руб", Справочники.Валюты.НайтиПоКоду("643"));
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ДокументРасчетов <> Неопределено Тогда
				Запись = КурсовыеРазницы.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Если Выборка.Оплата <> 0 Тогда
					СтркутураКурс = ОбщегоНазначения.ПолучитьКурсВалюты(Выборка.ВалютаОплаты, Выборка.ПериодОплаты);
					КурсНаДатуОплаты = СтркутураКурс.Курс;
					Разница = КурсНаДатуОплаты - ?(НачалоМесяца(Выборка.ДатаПроведения) = НачалоМесяца(Дата), Выборка.КурсДокумента, Выборка.КурсНаПредыдущийМесяц);
				Иначе 
					Разница = Выборка.КурсНаКонецПериода - ?(НачалоМесяца(Выборка.ДатаПроведения) = НачалоМесяца(Дата), Выборка.КурсДокумента, Выборка.КурсНаПредыдущийМесяц);
				КонецЕсли;	 
				РазницаДляРегистра = ?(Выборка.ОборотПоРазнице = 0, Разница, -(Выборка.ОборотПоРазнице/Выборка.СуммаДокумента - Разница));
				Запись.Сумма = Выборка.СуммаДокумента * РазницаДляРегистра;
				Запись.Период = НачалоМесяца(Дата);
				Если Выборка.Оплата = 0 Тогда
					ЗаписьОтр = КурсовыеРазницы.Добавить();
					ЗаполнитьЗначенияСвойств(ЗаписьОтр, Выборка);
					ЗаписьОтр.Сумма = - Выборка.СуммаДокумента * РазницаДляРегистра;
					ЗаписьОтр.Период = КонецМесяца(Дата) + 1;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	КУдалению = Новый Массив();
	Для Каждого Движение Из Движения.КурсовыеРазницыAPAR Цикл
		Если Движение.ДокументРасчетов = Неопределено Тогда
			 КУдалению.Добавить(Движение);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Эл Из КУдалению Цикл
		Движения.КурсовыеРазницыAPAR.Удалить(Эл);
	КонецЦикла;	
	КурсовыеРазницы.Записать();
	
	Если ПереоценкаВалютыВРегистре Тогда
		// } RGS MYurkevich 11.02.2015 14:25:35 - RCA-0000030
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВложенныйЗапрос.ДоговорКонтрагента,
		|	ВложенныйЗапрос.ПодразделениеОрганизации,
		|	ВложенныйЗапрос.Сделка,
		|	ВложенныйЗапрос.СчетНаПредоплату,
		|	ВложенныйЗапрос.КостЦентр,
		//|	ВложенныйЗапрос.ИнвойсинговыйЦентр,
		|	ВложенныйЗапрос.WO,
		|	ВложенныйЗапрос.СуммаРегл КАК СуммаРегл,
		|	ВложенныйЗапрос.СуммаУпр КАК СуммаУпр
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзаиморасчетыСПокупателямиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|		ВзаиморасчетыСПокупателямиОстатки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|		ВзаиморасчетыСПокупателямиОстатки.Сделка КАК Сделка,
		|		ВзаиморасчетыСПокупателямиОстатки.СчетНаПредоплату КАК СчетНаПредоплату,
		|		ВзаиморасчетыСПокупателямиОстатки.КостЦентр КАК КостЦентр,
		//|		ВзаиморасчетыСПокупателямиОстатки.ИнвойсинговыйЦентр КАК ИнвойсинговыйЦентр,
		|		ВзаиморасчетыСПокупателямиОстатки.СуммаВзаиморасчетовОстаток * КурсыВалютСрезПоследних.Курс - ВзаиморасчетыСПокупателямиОстатки.СуммаРеглОстаток КАК СуммаРегл,
		|		ВЫБОР
		|			КОГДА ВзаиморасчетыСПокупателямиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаУпр
		|				ТОГДА ВзаиморасчетыСПокупателямиОстатки.СуммаВзаиморасчетовОстаток * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних1.Курс - ВзаиморасчетыСПокупателямиОстатки.СуммаУпрОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК СуммаУпр,
		|		ВзаиморасчетыСПокупателямиОстатки.WO КАК WO
		|	ИЗ
		|		РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
		|				&Дата,
		// { RGS MYurkevich 11.02.2015 14:25:13 - RCA-0000030
		//|				ИнвойсинговыйЦентр = &ИнвойсинговыйЦентр  И 
		// } RGS MYurkevich 11.02.2015 14:25:35 - RCA-0000030
		// добавила Петроченко Наталья 15.02.13
		|					ДоговорКонтрагента.Курс = 0
		|				) КАК ВзаиморасчетыСПокупателямиОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
		|			ПО ВзаиморасчетыСПокупателямиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыВалютСрезПоследних.Валюта
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаУпр) КАК КурсыВалютСрезПоследних1
		|			ПО (КурсыВалютСрезПоследних1.Валюта = &ВалютаУпр)
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА ВзаиморасчетыСПокупателямиОстатки.Сделка ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|					ТОГДА ВзаиморасчетыСПокупателямиОстатки.СуммаВзаиморасчетовОстаток = 0
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ) КАК ВложенныйЗапрос
		|ГДЕ
		|	(ВложенныйЗапрос.СуммаРегл <> 0
		|			ИЛИ ВложенныйЗапрос.СуммаУпр <> 0)
		// { RGS MYurkevich 11.02.2015 14:25:13 - RCA-0000030
		| И ВложенныйЗапрос.Сделка <> Неопределено");
		// } RGS MYurkevich 11.02.2015 14:25:35 - RCA-0000030
       
		
		
		Запрос.УстановитьПараметр("Дата",КонецМесяца(Дата));
		// { RGS MYurkevich 11.02.2015 14:25:13 - RCA-0000030
		//Запрос.УстановитьПараметр("ИнвойсинговыйЦентр", ИнвойсинговыйЦентр);
		// } RGS MYurkevich 11.02.2015 14:25:35 - RCA-0000030
		Запрос.УстановитьПараметр("ВалютаУпр",Справочники.Валюты.НайтиПоНаименованию("USD"));
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		Если ТаблицаОстатков.Количество()>0 Тогда
			ТаблицаДвиженияВзаиморасчетов = Движения.ВзаиморасчетыСПокупателями.Выгрузить();
			
			Движения.ВзаиморасчетыСПокупателями.мПериод = Дата;
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаОстатков,ТаблицаДвиженияВзаиморасчетов);
			ТаблицаДвиженияВзаиморасчетов.ЗаполнитьЗначения(Ссылка, "Регистратор");
			Движения.ВзаиморасчетыСПокупателями.мПериод          = Дата;
			Движения.ВзаиморасчетыСПокупателями.мТаблицаДвижений = ТаблицаДвиженияВзаиморасчетов;
			Движения.ВзаиморасчетыСПокупателями.ВыполнитьПриход();
			Движения.ВзаиморасчетыСПокупателями.Записать();
		КонецЕсли;
		
		//Добавление РГ-Софт - Пронин Иван
		//Исправил РГ-Софт - Иванов Антон - 2009-09-02
		ВалютаРегламентированногоУчета = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета;
		
		ДвиженияПоСчетамДС = Движения.СчетаДенежныхСредств;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СчетаДенежныхСредствОстатки.БанковскийСчет,
		|	СчетаДенежныхСредствОстатки.Валюта,
		|	СчетаДенежныхСредствОстатки.СуммаОстаток КАК Сумма,
		|	СчетаДенежныхСредствОстатки.СуммаВалОстаток КАК ВалютнаяСумма
		|ИЗ
		|	РегистрНакопления.СчетаДенежныхСредств.Остатки(&Дата) КАК СчетаДенежныхСредствОстатки";
		
		Запрос.УстановитьПараметр("Дата", Новый Граница(КонецДня(СтруктураШапкиДокумента.Дата), ВидГраницы.Включая));
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			ДанныеОВалюте = ОбщегоНазначения.ПолучитьКурсВалюты(Выборка.Валюта, СтруктураШапкиДокумента.Дата);
			РасчетныйОстатокВалРегУчета = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.ВалютнаяСумма, Выборка.Валюта, ВалютаРегламентированногоУчета, ДанныеОВалюте.Курс, 1,ДанныеОВалюте.Кратность,1);
			
			Если РасчетныйОстатокВалРегУчета = Выборка.Сумма Тогда
				Продолжить;
			КонецЕсли;
			
			Если РасчетныйОстатокВалРегУчета > Выборка.Сумма Тогда
				Движение = ДвиженияПоСчетамДС.ДобавитьПриход();	
				Движение.Сумма = РасчетныйОстатокВалРегУчета - Выборка.Сумма;
			ИначеЕсли РасчетныйОстатокВалРегУчета < Выборка.Сумма Тогда
				Движение = ДвиженияПоСчетамДС.ДобавитьРасход();
				Движение.Сумма = Выборка.Сумма - РасчетныйОстатокВалРегУчета;				
			КонецЕсли;
			
			Движение.Период = СтруктураШапкиДокумента.Дата;
			Движение.БанковскийСчет = Выборка.БанковскийСчет;
			Движение.Валюта = Выборка.Валюта;
			
		КонецЦикла;
		//Конец добавления
		// { RGS MYurkevich 11.02.2015 14:25:13 - RCA-0000030
	КонецЕсли;
	// } RGS MYurkevich 11.02.2015 14:25:35 - RCA-0000030		
КонецПроцедуры


