
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеСервиса = ПолучитьОбщийМакет("ИнструкцияПоПроверкеКонтрагентов").ПолучитьТекст();

КонецПроцедуры

&НаКлиенте
Процедура ОписаниеСервисаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если СтрНайти(ДанныеСобытия.Href, "#Администирование") > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ПроверкаКонтрагентовКлиент.ОткрытьНастройкиСервиса();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти