                 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗапуститьПроцессУтвержденияНаСервере(ПараметрКоманды) Тогда 
		
		ПараметрыФормы = Новый Структура("Корректировка", ПараметрКоманды);
		
		ЗапускУтверждения = ОткрытьФормуМодально("ОбщаяФорма.ФормаЗапросаУтвержденияУправляемая", 
													ПараметрыФормы, 
													ПараметрыВыполненияКоманды.Источник);
		
		Если ЗапускУтверждения = Истина Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Запуск процесса утверждения документа """ + ПараметрКоманды + """ был успешно выполнен.");
		КонецЕсли;
		
	КонецЕсли;
	
	Оповестить("ЗапускПроцессаУтверждения", ПараметрКоманды);
	
КонецПроцедуры
	
&НаСервере
Функция ЗапуститьПроцессУтвержденияНаСервере(ПараметрКоманды)

	ДокументОбъект = ПараметрКоманды.ПолучитьОбъект();
		
	ДополнительныеСвойства = ДокументОбъект.ДополнительныеСвойства;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ПередачаОС") Тогда 
		ДополнительныеСвойства.Вставить("ЭтоУтверждение", Истина);
	КонецЕсли;
	
	// Проведем документ со специальным дополнительным свойством
	ДополнительныеСвойства.Вставить("ЭтоПробноеПроведениеПередЗапускомПроцессаУтверждения", Истина);	
	
	//Изменила Федотова Л., РГ-Софт, 30.01.13, вопрос SLI-0003260	
	//ПровестиДокумент(ДокументОбъект, РежимЗаписиДокумента.Проведение); 
	ДокументПроводится = ПровестиДокумент(ДокументОбъект, РежимЗаписиДокумента.Проведение); 
	
	//добавила Федотова Л., РГ-Софт, 30.01.13, вопрос SLI-0003260 ->	
	Если НЕ ДокументПроводится Тогда
		Сообщить("Ошибка при проверке возможности проведения документа");
	КонецЕсли; 
	//<-
	ДополнительныеСвойства.Удалить("ЭтоПробноеПроведениеПередЗапускомПроцессаУтверждения"); 
	
	// Если предварительное проведение завершилось успешно - можно записать документ,
	// 	чтобы нивелировать вызванное исключением модифицированность
	ПроверкиПередЗапускомПроцессаУтвержденияПройдены = Ложь;
	Если ДополнительныеСвойства.Свойство("ПроверкиПередЗапускомПроцессаУтвержденияПройдены", ПроверкиПередЗапускомПроцессаУтвержденияПройдены) Тогда
		
		Если ПроверкиПередЗапускомПроцессаУтвержденияПройдены Тогда
			ПровестиДокумент(ДокументОбъект, РежимЗаписиДокумента.Запись); 
		КонецЕсли;
		ДополнительныеСвойства.Удалить("ПроверкиПередЗапускомПроцессаУтвержденияПройдены");
		
		Возврат ПроверкиПередЗапускомПроцессаУтвержденияПройдены;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции 

&НаСервере
Функция ПровестиДокумент(ДокументОбъект, РежимЗаписиДокумента)
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции


