
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ВидОперацииКредитНота(ПараметрКоманды) Тогда
				
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг", "АктМосква", ПараметрКоманды,
											ПараметрыВыполненияКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВидОперацииКредитНота(Док)
	
	Если Док.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ВнутренняяКредитНота ИЛИ
		Док.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.КредитНотаСторно Тогда
		Возврат Истина;
	иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не является кредит-нотой!");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
