
// В этом модуле дублируются функции из других модулей, чтобы обеспечить повторное использование возвращаемых значений 

Функция ПреобразоватьЧислоВСтроку(TNVEDRateСтр) Экспорт
	
	// Преобразование Rate
	TNVEDRateЧ = NULL;
	СпецСимвол = ",";
	
	Попытка
		
		TNVEDRateЧ = Число(TNVEDRateСтр);
		
		// Обрабатываем случаи когда не удалось преобразовать в число автоматически.
	Исключение
		
		TNVEDRateС = СокрЛП(TNVEDRateСтр);
		
		Если СтрНайти(TNVEDRateС, " ") <> 0 Тогда
			
			TNVEDRateМ = СтрРазделить(TNVEDRateС, " ");
			TNVEDRateС = TNVEDRateМ[0];
			
			// Повторное преобразование
			Попытка
				TNVEDRateЧ = Число(TNVEDRateС);
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		
		
	КонецПопытки;
	
	Если TNVEDRateЧ = NULL И СтрНачинаетсяС(TNVEDRateС, СпецСимвол) Тогда
		
		TNVEDRateС = Сред(TNVEDRateС,2);
	ИначеЕсли TNVEDRateЧ = NULL И СтрЗаканчиваетсяНа(TNVEDRateС, СпецСимвол)Тогда
		
		TNVEDRateС = Лев(TNVEDRateС,СтрДлина(TNVEDRateС)-1);
	КонецЕсли;
	
	Если TNVEDRateЧ = NULL Тогда
		
		Попытка
			TNVEDRateЧ = Число(TNVEDRateС);
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат TNVEDRateЧ;
	
КонецФункции