
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Recipients", 	Recipients);
	Параметры.Свойство("Copy", 		Copy);
	Параметры.Свойство("Subject", 		Subject);
	Параметры.Свойство("Body", 			Body);
	// { RGS LKhristyuk 5/29/2018 4:39:26 PM - вопрос S-I-0005089
	Параметры.Свойство("CCANotification", CCANotification);
	// } RGS LKhristyuk 5/29/2018 4:39:30 PM - вопрос S-I-0005089 
	
	// ++ RG-Soft КДС 24.11.2016
	Параметры.Свойство("TechDOC", TechDOC);
	// -- RG-Soft КДС 24.11.2016
	
	Параметры.Свойство("DOC", DOC);
	
	// { RGS AArsentev 07.06.2018
	Если РольДоступна("ImportExportSpecialist") ИЛИ РольДоступна("ImportExportAdministrator") Тогда
		Элементы.Recipients.ТолькоПросмотр = Ложь;
	КонецЕсли;
	// } RGS AArsentev 07.06.2018
	
	Recipients.ТипЗначения = Новый ОписаниеТипов("Строка");
	
КонецПроцедуры

&НаКлиенте
Процедура Send(Команда)
	
	Индекс = 0;
	Пока Индекс < Recipients.Количество() Цикл
		
		Recipient = Recipients[Индекс];
		Recipient.Значение = СокрЛП(Recipient.Значение);
		Если ЗначениеЗаполнено(Recipient.Значение) Тогда
			Индекс = Индекс + 1;
		Иначе
			Recipients.Удалить(Индекс);
		КонецЕсли; 
		
	КонецЦикла; 
	
	Copy = СокрЛП(Copy);
	Subject = СокрЛП(Subject);
	Body = СокрЛП(Body);
	
	Отказ = Ложь;
	Если Recipients.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Recipients"" не заполнено",
			, "Recipients", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Subject) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Subject"" не заполнено",
			, "Subject", , Отказ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Body) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Body"" не заполнено",
			, "Body", , Отказ);
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Recipients", 	Recipients.ВыгрузитьЗначения());
		СтруктураВозврата.Вставить("Copy", 		Copy);
		СтруктураВозврата.Вставить("Subject", 		Subject);
		
		// { RGS AArsentev 21.06.2018
		ТелоПисьма = СокрЛП(Body);
		//ДополнитьТелоПисьмаСсылкамиНаDOC(ТелоПисьма);
		// } RGS AArsentev 21.06.2018
		
		СтруктураВозврата.Вставить("Body", 			ТелоПисьма);
		// { RGS LKhristyuk 5/29/2018 4:40:57 PM - вопрос S-I-0005089
		Если CCANotification Тогда
			СтруктураВозврата.Вставить("CCANotification", CCANotification);	
		КонецЕсли; 
		// } RGS LKhristyuk 5/29/2018 4:40:59 PM - вопрос S-I-0005089 
		
		// ++ RG-Soft КДС 24.11.2016
		СтруктураВозврата.Вставить("TechDOC", 		TechDOC);
		Успех = Истина;
		// -- RG-Soft КДС 24.11.2016
		
		ОповеститьОВыборе(СтруктураВозврата);

	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если TechDOC И НЕ Успех Тогда
		Оповестить("ОтказОтправкиЗапросаTechDOC", ЭтаФорма.ВладелецФормы);
	КонецЕсли;
	
КонецПроцедуры

