
Процедура ЗафиксироватьВремяВыполненияНаКлиенте(ВремяНачалаМс, ВремяОкончанияМс, ИмяКлючевойОперации, Объект=Неопределено) Экспорт
	
	// фиксирует времени выполнения ключевой операции, начавшейся и закончившейся на клиенте
	// ВремяНачалаМс и ВремяОкончанияМс должны быть в миллисекундах
	// ИмяКлючевойОперации передается в виде строки, чтобы не делать дополнительный вызов сервера для получения предопределенной ссылки
	
	КлючеваяОперация = ПредопределенноеЗначение("Справочник.КлючевыеОперации." + ИмяКлючевойОперации);
	ОценкаПроизводительностиРГСофт.ЗаписатьЗамерВремени(КлючеваяОперация, Объект, ВремяНачалаМс, ВремяОкончанияМс);
	
КонецПроцедуры