
&НаКлиенте
Процедура SubSegmentНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Прежде, чем выбирать саб сегмент - нужно выбрать сегмент
	Если НЕ ЗначениеЗаполнено(Объект.Segment) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Segment"" is empty!",
			, "Segment", "Объект");
			
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура SubSubSegmentНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Прежде, чем выбирать саб саб сегмент нужно выбрать саб сегмент
	Если НЕ ЗначениеЗаполнено(Объект.SubSegment) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Sub segment"" is empty!",
			, "SubSegment", "Объект");
			
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

//-> RG-Soft VIvanov 2015/02/25
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Segment.ТолькоПросмотр = Истина;
		Элементы.SubSegment.ТолькоПросмотр = Истина;
		Элементы.SubSubSegment.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Элементы.Segment.ТолькоПросмотр = Истина;
	Элементы.SubSegment.ТолькоПросмотр = Истина;
	Элементы.SubSubSegment.ТолькоПросмотр = Истина;	
	
КонецПроцедуры
//<-
