
&НаКлиенте
Процедура TRОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаполнитьПоВыбранному(ВыбранноеЗначение);
	Объект.TR = ВыбранноеЗначение;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоВыбранному(TransportRequest)
	
	Объект.Parcels.Очистить();
	
	Выборка = Документы.TR_Adjustment.ПолучитьОстатки(TransportRequest, Объект.Дата);
	
	Результат = Выборка.Выполнить();
	Если Не Результат.Пустой() Тогда
		Объект.Parcels.Загрузить(Результат.Выгрузить());
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По выбранному TR - " + TransportRequest + " нет остатков");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура TRНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Имя", "TR_Adjustment");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураНастройки", СтруктураНастройки);
	СтруктураПараметров.Вставить("РежимВыбора", Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
	ОткрытьФорму("Документ.TransportRequest.ФормаВыбора", СтруктураПараметров, Элемент, Элемент, 
		ВариантОткрытияОкна.ОтдельноеОкно, , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере()
	
	NewStage = РегистрыСведений.StagesOfTransportRequests.ПолучитьTransportRequestStage(Объект.TR);
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.StagesOfTransportRequests.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.TransportRequest = Объект.TR;
	МенеджерЗаписи.Stage = NewStage;
	МенеджерЗаписи.ModificationDate = Объект.Дата;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ParcelsNumOfParcelsПриИзменении(Элемент)
	
	ТекДанные = Элементы.Parcels.ТекущиеДанные;
	Остаток = ПолучитьОстатокПоПарселю(ТекДанные.Parcel, Объект.Ссылка);
	Если Остаток = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На текущую дату по парселю "+ ТекДанные.Parcel +" нет остатков");
		ТекДанные.NumOfParcels = 0;
	ИначеЕсли Остаток < ТекДанные.NumOfParcels Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По парселю  "+ ТекДанные.Parcel +" Невозможно списать больше чем " + Остаток);
		ТекДанные.NumOfParcels = Остаток
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстатокПоПарселю(Парсель, TR_Adj)
	
	Остаток = Документы.TR_Adjustment.ПроверитьОстатокПоПарселю(Парсель, Объект.TR, TR_Adj);
	Возврат Остаток;
	
КонецФункции




