
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивПарселей = Параметры.МассивПарселей;
	
	Для Каждого Парсель Из МассивПарселей Цикл
		
		СтрокаТаблицы = Parcels.Добавить();
		СтрокаТаблицы.Parcel = Парсель;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Парсель);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура FinishSelection(Команда)
	
	СтруктураВозврата = Новый Структура;
	//МассивВыбранныхПарселей = Parcels.Выгрузить().ВыгрузитьКолонку("Parcel");
	МассивВыбранныхПарселей= Новый Массив;
	Для Каждого Элемент Из Parcels Цикл
		МассивВыбранныхПарселей.Добавить(Элемент.Parcel);
	КонецЦикла;
	СтруктураВозврата.Вставить("МассивВыбранныхПарселей", МассивВыбранныхПарселей);
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры
