         
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьВидимостьLeg7();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РГСофт.ЗаполнитьModification(ТекущийОбъект);
	
КонецПроцедуры
  

///////////////////////////////////////////////////////////

&НаКлиенте
Процедура POAsПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Имя", "ВыборИзServiceProviders");
	СтруктураНастройки.Вставить("МассивPOA", РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(Объект.POAs, "POA"));
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураНастройки", СтруктураНастройки);
	СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.SeaAndAirPorts.ФормаВыбора", СтруктураПараметров, Элемент);
        	
КонецПроцедуры

&НаКлиенте
Процедура POAsОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив")
		И ВыбранноеЗначение.Количество() > 0
		И ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.SeaAndAirPorts") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Для ы = 0 По ВыбранноеЗначение.ВГраница() Цикл
			
			НоваяСтрока = Объект.POAs.Добавить();
			НоваяСтрока.POA = ВыбранноеЗначение[ы];
			
			Модифицированность = Истина;
			
		КонецЦикла;
			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура POAsВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Элементы.POAs.ТекущиеДанные.POA);
	
КонецПроцедуры

&НаКлиенте
Процедура Leg7ПриИзменении(Элемент)
	
	НастроитьВидимостьLeg7();
	
КонецПроцедуры

Процедура НастроитьВидимостьLeg7()
	
	Элементы.TMSID.Видимость = Объект.Leg7;	
	
КонецПроцедуры

&НаКлиенте
Процедура RentalTrucksCostsTypeПриИзменении(Элемент)
	НастроитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьЭлементовФормы()
	
	Если Объект.RentalTrucksCostsType = Перечисления.RentalTrucksCostsTypes.PerDay ИЛИ Объект.RentalTrucksCostsType = Перечисления.RentalTrucksCostsTypes.PerHour Тогда
		Элементы.WithLoading.Видимость = Ложь;
	Иначе
		Элементы.WithLoading.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры





