
//////////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыбратьФайл();
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// ВЫБОР ФАЙЛА

&НаКлиенте
Процедура FullPathНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбратьФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр						= "CSV files|*.csv";
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	= Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		FullPath = ДиалогВыбораФайла.ПолноеИмяФайла;
				
	КонецЕсли;
		
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// ЗАГРУЗКА

#Если не ВебКлиент Тогда
	
&НаКлиенте
Процедура Load(Команда)
	 			
	Если НЕ ЗначениеЗаполнено(FullPath) Тогда
		
		ВыбратьФайл();
		
		Если НЕ ЗначениеЗаполнено(FullPath) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Select file!",
				, "Объект", "FullPath");
				Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	 
	Состояние("File loading...");
	
	Если НЕ РГСофтКлиентСервер.ФайлДоступенДляЗагрузки(FullPath) Тогда
		Возврат;
	КонецЕсли;
	   	
	Файл = Новый Файл(FullPath);
	ПолноеИмяXLSФайла = Неопределено;
	РасширениеФайла = НРег(Файл.Расширение);
	
	Если РасширениеФайла = ".csv" Тогда
		
		ПолноеИмяCSVФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
		КопироватьФайл(FullPath, ПолноеИмяCSVФайла);
		
	КонецЕсли; 
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяCSVФайла);
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	  	
	ЗагрузитьДанныеНаСервере(АдресФайла, Файл.ИмяБезРасширения, РасширениеФайла);
	
	УдалитьФайлы(ПолноеИмяCSVФайла); 
	               		
КонецПроцедуры

#КонецЕсли

&НаСервере
Процедура ЗагрузитьДанныеНаСервере(АдресФайла, ИмяБезРасширения, РасширениеФайла)
	
	ПолноеИмяCSVФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ДвоичныеДанные.Записать(ПолноеИмяCSVФайла);
	
	Обработки.OFSStoreTransactionsLoading.ЗагрузитьДанныеИзФайла(ПолноеИмяCSVФайла);
	
	//МассивПараметров = Новый Массив;
	//МассивПараметров.Добавить(ПолноеИмяCSVФайла);
	//Задание = ФоновыеЗадания.Выполнить("ImportExportСервер.ЗагрузитьOFSStoreTransactions", МассивПараметров, , "Загрузка OFS Store transactions");
	//
	//Попытка
	//	Задание.ОжидатьЗавершения();
	//Исключение
	//	Сообщить(Задание.ИнформацияОбОшибке);
	//	Сообщить("Failed to load file.");
	//	Возврат;
	//КонецПопытки;
	//
	//МассивСообщений = Задание.ПолучитьСообщенияПользователю();
	//Для Каждого Сообщение из МассивСообщений Цикл 
	//	Сообщить(Сообщение.Текст);
	//КонецЦикла;
	//
	//Если МассивСообщений.Количество() > 0 Тогда 
	//	Сообщить("Failed to load file.");
	//	Возврат;
	//КонецЕсли;
	//
	//Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда 
	//	Сообщить("File was successfully loaded.");
	//иначе
	//	Сообщить("Failed to load file.");
	//КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура TestAutoLoading(Команда)
	
	TestAutoLoadingНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура TestAutoLoadingНаСервере()
	 
	Обработки.OFSStoreTransactionsLoading.UploadOFSStoreTransactionsFromHub();	
	
КонецПроцедуры

