
/////////////////////////////////////////////////////////////////////////////////////
// ФОРМА

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	TypeOfComparison = ПолучитьTypeOfComparison(Объект.Field);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	РГСофтКлиент.ПроверитьНеобходимостьЗаписиСправочника(Модифицированность, Отказ);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РГСофтКлиентСервер.УстановитьЗначение(ТекущийОбъект.ModifiedBy, ПараметрыСеанса.ТекущийПользователь);
	ТекущийОбъект.ModificationDate = ТекущаяДата();
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////
// ЭЛЕМЕНТЫ УПРАВЛЕНИЯ

&НаКлиенте
Процедура FieldПриИзменении(Элемент)
	
	TypeOfComparison = ПолучитьTypeOfComparison(Объект.Field);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////
// ОБЩЕЕ

&НаСервереБезКонтекста
Функция ПолучитьTypeOfComparison(Field)
	
	Если Field = Перечисления.FieldsForRulesOfBlacklist.КодПоставщика Тогда
		Возврат "equal to";
	ИначеЕсли Field = Перечисления.FieldsForRulesOfBlacklist.ОписаниеНоменклатуры Тогда
		Возврат "contains";
	Иначе
		Возврат "";
	КонецЕсли; 
	
КонецФункции 

