
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСписокВыбораДляСклада();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ГруппаЕдиницыИзмерения.Видимость = Объект.КонвертироватьВСтандартныеЕдиницыИзмерения;
	УстановитьВидимостьЭлементовAdditionalInfo(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовAdditionalInfo(Форма, Объект)
	
	Элементы = Форма.Элементы;
	ИспользованиеAdditionalInfoReport  = Объект.AdditionalInfoReport;
	
	Элементы.ЗаменятьСкладUNKN.Видимость = ИспользованиеAdditionalInfoReport;
	Элементы.ЗаменаСкладаUNKN.Видимость = ИспользованиеAdditionalInfoReport И Объект.ЗаменятьСкладUNKN;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьСписокВыбораДляСклада()

	Элементы.ДатыНачалаВыгрузкиДокументовПоСкладамСклад.СписокВыбора.ЗагрузитьЗначения(Объект.ServiceProvider.Warehouses.ВыгрузитьКолонку("Warehouse"));

КонецПроцедуры

&НаКлиенте
Процедура ServiceProviderПриИзменении(Элемент)
	
	УстановитьСписокВыбораДляСклада();
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьВСтандартныеЕдиницыИзмеренияПриИзменении(Элемент)
	Если Не Объект.КонвертироватьВСтандартныеЕдиницыИзмерения Тогда
		Объект.ЕдиницаИзмеренияВеса = ПредопределенноеЗначение("Справочник.UOMs.ПустаяСсылка");
		Объект.ЕдиницаИзмеренияРазмеров = ПредопределенноеЗначение("Справочник.UOMs.ПустаяСсылка");
		Элементы.ГруппаЕдиницыИзмерения.Видимость = Ложь;
	Иначе
		Элементы.ГруппаЕдиницыИзмерения.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура AdditionalInfoReportПриИзменении(Элемент)
	УстановитьВидимостьЭлементовAdditionalInfo(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменятьСкладUNKNПриИзменении(Элемент)
	УстановитьВидимостьЭлементовAdditionalInfo(ЭтаФорма, Объект);
КонецПроцедуры
