
Процедура ПередЗаписью(Отказ)
	
	РГСофтКлиентСервер.УстановитьЗначение(Наименование, СокрЛП(Наименование));
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеРеквизитов(Отказ);
	
	Если НЕ ЗначениеЗаполнено(Порядок) Тогда
		Порядок = Код;
		Если Код = "Non" Тогда
			Порядок = 0;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Код) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Code"" is empty!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Name"" is empty!",
			ЭтотОбъект, "Наименование", , Отказ);
	КонецЕсли;
		
КонецПроцедуры