
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	PlanningRentalCosts.Ссылка
	|ИЗ
	|	Документ.PlanningRentalCosts КАК PlanningRentalCosts
	|ГДЕ
	|	PlanningRentalCosts.Дата МЕЖДУ &Дата1 И &Дата2
	|	И НЕ PlanningRentalCosts.ПометкаУдаления
	|	И PlanningRentalCosts.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Дата1",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 тогда
				
		ТранспортГеомаркет = Новый ТаблицаЗначений;
		ТранспортГеомаркет.Колонки.Добавить("Транспорт");
		ТранспортГеомаркет.Колонки.Добавить("Geomarket");
		ТранспортГеомаркет.Колонки.Добавить("Sum");
		Для Каждого Строка ИЗ PlanningCosts Цикл
			Если ЗначениеЗаполнено(Строка.Transport.Geomarket)   Тогда
				Если Строка.PlanCostsUSD <> 0 Тогда
					СтрокаТранспортГеомаркет = ТранспортГеомаркет.Добавить();
					СтрокаТранспортГеомаркет.Транспорт = Строка.Transport;
					СтрокаТранспортГеомаркет.Geomarket = Строка.Transport.Geomarket;
					СтрокаТранспортГеомаркет.Sum = Строка.PlanCostsUSD;
				КонецЕсли;
			Иначе
				Message = New UserMessage();
				Message.Text = "Для Траспортного средства " + Строка.Transport + " в строке - " + Строка.НомерСтроки + ", не установлен геомаркет";
				Message.Message();				
			КонецЕсли;
		КонецЦикла;
		
		Движения.PlanningCosts.Записывать = Истина;
		Движения.PlanningCosts.Очистить();
		
		Геомаркеты = ТранспортГеомаркет.Скопировать();
		Геомаркеты.Свернуть("Geomarket");	
		ТаблицаПроцентовПоГеомаркетам = Документы.rgsBudgetSums.ПолучитьТаблицуДвижений(Геомаркеты, Дата);
		Для Каждого Геомаркет из Геомаркеты Цикл	
			Отбор = Новый Структура;
			Отбор.Вставить("Geomarket", Геомаркет.Geomarket);
			Транспорт = ТранспортГеомаркет.Скопировать(Отбор);
			ПроцентовкаПоГеомаркету = ТаблицаПроцентовПоГеомаркетам.Скопировать(Отбор);
			ПроцентовкаПоГеомаркету.Свернуть("Geomarket, SubGeomarket, Segment, SubSegment", "Percent");
			Для Каждого Машина ИЗ Транспорт Цикл
				
				Для каждого Процент ИЗ ПроцентовкаПоГеомаркету Цикл
					Если НЕ Отказ Тогда
						Движение = Движения.PlanningCosts.Добавить();
						Движение.Период = Дата;
						Движение.Transport = Машина.Транспорт;
						Движение.ServiceProvider = Машина.Транспорт.ServiceProvider;
						Движение.Geomarket = Процент.Geomarket;
						Движение.SubGeomarket = Процент.SubGeomarket;
						Движение.Segment = Процент.Segment;
						Движение.SubSegment = Процент.SubSegment; 
						Движение.SumUSD = Процент.Percent * Машина.Sum;
						Движение.Регистратор = Ссылка;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		Отказ = Истина;
		Message = New UserMessage();
		Message.Text = "В этом месяце уже был проведен документ планирования затрат на аренду транспортных средств";
		Message.Message();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Дата = НачалоМесяца(Дата);
	
	ModifiedBy = ПараметрыСеанса.ТекущийПользователь;
	ModificationDate = ТекущаяДата();
	
КонецПроцедуры


