
Процедура СгенерироватьПароль()
	
	// 1. A-Z от 65 до 90
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах()+1);
	СлучайноеЧисло = Цел(ГСЧ.СлучайноеЧисло(65, 90));
	
	Пароль = Пароль + Символ(СлучайноеЧисло);
	
	// 2. A-Z от 65 до 90
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах()+2);
	СлучайноеЧисло = Цел(ГСЧ.СлучайноеЧисло(65, 90));
	
	Пароль = Пароль + Символ(СлучайноеЧисло);
	
	// 3. 0-9 от 48 до 57
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах()+3);
	СлучайноеЧисло = Цел(ГСЧ.СлучайноеЧисло(48, 57));
	
	Пароль = Пароль + Символ(СлучайноеЧисло);
	
	// 4. 0-9 от 48 до 57
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах()+4);
	СлучайноеЧисло = Цел(ГСЧ.СлучайноеЧисло(48, 57));
	
	Пароль = Пароль + Символ(СлучайноеЧисло);
	
	// 5. a-z от 97 до 122
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах()+5);
	СлучайноеЧисло = Цел(ГСЧ.СлучайноеЧисло(97, 122));
	
	Пароль = Пароль + Символ(СлучайноеЧисло);
	
	// 6. a-z от 97 до 122
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах()+6);
	СлучайноеЧисло = Цел(ГСЧ.СлучайноеЧисло(97, 122));
	
	Пароль = Пароль + Символ(СлучайноеЧисло);
	
	// 7. A-Z от 65 до 90
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах()+7);
	СлучайноеЧисло = Цел(ГСЧ.СлучайноеЧисло(65, 90));
	
	Пароль = Пароль + Символ(СлучайноеЧисло);
	
	// 8. &%# от 33 до 47
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах()+8);
	СлучайноеЧисло = Цел(ГСЧ.СлучайноеЧисло(33, 47));
	
	Пароль = Пароль + Символ(СлучайноеЧисло);
	
	// 9. a-z от 97 до 122
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах()+9);
	СлучайноеЧисло = Цел(ГСЧ.СлучайноеЧисло(97, 122));
	
	Пароль = Пароль + Символ(СлучайноеЧисло);
	
	// 10. &%# от 33 до 47
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах()+10);
	СлучайноеЧисло = Цел(ГСЧ.СлучайноеЧисло(33, 47));
	
	//{ RGS ASeryakov 06.06.2018 17:00:00 PM S-I-0005394
	//Пароль = Пароль + Символ(СлучайноеЧисло);
	Пароль = СтрЗаменить(Пароль + Символ(СлучайноеЧисло),"&","1");
	//} RGS ASeryakov 06.06.2018 17:00:00 PM S-I-0005394
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пароль) Тогда
		СгенерироватьПароль();
	КонецЕсли;
	
КонецПроцедуры
