Процедура ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаЗначений, Реквизиты, ВключитьНДСВОсновнуюСумму = Истина) Экспорт
	
	Перем СуммаВключаетНДС,ВидРасчетовПоДоговору;
	       
	ВалютаРегламентированногоУчета = Реквизиты.ВалютаРеглУчета;
	
	ЕстьНДС = ТаблицаЗначений.Колонки.Найти("НДС") <> Неопределено;
	ЕстьСтавкаНДС = ТаблицаЗначений.Колонки.Найти("СтавкаНДС") <> Неопределено;
	ЕстьВалюта = Реквизиты.Свойство("ВалютаДокумента");
	
	//Обновление на бух. корп. 3.0.38.43
	//Если ТипЗнч(Реквизиты.Ссылка) = Тип("ДокументСсылка.ГТДИмпорт") Тогда 
	//	// Для документа ГТДИмпорт передается специфическая структура таблицы, суммы НДС разделены по строкам 
	//	// с суммами без НДС. Расчет может производиться только пересчетом по курсу.
	//	РасчетСуммыНДСПоСтавке = Ложь;
	//ИначеЕсли ЕстьВалюта И ЕстьНДС И ЕстьСтавкаНДС И Реквизиты.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
	//<=
	Если ЕстьВалюта И ЕстьНДС И ЕстьСтавкаНДС И Реквизиты.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
		РасчетСуммыНДСПоСтавке =  Истина;
	Иначе
		РасчетСуммыНДСПоСтавке = Ложь;
	КонецЕсли; 
	
	Реквизиты.Свойство("СуммаВключаетНДС", СуммаВключаетНДС);
	СуммаВключаетНДС = (СуммаВключаетНДС = Истина);
	
	Если Реквизиты.Свойство("ДоговорКонтрагента") тогда
		Если Реквизиты.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета 
			ИЛИ НЕ ЗначениеЗаполнено(Реквизиты.ВалютаВзаиморасчетов) Тогда
			
			ВидРасчетовПоДоговору = Перечисления.ВидыРасчетовПоДоговорам.РасчетыВВалютеРегламентированногоУчета;
			
		ИначеЕсли Реквизиты.РасчетыВУсловныхЕдиницах Тогда
			
			ВидРасчетовПоДоговору = Перечисления.ВидыРасчетовПоДоговорам.РасчетыВУсловныхЕдиницах;
			
		Иначе
			
			ВидРасчетовПоДоговору = Перечисления.ВидыРасчетовПоДоговорам.РасчетыВИностраннойВалюте;
			
		Конецесли;

	КонецЕсли;
	
	// Дополним колонки ТЗ при необходимости
	СтруктураОбязательныхКолонок = Новый Структура("Сумма" + ?(ЕстьНДС, ",НДС,СуммаБезНДС", "") + ?(ЕстьВалюта, ",СуммаВал" + ?(ЕстьНДС, ",НДСВал,СуммаБезНДСВал", ""), ""));
	
	СтруктураОбязательныхКолонок.Вставить("СуммаБУ");
	Если ЕстьНДС Тогда
		СтруктураОбязательныхКолонок.Вставить("СуммаБУБезНДС");
	КонецЕсли;
	
	Для каждого Колонка Из СтруктураОбязательныхКолонок Цикл
		
		Если ТаблицаЗначений.Колонки.Найти(Колонка.Ключ) = Неопределено тогда
			ТаблицаЗначений.Колонки.Добавить(Колонка.Ключ, ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
		КонецЕсли;
		
	КонецЦикла;
	
	//Дополним колонки ТЗ при необходимости нечисловыми полями
	Если ТаблицаЗначений.Колонки.Найти("СчетУчетаЦенности") = Неопределено тогда
		ТаблицаЗначений.Колонки.Добавить("СчетУчетаЦенности");
	КонецЕсли;
	
	Если ТаблицаЗначений.Колонки.Найти("ВидЦенности") = Неопределено тогда
		ТаблицаЗначений.Колонки.Добавить("ВидЦенности");
	КонецЕсли;
	
	Если ТаблицаЗначений.Колонки.Найти("Ценность") = Неопределено тогда
		ТаблицаЗначений.Колонки.Добавить("Ценность");
	КонецЕсли;
	
	Если ТаблицаЗначений.Колонки.Найти("Тара") = Неопределено тогда
		ТаблицаЗначений.Колонки.Добавить("Тара", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	// Определим суммы по документу (Сумму без НДС и корректную основную сумму)
	Если ЕстьНДС тогда
		
		Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
			СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - ?(СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
			
			Если РасчетСуммыНДСПоСтавке Тогда
				СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаБезНДС + СтрокаТаблицы.НДС;
			Иначе
				СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаБезНДС + ?(ВключитьНДСВОсновнуюСумму, СтрокаТаблицы.НДС, 0);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЕстьВалюта тогда
		
		// Заполним валютные колонки суммами документа
		Для каждого Колонка Из СтруктураОбязательныхКолонок Цикл
			
			Если Прав(Колонка.Ключ, 3) = "Вал" Тогда
				ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку(Лев(Колонка.Ключ, СтрДлина(Колонка.Ключ) - 3)), Колонка.Ключ);
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ (Реквизиты.ВалютаДокумента = ВалютаРегламентированногоУчета) Тогда
			
			Если НЕ Реквизиты.Свойство("КурсДокумента") ИЛИ НЕ Реквизиты.Свойство("КратностьДокумента") тогда
				КоэффициентПересчета = 1;
			ИначеЕсли Число(Реквизиты.КурсДокумента) = 0 ИЛИ Число(Реквизиты.КратностьДокумента) = 0 тогда
				КоэффициентПересчета = 1;
			Иначе
				КоэффициентПересчета = Реквизиты.КурсДокумента/Реквизиты.КратностьДокумента;
			КонецЕсли;
			
			// Распределение суммы по таблице
			СуммаРег = Окр(ТаблицаЗначений.Итог("СуммаВал") * КоэффициентПересчета, 2);
			
			РаспределениеРег = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СуммаРег, ТаблицаЗначений.ВыгрузитьКолонку("Сумма"));
			Если РаспределениеРег <> Неопределено Тогда
				ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеРег,"Сумма");
			КонецЕсли; 
			
			Если ЕстьНДС Тогда
				Если РасчетСуммыНДСПоСтавке Тогда
					Если БухгалтерскийУчетКлиентСерверПереопределяемый.ДокументЯвляетсяРеализациейОтгруженныхТоваров(Реквизиты.Ссылка) Тогда
						Если Реквизиты.НачислятьНДСПоОтгрузке Тогда
							
							// Выделение суммы НДС, Расчет суммы без НДС
							Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
								
								ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
								Если СтрокаТаблицы.НДС = 0 Тогда
									СтрокаТаблицы.НДС = 0;
								Иначе
									СтрокаТаблицы.НДС = (СтрокаТаблицы.СуммаВал * ЗначениеСтавкиНДС /(100 + ЗначениеСтавкиНДС)) * Реквизиты.КурсДокументаОтгрузки/Реквизиты.КратностьДокументаОтгрузки;
								КонецЕсли;
								СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - СтрокаТаблицы.НДС;
								
							КонецЦикла;
							НДСРег = ТаблицаЗначений.Итог("НДС");
							
							// Корректировка таблицы в случае если не ВключитьНДСВОсновнуюСумму
							Если НЕ ВключитьНДСВОсновнуюСумму Тогда
								ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДС"),"Сумма");
								ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДСВал"),"СуммаВал");
							КонецЕсли;
						Иначе
							// Выделение суммы НДС, Расчет суммы без НДС
							Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
								ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
								Если СтрокаТаблицы.НДС = 0 Тогда
									СтрокаТаблицы.НДС = 0;
								Иначе
									СтрокаТаблицы.НДС = ?(ЗначениеСтавкиНДС = 0, 0, Окр(СтрокаТаблицы.Сумма * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС), 2));
								КонецЕсли;
								
								СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - СтрокаТаблицы.НДС;
							КонецЦикла;
							НДСРег = ТаблицаЗначений.Итог("НДС");
							
							// Корректировка таблицы в случае если не ВключитьНДСВОсновнуюСумму
							Если НЕ ВключитьНДСВОсновнуюСумму Тогда
								ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДС"), "Сумма");
								ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДСВал"), "СуммаВал");
							КонецЕсли;							
						КонецЕсли;	
                    Иначе
						// Выделение суммы НДС, Расчет суммы без НДС
						Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
							
							ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
							Если СтрокаТаблицы.НДС = 0 Тогда
								СтрокаТаблицы.НДС = 0;
							Иначе
								СтрокаТаблицы.НДС = ?(ЗначениеСтавкиНДС = 0, 0, Окр(СтрокаТаблицы.Сумма * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС), 2));
							КонецЕсли;
							
							СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - СтрокаТаблицы.НДС;
							
						КонецЦикла;
						НДСРег = ТаблицаЗначений.Итог("НДС");
						
						// Корректировка таблицы
						Если НЕ ВключитьНДСВОсновнуюСумму Тогда
							ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДС"), "Сумма");
							ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДСВал"), "СуммаВал");
						КонецЕсли; 
                    КонецЕсли; 
				Иначе
					НДСРег = Окр(ТаблицаЗначений.Итог("НДСВал") * КоэффициентПересчета, 2);
					// Распределение суммы по таблице
					РаспределениеРег = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(НДСРег,ТаблицаЗначений.выгрузитьКолонку("НДС"));
					Если РаспределениеРег <> Неопределено Тогда
						ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеРег, "НДС");
					КонецЕсли; 
					
					// Расчет суммы без НДС
					Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
						СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - ?(ВключитьНДСВОсновнуюСумму, СтрокаТаблицы.НДС, 0);
					КонецЦикла;
				КонецЕсли; 
			КонецЕсли;
		Иначе
			
			// Документ в национальной валюте
			Если ВидРасчетовПоДоговору = Перечисления.ВидыРасчетовПоДоговорам.РасчетыВУсловныхЕдиницах 
				ИЛИ ((ТипЗнч(Реквизиты.Ссылка) = Тип("ДокументСсылка.ОтражениеНДСКВычету")
				ИЛИ ТипЗнч(Реквизиты.Ссылка) = Тип("ДокументСсылка.ОтражениеНачисленияНДС"))
				И Реквизиты.ВалютаВзаиморасчетов <> ВалютаРегламентированногоУчета) Тогда
				
				// Необходимо определить сумму расчетов с контрагентом в валюте договора
				Если НЕ Реквизиты.Свойство("КурсВзаиморасчетов") ИЛИ НЕ Реквизиты.Свойство("КратностьВзаиморасчетов") Тогда
					КоэффициентПересчета = 1;
				ИначеЕсли Число(Реквизиты.КурсВзаиморасчетов) = 0 ИЛИ Число(Реквизиты.КратностьВзаиморасчетов) = 0 Тогда
					КоэффициентПересчета = 1;
				Иначе
					КоэффициентПересчета = Реквизиты.КратностьВзаиморасчетов / Реквизиты.КурсВзаиморасчетов;
				КонецЕсли;
				
				СуммаВал = Окр(ТаблицаЗначений.Итог("Сумма") * КоэффициентПересчета, 2);
				// Распределение суммы по таблице
				РаспределениеВал = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СуммаВал,ТаблицаЗначений.ВыгрузитьКолонку("СуммаВал"));
				Если РаспределениеВал <> Неопределено Тогда
					ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеВал, "СуммаВал");
				КонецЕсли; 
				
				
				Если ЕстьНДС Тогда
					
					НДСВал = Окр(ТаблицаЗначений.Итог("НДС") * КоэффициентПересчета, 2);
					// Распределение суммы по таблице
					РаспределениеВал = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(НДСВал,ТаблицаЗначений.ВыгрузитьКолонку("НДСВал"));
					Если РаспределениеВал <> Неопределено Тогда
						ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеВал, "НДСВал");
					КонецЕсли; 
					
					// Расчет суммы без НДС
					Для каждого СтрокаТаблицы из ТаблицаЗначений Цикл
						СтрокаТаблицы.СуммаБезНДСВал = СтрокаТаблицы.СуммаВал - ?(ВключитьНДСВОсновнуюСумму, СтрокаТаблицы.НДСВал, 0);
					КонецЦикла;
					
					
				КонецЕсли;
				
			КонецЕсли
			
		КонецЕсли;
		
	КонецЕсли;
	
	// На этапе подготовки таблицы суммы для БУ совпадают с суммами для остальных видов учета (НУ, НДС...).
	// При зачете авансов в иностранной валюте в 2008 году суммы БУ будут корректироваться с учетом курсов зачтенных авансов,
	// а суммы для других видов учета остаются прежними
	
	ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("Сумма"), "СуммаБУ");
	Если ЕстьНДС Тогда
		ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДС"), "СуммаБУБезНДС");
	КонецЕсли;
	
	ТаблицаЗначений.Колонки.Добавить("СуммаНУ", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Если ЕстьНДС Тогда
		ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБУБезНДС"), "СуммаНУ");
	Иначе
		ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБУ"), "СуммаНУ");
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("СчетЗатрат,Субконто1,Субконто2,Субконто3");
		
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВидЦенности) Тогда
			ЗаполнитьЗначенияСвойств(СтруктураПараметров, СтрокаТаблицы);
			СтрокаТаблицы.ВидЦенности = 
				УчетНДС.ОпределитьВидЦенности(СтруктураПараметров.СчетЗатрат, СтруктураПараметров.Субконто1, СтруктураПараметров.Субконто2, СтруктураПараметров.Субконто3);
		КонецЕсли; 
	КонецЦикла;	
		
КонецПроцедуры
