Перем мПеребрасыватьПроводки;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Документ <> Ссылка.Документ Тогда
		мПеребрасыватьПроводки = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если мПеребрасыватьПроводки Тогда
		
		//Пахоменков изменил 15.05.2012 - реализации будут проставлятся проводкам ДСС	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроводкиDSS_SB.GltObjId
		|ИЗ
		|	РегистрНакопления.ПроводкиDSS_SB КАК ПроводкиDSS_SB
		|ГДЕ
		|	ПроводкиDSS_SB.ArInvoice = &ArInvoice"; 
		
		Запрос.УстановитьПараметр("ArInvoice", Ссылка); 
		МассивID = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("GltObjID"); 
		ОбработкаDSSСервер.ПереброситьПроводкиDSS(МассивID, Документ, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

мПеребрасыватьПроводки = Ложь;
   