
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПолучитьЗначенияПараметровФормы();

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
// Процедура заполняет параметры формы.
//
Процедура ПолучитьЗначенияПараметровФормы()

	Если Параметры.Свойство("ermDocumentFlowPeriodFrom") Тогда
		ermDocumentFlowPeriodFrom = Параметры.ermDocumentFlowPeriodFrom;
	КонецЕсли;

	Если Параметры.Свойство("ermDocumentFlowPeriodTo") Тогда
		ermDocumentFlowPeriodTo = Параметры.ermDocumentFlowPeriodTo;
	КонецЕсли;
	
	Если Параметры.Свойство("ermPtDaysFrom") Тогда
		ermPtDaysFrom = Параметры.ermPtDaysFrom;
	КонецЕсли;

	Если Параметры.Свойство("СрокОплаты") Тогда
		СрокОплаты = Параметры.СрокОплаты;
	КонецЕсли;

	Если Параметры.Свойство("ermPtType") Тогда
		ermPtType = Параметры.ermPtType;
	КонецЕсли;

	Если Параметры.Свойство("ermTrigger") Тогда
		ermTrigger = Параметры.ermTrigger;
	КонецЕсли;

КонецПроцедуры
