
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отбор = Параметры.Отбор;
	
	Отбор.Вставить("ПометкаУдаления", Ложь);                                                                                                		
	
	//[РКХ->]
	//УстановкиДинамическогоСписка(); 
	
	//Если ОбщегоНазначенияПовтИсп.ИдентификаторРабочейКонфигурации() <> "PA" Тогда
	ParentCompanyPA = Справочники.SoldTo.НайтиПоКоду("PA");
	Если ЗначениеЗаполнено(ParentCompanyPA) Тогда  
		Список.Параметры.УстановитьЗначениеПараметра("ParentCompanyPA", Справочники.SoldTo.НайтиПоКоду("PA"));
	КонецЕсли;
	//КонецЕсли;
	//[<-РКХ]
	
	// { RGS LFedotova 30.10.2017 12:37:20 - вопрос SLI-0007413
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.ФормаОткрытьПолныйСписок.Видимость = Истина;	
	Иначе
		Элементы.ФормаОткрытьПолныйСписок.Видимость = Ложь;	
	КонецЕсли;
	// } RGS LFedotova 30.10.2017 12:37:25 - вопрос SLI-0007413 

КонецПроцедуры

//[РКХ->]
Процедура УстановкиДинамическогоСписка()
	
	Список.ПроизвольныйЗапрос = Истина;
	
	Если ОбщегоНазначенияПовтИсп.ИдентификаторРабочейКонфигурации() = "PA" Тогда
		
		Список.ТекстЗапроса = "ВЫБРАТЬ
		                      |	СправочникКостЦентры.Ссылка,
		                      |	СправочникКостЦентры.ВерсияДанных,
		                      |	СправочникКостЦентры.ПометкаУдаления,
		                      |	СправочникКостЦентры.Предопределенный,
		                      |	СправочникКостЦентры.Код,
		                      |	СправочникКостЦентры.Наименование,
		                      |	СправочникКостЦентры.Segment,
		                      |	СправочникКостЦентры.SubSegment,
		                      |	СправочникКостЦентры.Сегмент,
		                      |	СправочникКостЦентры.DefaultActivity,
		                      |	СправочникКостЦентры.OnlyMS,
		                      |	СправочникКостЦентры.TaxRegistration,
		                      |	СправочникКостЦентры.ПодразделениеОрганизации
		                      |ИЗ
		                      |	Справочник.КостЦентры КАК СправочникКостЦентры";	
							  
		Элементы.SLILegalEntity.Видимость 	= Ложь;							  
		Элементы.PALegalEntity.Видимость 	= Ложь;
		
	Иначе

		Список.ТекстЗапроса = "ВЫБРАТЬ
		                      |	СправочникКостЦентры.Ссылка,
		                      |	СправочникКостЦентры.Код,
		                      |	СправочникКостЦентры.Наименование,
		                      |	СправочникКостЦентры.Segment,
		                      |	СправочникКостЦентры.SubSegment,
		                      |	СправочникКостЦентры.Сегмент,
		                      |	СправочникКостЦентры.DefaultActivity,
		                      |	СправочникКостЦентры.OnlyMS,
		                      |	СправочникКостЦентры.TaxRegistration,
		                      |	СправочникКостЦентры.ПодразделениеОрганизации,
		                      |	СправочникКостЦентры.TaxRegistration.LegalEntity КАК SLILegalEntity,
		                      |	МАКСИМУМ(AUsAndLegalEntities.LegalEntity) КАК PALegalEntity
		                      |ИЗ
		                      |	Справочник.КостЦентры КАК СправочникКостЦентры
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AUsAndLegalEntities КАК AUsAndLegalEntities
		                      |		ПО СправочникКостЦентры.Ссылка = AUsAndLegalEntities.AU
		                      |			И (AUsAndLegalEntities.ParentCompany = &ParentCompanyPA)
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	СправочникКостЦентры.Код,
		                      |	СправочникКостЦентры.Наименование,
		                      |	СправочникКостЦентры.Segment,
		                      |	СправочникКостЦентры.SubSegment,
		                      |	СправочникКостЦентры.Сегмент,
		                      |	СправочникКостЦентры.DefaultActivity,
		                      |	СправочникКостЦентры.OnlyMS,
		                      |	СправочникКостЦентры.TaxRegistration,
		                      |	СправочникКостЦентры.ПодразделениеОрганизации,
		                      |	СправочникКостЦентры.TaxRegistration.LegalEntity,
		                      |	СправочникКостЦентры.Ссылка";
			
			// да, можно было бы и в форме истину поставить и тут не ставить, но почему-то НЕ РАБОТАЕТ в таком случае :(				  
			Элементы.SLILegalEntity.Видимость 	= Истина;							  
			Элементы.PALegalEntity.Видимость 	= Истина;
							  
	КонецЕсли;
	
	
	
КонецПроцедуры
//[<-РКХ]

// { RGS LFedotova 30.10.2017 12:37:20 - вопрос SLI-0007413
&НаКлиенте
Процедура ОткрытьПолныйСписок(Команда)
	
	Форма = ПолучитьФорму("Справочник.КостЦентры.Форма.ФормаСпискаПолного");
	Форма.Открыть();
	
КонецПроцедуры
// } RGS LFedotova 30.10.2017 12:37:25 - вопрос SLI-0007413 
