

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	табДвижений = Новый ТаблицаЗначений;
	табДвижений = СтоимостьБУ.ВыгрузитьКолонки();
	табДвижений.Индексы.Добавить("СуммаКВ", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	//табДвижений.Индексы.Добавить("СтоимостьБУ", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	табДвижений.Индексы.Добавить("АмортизацияНУ", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
    	
	Для Каждого Запись Из СтоимостьБУ Цикл
		НоваяСтрока = табДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
	КонецЦикла;
	
	Для Каждого Запись Из АмортизацияНУ Цикл
		НоваяСтрока = табДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
	КонецЦикла;
	
	Для Каждого Запись Из КапитальныеВложения Цикл
		НоваяСтрока = табДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
	КонецЦикла;	

	табДвижений.Свернуть("ОсновноеСредство, Подразделение, НалоговыйПериод", "СуммаКВ, СтоимостьБУ, АмортизацияНУ");  
	Для Каждого Запись Из табДвижений Цикл
		Движение = Движения.СтоимостьАмортизацияОС.ДобавитьПриход();
		Движение.Период = ДатаПроведения;
		ЗаполнитьЗначенияСвойств(Движение, Запись);
	КонецЦикла;
	
	
КонецПроцедуры

