
Функция ПроверимНаНаличиеCCD(Shipment) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГТД.Ссылка КАК CCD
	|ИЗ
	|	Документ.ГТД КАК ГТД
	|ГДЕ
	|	ГТД.Shipment = &Shipment
	|	И НЕ ГТД.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	CustomsFilesLight.Ссылка
	|ИЗ
	|	Документ.CustomsFilesLight КАК CustomsFilesLight
	|ГДЕ
	|	CustomsFilesLight.Shipment = &Shipment
	|	И НЕ CustomsFilesLight.ПометкаУдаления";
	Запрос.УстановитьПараметр("Shipment", Shipment);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции