Перем мОснование;

Перем ПрошлыйИзмененныйРодительОбъектаДоступа;

Процедура ПриЗаписи(Отказ)
		
	Если НЕ ОбменДанными.Загрузка Тогда
				
		НастройкаПравДоступа.ОбновитьПраваДоступаКИерархическимОбъектамПриНеобходимости(Ссылка,ПрошлыйИзмененныйРодительОбъектаДоступа, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Перем мСсылкаНового;
	
	// { RGS LFedotova 22.11.2017 23:50:08 - вопрос S-B-0000197
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Решено разрешать создавать новые только в Billing
	Если ЭтоНовый() Тогда
		Если НЕ ЭтоBilling() Тогда
			Сообщить("Инвойсинговые центры разрешено создавать только в базе Billing!");
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	// } RGS LFedotova 22.11.2017 23:50:12 - вопрос S-B-0000197
	
	ПрошлыйИзмененныйРодительОбъектаДоступа = ?(Не ЭтоНовый() и Не Ссылка.Родитель = Родитель, Ссылка.Родитель, Неопределено);
	НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель, мСсылкаНового);

КонецПроцедуры

// { RGS LFedotova 22.11.2017 23:54:18 - вопрос S-B-0000197
Функция ЭтоBilling() 
	
	ПодстрокиСоединения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
									СтрокаСоединенияИнформационнойБазы(), ";");
	ИмяИБ = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(Сред(ПодстрокиСоединения[1], 6));
	
	// Проверяем имя базы
	Если ИмяИБ = "Billing" Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
// } RGS LFedotova 22.11.2017 23:54:34 - вопрос S-B-0000197
