
&НаКлиенте
Процедура ОборудованиеDSSВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаРегистра = Элемент.ТекущиеДанные;
	СтруктураВыбора = Новый Структура("ПроводкаDSS,Стоимость,Номенклатура,Количество");
	СтруктураВыбора.ПроводкаDSS = СтрокаРегистра.ПроводкаДеталейСКП;
	СтруктураВыбора.Стоимость = СтрокаРегистра.СуммаРуб;
	СтруктураВыбора.Номенклатура = СтрокаРегистра.Номенклатура;
	СтруктураВыбора.Количество = СтрокаРегистра.Количество;
	ОповеститьОВыборе(СтруктураВыбора);
	
КонецПроцедуры
