Функция ВывестиСообщенияКриптаНеУдалосьСоздатьОбъектДляРаботыСКриптографией() Экспорт
	
	ТекстСообщения = ВернутьСтр("ru='Не удалось создать объект для работы с криптографией. В системе не обнаружен криптопровайдер.'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Возврат Истина;
	
КонецФункции

Функция ВывестиСообщенияНеУдалосьПодключитьВнешнююКомпоненту() Экспорт
	
	ТекстСообщения = ВернутьСтр("ru='Не удалось подключить внешнюю компоненту.'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Возврат Истина;
	
КонецФункции