
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Добавил - РГ-Софт - Иванов Антон - 2009-07-06
	Номер = СокрЛП(Номер);
	
	//Добавил - РГ-Софт - Иванов Антон - 2009-04-21
	Состав.Свернуть("Наименование, Артикул, Валюта, ЕдиницаИзмерения, Страна, Категория, Цена, АУ, Счет, Тип, Ответсвенный, ActivityCode", "Количество, Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		
		// регистр ЗаказыШвепса Приход
		Движение = Движения.ЗаказыШвепса.Добавить();
		Движение.Период = Дата;
		Движение.НомерПО = СокрЛП(Номер);
		Движение.НомерСтрокиДок = ТекСтрокаСостав.НомерСтроки;
		Движение.Количество = ТекСтрокаСостав.Количество;
		
	КонецЦикла;
	
КонецПроцедуры
