

&НаСервере
Процедура ЗаполнитьФорму();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Параметры.ДокументКорректировки);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	InventoryКорректировкаGoods.Good.Код
	|ПОМЕСТИТЬ КодыДокументаКорректировки
	|ИЗ
	|	Документ.InventoryКорректировка.Goods КАК InventoryКорректировкаGoods
	|ГДЕ
	|	InventoryКорректировкаGoods.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	InventoryСписаниеGoods.Ссылка,
	|	InventoryСписаниеGoods.Good.Код
	|ПОМЕСТИТЬ КодыДокументаСписанияВсе
	|ИЗ
	|	Документ.InventoryСписание.Goods КАК InventoryСписаниеGoods
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодыДокументаКорректировки.GoodКод) КАК КоличествоКодов
	|ПОМЕСТИТЬ КоличествоКодовДокументаКорректировки
	|ИЗ
	|	КодыДокументаКорректировки КАК КодыДокументаКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыДокументаСписанияВсе.Ссылка,
	|	ВЫБОР
	|		КОГДА КодыДокументаСписанияВсе.GoodКод В
	|				(ВЫБРАТЬ
	|					КодыДокументаКорректировки.GoodКод
	|				ИЗ
	|					КодыДокументаКорректировки КАК КодыДокументаКорректировки)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НаличиеНужногоКода
	|ПОМЕСТИТЬ КодыДокументаСписания
	|ИЗ
	|	КодыДокументаСписанияВсе КАК КодыДокументаСписанияВсе,
	|	КодыДокументаКорректировки КАК КодыДокументаКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыДокументаСписания.Ссылка,
	|	СУММА(КодыДокументаСписания.НаличиеНужногоКода) КАК КоличествоКодовВДокументеСписания
	|ПОМЕСТИТЬ КоличествоКодовДокументаСписания
	|ИЗ
	|	КодыДокументаСписания КАК КодыДокументаСписания
	|
	|СГРУППИРОВАТЬ ПО
	|	КодыДокументаСписания.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоличествоКодовДокументаСписания.Ссылка
	|ПОМЕСТИТЬ НужныеСсылкиДокументовСписания
	|ИЗ
	|	КоличествоКодовДокументаСписания КАК КоличествоКодовДокументаСписания,
	|	КоличествоКодовДокументаКорректировки КАК КоличествоКодовДокументаКорректировки
	|ГДЕ
	|	КоличествоКодовДокументаСписания.КоличествоКодовВДокументеСписания = КоличествоКодовДокументаКорректировки.КоличествоКодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	InventoryСписаниеGoods.Ссылка Ссылка1,
	|	СУММА(InventoryСписаниеGoods.ManagementSum) КАК ManagementSum
	|ИЗ
	|	Документ.InventoryСписание.Goods КАК InventoryСписаниеGoods,
	|	НужныеСсылкиДокументовСписания КАК НужныеСсылкиДокументовСписания
	|ГДЕ
	|	InventoryСписаниеGoods.Ссылка В
	|			(ВЫБРАТЬ
	|				НужныеСсылкиДокументовСписания.Ссылка
	|			ИЗ
	|				НужныеСсылкиДокументовСписания КАК НужныеСсылкиДокументовСписания)
	|
	|СГРУППИРОВАТЬ ПО
	|	InventoryСписаниеGoods.Ссылка";
	
	ТЗ.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры

&НаКлиенте
Процедура ТЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	стр = Элементы.ТЗ.ТекущиеДанные;
	Закрыть(стр.Ссылка1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьФорму();
КонецПроцедуры
