
Процедура ДобавитьЗапись(ВидДвижения, Период, Item, Qty) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидДвижения) Тогда
		ВызватьИсключение "Вид движения is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		ВызватьИсключение "Период is empty!";
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Item) Тогда
		ВызватьИсключение "Item is empty!";
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Qty) Тогда
		ВызватьИсключение "Qty is empty!";
	КонецЕсли;

	Движение = Добавить();
	Движение.ВидДвижения = ВидДвижения;
	Движение.Период = Период;
	Движение.Item = Item;
	Движение.Qty = Qty;
	
КонецПроцедуры

