
Процедура ПолучитьИнформациюОВходящихСообщениях() Экспорт
	
	Если НЕ ДокументооборотСКОВызовСервера.ТекущемуПользователюЭДОДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьИнформациюОВходящихСообщенияхЗавершение", ДокументооборотСКОКлиент);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

Процедура ПолучитьИнформациюОВходящихСообщенияхДляПользователяЭДО() Экспорт
	
	Если НЕ ДокументооборотСКОВызовСервера.ТекущемуПользователюЭДОДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьИнформациюОВходящихСообщенияхДляПользователяЭДОЗавершение", ДокументооборотСКОКлиент);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

Процедура ПредупредитьОбИстеченииСертификатов() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПредупредитьОбИстеченииСертификатовЗавершение", ДокументооборотСКОКлиент);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

