
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ВалютаДокументаUSD(ПараметрКоманды) Тогда 
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг", "Petrosakh", ПараметрКоманды,
			ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВалютаДокументаUSD(Док)
	
	Если Док.ВалютаДокумента <> Справочники.Валюты.НайтиПоНаименованию("USD") Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Форма ""Акт Petrosakh"" может быть сформирована только для документов в валюте ""USD"".");
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

