
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS() Тогда 
		СтандартнаяОбработка = Ложь;
		Поля.Добавить("Наименование");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS() Тогда 
		СтандартнаяОбработка = Ложь;
	  	Представление = Данные.Наименование;
	КонецЕсли;
	 	       
КонецПроцедуры

Функция ПолучитьПоTMSID(TMSID) Экспорт
	
	// Возвращает MOT по TMSID
	// Если MOT не найден или найдено несколько - возвращает Неопределено
	
	Если НЕ ЗначениеЗаполнено(TMSID) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("TMSID", TMSID);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	MOTsFromTMSIDs.Ссылка
		|ИЗ
		|	Справочник.MOTs.FromTMSIDs КАК MOTsFromTMSIDs
		|ГДЕ
		|	MOTsFromTMSIDs.FromTMSID = &TMSID
		|	И НЕ MOTsFromTMSIDs.Ссылка.ПометкаУдаления";
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() > 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции