
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ВалютаДокументаUSD(ПараметрКоманды) Тогда 
		
		ПараметрыФормы = Новый Структура("Ключ", ПараметрКоманды);
	
		ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаExxonУправляемая", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
										ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВалютаДокументаUSD(Док)
	
	Если Док.ВалютаДокумента <> Справочники.Валюты.НайтиПоНаименованию("USD") Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Форма ""Акт для Exxon"" может быть сформирована только для документов в валюте ""USD"".");
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

