
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.
	// register Хозрасчетный 
	#Если Клиент Тогда
	Для Каждого СтрокаТЧ Из Проводки Цикл
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.Организация = ОсновнаяОрганизация;
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами;
		Движение.Период = Дата;
		Движение.СчетДт = СтрокаТЧ.СчетУчета;
		Движение.ПодразделениеОрганизацииДт = СтрокаТЧ.Подразделение;
		Движение.ПодразделениеОрганизацииКт = СтрокаТЧ.Подразделение;
		Движение.Сумма = СтрокаТЧ.Сумма;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций] = СтрокаТЧ.Сотрудник;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения] = СтрокаТЧ.Подразделение;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = СтрокаТЧ.СтатьяЗатрат;
	КонецЦикла;
	#КонецЕсли
	// writing register movements
	Движения.Хозрасчетный.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
