
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Администратор 		= Параметры.Администратор;
	СписокПользователей = Параметры.СписокПользователей;
	РежимОткрытия 		= Параметры.РежимОткрытия;
	
	// { RGS Лунякин Иван 03.11.2015 16:29:30 
	ПолучитьНастройкиФормы();
	// } RGS Лунякин Иван 03.11.2015 16:29:30
	
КонецПроцедуры

// { RGS Лунякин Иван 03.11.2015 16:26:16

&НаСервере
Процедура ПолучитьНастройкиФормы()

	СтруктураНастроекФормы = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "НастройкаФорм");
	Если СтруктураНастроекФормы <> Неопределено Тогда
	   ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы + "/НастройкиФормы",,СтруктураНастроекФормы);
	КонецЕсли;
	СтруктураНастроекОкна = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "НастройкаОкна");
	Если СтруктураНастроекФормы <> Неопределено Тогда
	   ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы + "/НастройкиОкна",,СтруктураНастроекОкна);
	КонецЕсли;

КонецПроцедуры

// } RGS Лунякин Иван 03.11.2015 16:26:16

&НаКлиенте
Процедура ОК(Команда)
	
// Фёдорова 27.01.16 Добавлено условие
	Если РежимОткрытия = "Копирование" Тогда
		ПользователиПриемник = Новый Массив;
		Для Каждого Элемент Из СписокПользователей Цикл
			Если Элемент.Пометка Тогда
				ПользователиПриемник.Добавить(Элемент.Значение);
			КонецЕсли; 
		КонецЦикла;
	
		Если ПользователиПриемник.Количество() = 0 Тогда
			Предупреждение(НСтр("ru = 'Для копирования нужно отметить пользователей, которым требуется скопировать настройки.'; en = 'To copy should be noted users who want to copy settings.'"));
			Возврат;
		КонецЕсли;
	
		ТекстВопроса = НСтр("ru = 'После копирования настроек пользователю,
		|форма у пользователя будет открываться с настройками, которые ему скопируются. 
		|При этом его собственные настройки будут потеряны. 
		|Вы действительно хотите скопировать настройки выбранным пользователям'; en = 'After the printing-down of tuning to the user,
		|a form for an user will be opened with tuning that will be copied him. 
		|His own tuning will be lost thus. 
		|you really want to copy tuning to the chosen users'"); 
	
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	
		Оповестить("ПользователиВыбраны", Новый Структура("ПользователиПриемник", ПользователиПриемник)); 
		Закрыть();
	Иначе
		ПользователиПриемник = Новый Массив;
		Для Каждого Элемент Из СписокПользователей Цикл
			Если Элемент.Пометка Тогда
				ПользователиПриемник.Добавить(Элемент.Значение);
			КонецЕсли; 
		КонецЦикла;
		Оповестить("ПользователиДобавлены", Новый Структура("ПользователиПриемник", ПользователиПриемник)); 
		Закрыть();
	КонецЕсли;
// Фёдорова 27.01.16 Добавлено условие	
	
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

