
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ПроводкаDSS") 
		// { RGS LFedotova 01.02.2017 10:38:46 - вопрос SLI-0007126
		//добавила
		ИЛИ ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.СчетКнигиПокупок")
		// } RGS LFedotova 01.02.2017 10:39:32 - вопрос SLI-0007126
		Тогда
		URN = ПолучитьURN(ПараметрКоманды);
		Если ЗначениеЗаполнено(URN) Тогда
			ПараметрыФормы = Новый Структура("URN", URN);
			ОткрытьФорму("ОбщаяФорма.ПросмотрДокументовПоURN", ПараметрыФормы)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьURN(СсылкаНаДокумент)
	
	URN = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Urn");	
	Возврат URN;
КонецФункции
