
// { RGS ASeryakov, 19.09.2018 19:11:14 SLK-0001314
#Область Вопрос

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("TransportRequest") Тогда
		
		ГруппаОтбора1 = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(Список.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаОтбора1,
		"ДатаОкончанияДействия",
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
		ЭтаФорма.Параметры.TransportRequest.Дата,
		"Active date TNVED codes",
		Истина);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаОтбора1,
		"ДатаОкончанияДействия",
		ВидСравненияКомпоновкиДанных.НеЗаполнено,
		,
		"No expiration codes TNVED",
		Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработкаВыбораТНВЭД(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораТНВЭД(ВыбранноеЗначение)
	
	СтандартнаяОбработка = Ложь;
	Оповестить("ВыборТНВЭД", ВыбранноеЗначение, ВладелецФормы);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
