
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла",  ПараметрКоманды);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ПараметрыВыполненияКоманды.Источник.ТолькоПросмотр);
	
	//{начало добавления RG-Soft добавила Петроченко Н.Н.
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
		// { RGS LFedotova 18.12.2017 23:22:43 - вопрос SLI-0007442
		ИЛИ ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ПередачаОС")
		ИЛИ ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ОтчетАгентаПоРасходам")
		// } RGS LFedotova 18.12.2017 23:23:03 - вопрос SLI-0007442
		Тогда
		ПараметрыФормы.Вставить("ДополнительныеРеквизиты", "ВидДокумента");
		// { RGS AArsentev 07.09.2016 17:38:05 - S-I-0001855
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.TransportRequest") ИЛИ ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.TripNonLawsonCompanies") Тогда 
		ПараметрыФормы.Вставить("ДополнительныеРеквизиты", "ВидДокумента,ДокументНаименование,ДатаДокумента");
		// } RGS AArsentev 07.09.2016 17:38:05 - S-I-0001855
	КонецЕсли; //}конец добавления RG-Soft добавила Петроченко Н.Н.
	
	ОткрытьФорму("ОбщаяФорма.ПрисоединенныеФайлы",
	             ПараметрыФормы,
	             ПараметрыВыполненияКоманды.Источник,
	             ПараметрыВыполненияКоманды.Уникальность,
	             ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
