// { RGS MYurkevich 02.02.2015 14:16:12 - TP-00000673
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Перем ЭтоРеализация;
	Если Параметры.Свойство("ЭтоРеализация", ЭтоРеализация) Тогда
		СтандартнаяОбработка = Ложь;
		спВыбора = Новый СписокЗначений;
		Если НЕ ПустаяСтрока(Параметры.СтрокаПоиска) Тогда
			ВведенныйТекст = Параметры.СтрокаПоиска + "%";
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 50
			|	Номенклатура.Ссылка,
			|	Номенклатура.Наименование
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Catalog.Код ПОДОБНО &ВведенныйТекст";
			
			Запрос.УстановитьПараметр("ВведенныйТекст", ВведенныйТекст);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					спВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);
				КонецЦикла;
				
			Иначе
				Каталог = Справочники.Catalog.НайтиПоКоду(Параметры.СтрокаПоиска);
				Если ЗначениеЗаполнено(Каталог) Тогда
					НоваяНоменклатура = СоздатьЭлемент();
					НоваяНоменклатура.Catalog = Каталог;
					НоваяНоменклатура.Наименование = Каталог.DescriptionRus;
					НоваяНоменклатура.НаименованиеENG = Каталог.DescriptionEng;
					НоваяНоменклатура.НаименованиеПолное = Каталог.DescriptionRus;
					Попытка
						НоваяНоменклатура.Записать();
					Исключение
					КонецПопытки;
					спВыбора.Добавить(НоваяНоменклатура.Ссылка, НоваяНоменклатура.Наименование);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
		ДанныеВыбора = спВыбора;
	КонецЕсли;	
КонецПроцедуры
// } RGS MYurkevich 02.02.2015 14:16:27 - TP-00000673
