
///////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ СПРАВОЧНИКА

// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
	
	ДозаполнитьРеквизиты();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеРеквизитов(Отказ);
	
КонецПроцедуры

Процедура ДозаполнитьРеквизиты()
	
	РГСофтКлиентСервер.УстановитьЗначение(Код, СформироватьКод());
	РГСофтКлиентСервер.УстановитьЗначение(Value, СокрЛП(Value));
	РГСофтКлиентСервер.УстановитьЗначение(GoodsDescription, СокрЛП(GoodsDescription));
	POAs.Свернуть("POA", "");
	ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(POAs, "POA");
		
	Если НЕ ЗначениеЗаполнено(CreatedBy) Тогда
		CreatedBy = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(CreationDate) Тогда
		CreationDate = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ModifiedBy) Тогда
		ModifiedBy = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ModificationDate) Тогда
		ModificationDate = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьКод()
		
	НовыйКод = "" + Field + " = ";
	
	Если Field = Перечисления.FieldsForRulesOfCVCRisks.Description Тогда
		НовыйКод = НовыйКод + "*";
	КонецЕсли; 
	
	НовыйКод = НовыйКод + Value;
	
	Если Field = Перечисления.FieldsForRulesOfCVCRisks.Description Тогда
		НовыйКод = НовыйКод + "*";
	КонецЕсли;
	
	Возврат НовыйКод;
	
КонецФункции 

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления ИЛИ ЭтоГруппа Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Field) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Field"" не заполнено!",
			ЭтотОбъект, "Field", , Отказ);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Value) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Value"" не заполнено!",
			ЭтотОбъект, "Value", , Отказ);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(TNVEDCode) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""TN VED code"" не заполнено!",
			ЭтотОбъект, "TNVEDCode", , Отказ);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(CustomsDemand) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Customs demand"" не заполнено!",
			ЭтотОбъект, "CustomsDemand", , Отказ);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Currency) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Currency"" не заполнено!",
			ЭтотОбъект, "Currency", , Отказ);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(GoodsDescription) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Goods description"" не заполнено!",
			ЭтотОбъект, "GoodsDescription", , Отказ);	
	КонецЕсли;
	
КонецПроцедуры
