
Процедура ПередЗаписью(Отказ, Замещение)
	
	//устанавливаем инвойсинговый центр
	//Для Каждого Запись Из ЭтотОбъект Цикл
	//	Запись.ПодразделениеОрганизации = Привилегированный.ПолучитьПодразделениеНачисленияАмортизации(Запись.ПодразделениеОрганизации);			
	//КонецЦикла;
	//
	////перемещение регистрируем два раза - для обоих подразделений
	//Попытка 
	//	Если ТипЗнч(ЭтотОбъект.Регистратор) = Тип("ДокументСсылка.ПеремещениеОС") И 
	//	Не Привилегированный.ПолучитьПодразделениеНачисленияАмортизации(Регистратор.Местонахождение) = Привилегированный.ПолучитьПодразделениеНачисленияАмортизации(Регистратор.ПодразделениеОрганизации)Тогда
	//		НоваяЗапись = ЭтотОбъект.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
	//		НоваяЗапись.ПодразделениеОрганизации = Привилегированный.ПолучитьПодразделениеНачисленияАмортизации(Регистратор.Местонахождение);
	//	КонецЕсли;	
	//Исключение
	//КонецПопытки;
	
КонецПроцедуры
