
Функция ПолучитьПоTMSID(TMSID) Экспорт
	
	Возврат РГСофт.НайтиСсылку("Справочник", "CountriesOfProcessLevels", "TMSID", TMSID);
	
КонецФункции

Функция ПолучитьМестнуюВалюту(Country) Экспорт
	
	Если Country = Справочники.CountriesOfProcessLevels.RU Тогда 
		
		Возврат Справочники.Валюты.НайтиПоКоду("643");
		
	ИначеЕсли Country = Справочники.CountriesOfProcessLevels.KZ Тогда 
		
		Возврат Справочники.Валюты.НайтиПоНаименованию("KZT");
		
	ИначеЕсли Country = Справочники.CountriesOfProcessLevels.AZ Тогда 
		
		ВалютаAZ = Справочники.Валюты.НайтиПоНаименованию("AZM");
		Если Не ЗначениеЗаполнено(ВалютаAZ) Тогда 
			ВалютаAZ = Справочники.Валюты.НайтиПоНаименованию("AZN");
		КонецЕсли;
		
		Возврат ВалютаAZ;
		
	ИначеЕсли Country = Справочники.CountriesOfProcessLevels.TM Тогда 
		
		Возврат Справочники.Валюты.НайтиПоНаименованию("TMT");
		
	ИначеЕсли Country = Справочники.CountriesOfProcessLevels.UZ Тогда 
		
		Возврат Справочники.Валюты.НайтиПоНаименованию("UZS");
		
	ИначеЕсли Country = Справочники.CountriesOfProcessLevels.GE Тогда 
		
		Возврат Справочники.Валюты.НайтиПоНаименованию("GEL");
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;

КонецФункции