
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.РаспределениеМатериаловИзКнигиПокупок") тогда 
		ДокументСписок = Новый СписокЗначений;
		Для Каждого Стр из ПараметрКоманды.MandS цикл
			Если ТипЗнч(Стр.ПроводкаДеталейСКП.Документ) = Тип("ДокументСсылка.СчетКнигиПокупок") тогда
				СтрокаДок = ДокументСписок.Добавить(Стр.ПроводкаДеталейСКП.Документ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ВладелецФайла,ТолькоПросмотр", ДокументСписок, Ложь);
	ОткрытьФорму("ОбщаяФорма.ПрисоединенныеФайлыМножественныйВладелец", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

