
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаDetails Из Details Цикл
		// регистр НоменклатураСиблОрдеров Приход
		Если не (сокрлп(ТекСтрокаDetails.ParentLineID)="" или сокрлп(ТекСтрокаDetails.PartNumber)="") тогда
			Движение = Движения.НоменклатураСиблОрдеров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Заказ = Ссылка;
			Движение.НомерСтрокиДокумента = ТекСтрокаDetails.НомерСтроки;
			//Движение.Сумма = ТекСтрокаDetails.Сумма; // суммы нет
			Движение.Количество = ТекСтрокаDetails.Количество;
		КонецЕсли;
	КонецЦикла;
	// записываем движения регистров
	Движения.НоменклатураСиблОрдеров.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	// { RGS LFedotova 16.11.2017 11:56:14 - вопрос S-B-0000189
	Попытка 
		НаименованиеИЦ = ОбъектКопирования.ИнвойсинговыйЦентр.Наименование; //если вместо инвойсингового центра битая ссылка или пустое значение, то наименование прочитать не сможем
	Исключение
		ЭтотОбъект.Ответственный =  Пользователи.ТекущийПользователь();
		ЭтотОбъект.ИнвойсинговыйЦентр = РГСофтСерверПовтИспСеанс.ПолучитьЗначениеПоУмолчанию(Пользователи.ТекущийПользователь(), "ОсновнойИнвойсинговыйЦентр");
	КонецПопытки;
	// } RGS LFedotova 16.11.2017 11:56:35 - вопрос S-B-0000189
КонецПроцедуры
