
&НаКлиенте
Процедура ОстановитьОбмены(Команда)
	
	ИзменитьОбменыСервер(Ложь);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбмены(Команда)
	
	ИзменитьОбменыСервер(Истина);
    Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОбменыСервер(Флаг)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменСВнешнимиИБ.Ссылка
	|ИЗ
	|	ПланОбмена.ргОбменСВнешнимиИБ КАК ОбменСВнешнимиИБ
	|ГДЕ
	|	ОбменСВнешнимиИБ.Код <> ""000000001""
	|	И НЕ ОбменСВнешнимиИБ.ПометкаУдаления";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ПланОбменаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПланОбменаОбъект.Активен = Флаг;
		ПланОбменаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	
	ОткрытьФорму("Обработка.ргВыгрузкаВоВнешниеИБ.Форма.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияИзменений(Команда)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Структура = Новый Структура;
	Если ТекСтрока<>Неопределено Тогда
		Структура.Вставить("УзелОбмена", ТекСтрока);	
	КонецЕсли; 
	
	ОткрытьФорму("Обработка.ргРегистрацияИзмененийДляОбменаДанными.Форма.Форма", Структура);
	
КонецПроцедуры
 