
&НаКлиенте
Процедура УстановитьПоУмолчанию(Команда)
	
	ИдентификаторРабочейБазы = Константы.FiscalParentCompany.Получить();
	
	Если НЕ ИдентификаторРабочейБазы = Справочники.SoldTo.НайтиПоКоду("SLI RU") И НЕ ИдентификаторРабочейБазы = Справочники.SoldTo.НайтиПоКоду("PA") Тогда
		Сообщить("Идентификатор рабочей базы неизвестен, обратитесь к администратору для установки верного идентификатора");
		Возврат;	
	КонецЕсли;		
	
	Если  ИдентификаторРабочейБазы = Справочники.SoldTo.НайтиПоКоду("PA") Тогда
		
		Объект.СправочникКонтрагентыКипр 			= Истина;	
		Объект.ДокументTicketsКипр 					= Истина;
		Объект.ДокументРеализацияТоваровУслугКипр	= Истина;
		Объект.ДокументСчетНаОплатуПокупателюКипр	= Истина;
		Объект.ДокументSiebelOrdersКипр				= Истина; 		
		
		Объект.ДокументРеализацияТоваровУслугSLI	= Ложь;
		Объект.ДокументСчетНаОплатуПокупателюSLI	= Ложь;
		
	Иначе
		
		Объект.ДокументРеализацияТоваровУслугSLI	= Истина;
		Объект.ДокументСчетНаОплатуПокупателюSLI	= Истина;
		
		Объект.СправочникКонтрагентыКипр 			= Ложь;
		Объект.ДокументTicketsКипр 					= Ложь;
		Объект.ДокументРеализацияТоваровУслугКипр	= Ложь;
		Объект.ДокументСчетНаОплатуПокупателюКипр	= Ложь;
		Объект.ДокументSiebelOrdersКипр				= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры
