&НаКлиенте
Перем КонтекстЭДОКлиент;

&НаКлиенте
Перем МассивОтправляемыхОписей, ИндексОтправляемойОписи, СоответствиеОписьОтправлена;

&НаКлиенте
Перем ФормаДлительнаяОперация;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОписьВходящихДокументов = Параметры.ОписьВходящихДокументов;
	ПоложительныйРезультатПриема = Параметры.ПоложительныйРезультатПриема;
	Если ПоложительныйРезультатПриема Тогда
		Заголовок = "Подтверждение приема документов";
		ТекстКнопки = "Подтвердить прием всех";
	Иначе
		Заголовок = "Отказ в приеме документов";
		ТекстКнопки = "Отказать в приеме всех";
	КонецЕсли;
	Элементы.СформироватьРезультатПриема.Заголовок = ТекстКнопки;
	ЗаполнитьТаблицуДокументовОписи(ОписьВходящихДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДокументовОписи(ОписьВходящихДокументов)
	
	ЕстьНеотправленныеОписи = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОписиВходящихДокументовИзНалоговыхОргановВходящиеДокументы.НомерСтроки КАК НомерСтроки,
	|	ОписиВходящихДокументовИзНалоговыхОргановВходящиеДокументы.СсылкаНаОбъект КАК Документ
	|ИЗ
	|	Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.ВходящиеДокументы КАК ОписиВходящихДокументовИзНалоговыхОргановВходящиеДокументы
	|ГДЕ
	|	ОписиВходящихДокументовИзНалоговыхОргановВходящиеДокументы.Ссылка = &ОписьВходящихДокументов";
	
	Запрос.УстановитьПараметр("ОписьВходящихДокументов", ОписьВходящихДокументов); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаДокументовОписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

