
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ОбработкаПолучателей", ЭтотОбъект, ПараметрКоманды), 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "NotificationRecipients"), "Please fill notification recipients / Форма заполнения получателей уведомлений", 
		300, Истина);
	        	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолучателей(NotificationRecipients, допПараметр) Экспорт
	
	МассивСтруктур = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(NotificationRecipients);
	Отказ = Ложь;
	
	МассивNotificationRecipients = Новый Массив;
	Для Каждого Структура из МассивСтруктур Цикл 
		
		Если ЗначениеЗаполнено(Структура.ОписаниеОшибки) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"E-mail '" + Структура.Псевдоним + "': " + Структура.ОписаниеОшибки,
			, , , Отказ);
			
		Иначе 
			МассивNotificationRecipients.Добавить(Структура.Адрес);
		КонецЕсли;
		
	КонецЦикла;

	Если Не Отказ Тогда 
		МассивNotificationRecipients = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивNotificationRecipients);
		NotificationRecipientsFinal = РГСофтКлиентСервер.ПолучитьСтрокуИзМассиваПодстрокСокрЛП(МассивNotificationRecipients, ";");
		
		ДобавитьПолучателейНаСервере(допПараметр, NotificationRecipientsFinal);
		Оповестить("ИзменилсяCommentTR");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьПолучателейНаСервере(TRСсылка, NotificationRecipients)
	
	УстановитьПривилегированныйРежим(Истина);
	
	TRОбъект = TRСсылка.ПолучитьОбъект();
	TRОбъект.ОбменДанными.Загрузка = Истина;
	TRОбъект.NotificationRecipients = NotificationRecipients;
	TRОбъект.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры