
Процедура ПередЗаписью(Отказ)
	
	ДозаполнитьРеквизиты();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеРеквизитов(Отказ);
		
КонецПроцедуры

Процедура ДозаполнитьРеквизиты()
	
	РГСофтКлиентСервер.УстановитьЗначение(Код, СокрЛП(Код));
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СокрЛП(Код)) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Code"" не заполнено!",
			ЭтотОбъект, "Код", , Отказ);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ResponsibleForOutOfCompliance) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Responsible for out of compliance"" не заполнено!",
			ЭтотОбъект, "ResponsibleForOutOfCompliance", , Отказ);
	КонецЕсли;
	
КонецПроцедуры
