
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Документ", ПараметрКоманды);
	

	//RGS Добавила Фёдорова RCA-0000161 09.06.16
	
	// { RGS LFedotova 14.09.2016 22:42:08 - вопрос SLI-0006782
	//Если ПараметрКоманды.ПолучитьОбъект().Метаданные().Реквизиты.Найти("ДатаПроведения") <> Неопределено Тогда
	Если ЕстьРеквизитДокумента("ДатаПроведения",ПараметрКоманды) <> Неопределено Тогда
	// } RGS LFedotova 14.09.2016 22:42:58 - вопрос SLI-0006782
		
	    // { RGS LFedotova 14.09.2016 22:44:33 - вопрос SLI-0006782
		//ДатаДокумента = ПараметрКоманды.ДатаПроведения;
		ДатаДокумента = ВернутьДатуПроведения(ПараметрКоманды);
		// } RGS LFedotova 14.09.2016 22:45:00 - вопрос SLI-0006782
		
		НачалоОткрытогоПериодаМодуля = ПроверкаОткрытогоПериода(ПараметрКоманды); 
		
		Если НачалоОткрытогоПериодаМодуля <> Неопределено Тогда
			Если ДатаДокумента < НачалоОткрытогоПериодаМодуля Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Редактирование записей регистра в закрытом периоде запрещена!";
				Сообщение.Сообщить(); 
				ПараметрыФормы.Вставить("ПарметрОткрытия", Ложь);
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли; 
	// RGS конец добавления Фёдорова RCA-0000161 09.06.16

	ОткрытьФорму("ОбщаяФорма.ФормаНомеровLawsonУправляемая", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

// { RGS добавила LFedotova 14.09.2016 22:45:43 - вопрос SLI-0006782
&НаСервере
Функция ЕстьРеквизитДокумента(ИмяРеквизита, ДокументСсылка)

	МетаданныеДокумента = ДокументСсылка.ПолучитьОбъект().Метаданные();	
	Возврат НЕ (МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) = Неопределено);

КонецФункции
// } RGS LFedotova 14.09.2016 22:45:51 - вопрос SLI-0006782

// { RGS добавила LFedotova 14.09.2016 22:45:43 - вопрос SLI-0006782
&НаСервере
Функция ВернутьДатуПроведения(ДокументСсылка)

	Возврат ДокументСсылка.ДатаПроведения;

КонецФункции
// } RGS LFedotova 14.09.2016 22:45:51 - вопрос SLI-0006782
 

&НаСервере
Функция ПроверкаОткрытогоПериода(Ссылка)
	
	Модуль = НастройкаПравДоступа.ПолучитьМодульРазработкиДокумента(Ссылка);	 

	Возврат НастройкаПравДоступа.ПолучитьНачалоОткрытогоУправленческогоПериодаМодуля(Модуль);
КонецФункции
