&НаКлиенте
Процедура ПутьДокументыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборФайла();
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайла()
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//Диалог.Каталог = Элемент.Значение;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "XLS (*.xlsx)|*.xlsx|*.xls";
	Диалог.Заголовок = "Выберите файл...";
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	Если Диалог.ВыбранныеФайлы.Количество()<>0 Тогда
		ПутьФайла = Диалог.ВыбранныеФайлы[0];
		Объект.ПутьФайл = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьПользователю(Текст, ПутьКДанным = "")
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.ПутьКДанным = ПутьКДанным;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ВыбранноеИмяФайла = Объект.ПутьФайл;
	Файл = Новый Файл(ВыбранноеИмяФайла);
	Если Не Файл.Существует() Тогда
		
		ТекстСообщения = Нстр("ru = 'Указанный файл не существует'");
		ПутьКДанным = ?(Объект.НаКлиенте, "", "ИмяФайлаЗагрузки");
		СообщитьПользователю(ТекстСообщения, ПутьКДанным);
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьДанныеЗавершение", ЭтаФорма);
	НачатьПомещениеФайла(ОписаниеОповещения,Объект.ВоВременномХранилище,Объект.ПутьФайл,Ложь,ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры)
	Объект.ВоВременномХранилище = Адрес;
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ЗагрузитьТаблицу();
КонецПроцедуры