////////////////////////////////////////////////////////////////////////////////
// Подсистема "Префиксация объектов"
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик события "При получении номера на печать".
// Событие возникает перед стандартной обработкой получения номера.
// В обработчике можно переопределить стандартное поведение системы при формировании номера на печать.
//
// Параметры:
//  НомерОбъекта         - Строка - номер или код объекта, который обрабатывается
//  СтандартнаяОбработка - Булево - флаг стандартной обработки; если установить значение флага в Ложь,
//									то стандартная обработка формирования номера на печать выполняться не будет
// 
// Пример реализации кода обработчика:
// 
//	НомерОбъекта = ПрефиксацияОбъектовКлиентСервер.УдалитьПользовательскиеПрефиксыИзНомераОбъекта(НомерОбъекта);
//	СтандартнаяОбработка = Ложь;
// 
Процедура ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка) Экспорт
	
	//Обновление рег. Отчетности на бух. Корп 3.0.37.25
	//ПозицияРазделителя = СтрНайти(НомерОбъекта, "-");
	//Если ПозицияРазделителя = 3 ИЛИ ПозицияРазделителя = 5 Тогда
	//	Возврат;
	//КонецЕсли;
	//
	////Номер не соответствует формату
	//
	//НомерОбъекта = ОбщегоНазначенияБПВызовСервера.ПолучитьНомерБП20(НомерОбъекта);
	//СтандартнаяОбработка = Ложь; 
	//<=
		
КонецПроцедуры

#КонецОбласти
