
Процедура ПередЗаписью(Отказ)
	
	ОбщегоНазначения.УстановитьЗначение(Наименование, СокрЛП(Наименование));
	
	Если НЕ ПометкаУдаления Тогда
		ПроверитьЗаполнениеРеквизитов(Отказ);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Code"" не заполнено!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Name"" не заполнено!",
			ЭтотОбъект, "Наименование", , Отказ);
	КонецЕсли;
			               	
КонецПроцедуры