
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура ПоказатьПредупреждениеОПовторныхКорректировках()
	
	ОбщегоНазначенияБПКлиент.ПоказатьПредупреждениеОбИзменениях("ПовторнаяКорректировкаПоступления", , НастройкиПредупреждений);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//Обновление на бух. корп. 3.0.38.43
	//// СтандартныеПодсистемы.Печать
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаПечать);
	//// Конец СтандартныеПодсистемы.Печать
	//
	//// ДополнительныеОтчетыИОбработки
	//ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	//// Конец ДополнительныеОтчетыИОбработки
	//
	//// СтандартныеПодсистемы.ВерсионированиеОбъектов
	//ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	//// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	//<=
	
	//Обновление на бух. корп. 3.0.38.43
	//ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма);
	//<=
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Документы.СчетФактураПолученный);
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактировать;
	
	// Уведомим о появлении нового функционала
	НастройкиПредупреждений = ОбщегоНазначенияБП.НастройкиПредупрежденийОбИзменениях("ПовторнаяКорректировкаПоступления");
	
	//Обновление на бух. корп. 3.0.38.43
	//// Заполнение группы информационных ссылок
	//ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	//<=
	
	ПроверкаКонтрагентов.ФормаСпискаПриСозданииНаСервере(Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПоказатьПредупреждениеОПовторныхКорректировках", 0.5, 1);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СПИСОК

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	ДанныеСтроки = Элемент.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеСтроки.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаПоступление") Тогда
		Если ТипЗнч(ДанныеСтроки.ДокументОснование) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
			КлючеваяОперация = "ОткрытиеФормыСчетФактураПолученныйБланкСтрогойОтчетности";
		Иначе
			КлючеваяОперация = "ОткрытиеФормыСчетФактураПолученныйНаПоступление";
		КонецЕсли;
	ИначеЕсли ДанныеСтроки.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАванс")
		ИЛИ ДанныеСтроки.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАвансКомитента") Тогда
		КлючеваяОперация = "ОткрытиеФормыСчетФактураПолученныйНаАванс";
	ИначеЕсли ДанныеСтроки.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.Корректировочный") Тогда
		КлючеваяОперация = "ОткрытиеФормыСчетФактураПолученныйКорректировочный";
	КонецЕсли;
	
	//Обновление на бух. корп. 3.0.38.43
	//ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);
	//<=

КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)

	ОбщегоНазначенияБП.ВосстановитьОтборСписка(Список, Настройки, "Организация");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	//Обновление на бух. корп. 3.0.38.43
	//ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	//<=
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	//Обновление на бух. корп. 3.0.38.43
	//ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	//<=
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	//Обновление на бух. корп. 3.0.38.43
	//ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	//<=

КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетФактуруПоступление(Команда)
	
	//Обновление на бух. корп. 3.0.38.43
	//КлючеваяОперация = "СозданиеФормыСчетФактураПолученныйНаПоступление";
	//ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);
	//<=
	
	СтруктураПараметров = ПолучитьСтруктуруПараметровФормы(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаПоступление"));
	ОткрытьФорму("Документ.СчетФактураПолученный.Форма.ФормаДокументаНаПоступление", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетФактураАванс(Команда)

	//Обновление на бух. корп. 3.0.38.43
	//КлючеваяОперация = "СозданиеФормыСчетФактураПолученныйНаАванс";
	//ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);
	//<=
	
	СтруктураПараметров = ПолучитьСтруктуруПараметровФормы(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАванс"));
	ОткрытьФорму("Документ.СчетФактураПолученный.Форма.ФормаДокументаНаАванс", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетФактуруАвансКомитента(Команда)
	
	//Обновление на бух. корп. 3.0.38.43
	//КлючеваяОперация = "СозданиеФормыСчетФактураПолученныйНаАванс";
	//ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);
	//<=
	
	СтруктураПараметров = ПолучитьСтруктуруПараметровФормы(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАвансКомитента"));
	ОткрытьФорму("Документ.СчетФактураПолученный.Форма.ФормаДокументаНаАванс", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетФактураКорректировочный(Команда)
	
	// Для корректировочного счета-фактуры показывается сначала форма подбора исходного документа,
	// поэтому счетчик для него здесь не включаем.

	СтруктураПараметров = ПолучитьСтруктуруПараметровФормы(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.Корректировочный"));
	ОткрытьФорму("Документ.СчетФактураПолученный.Форма.ФормаПодбора", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетФактураИсправление(Команда)

	// Для исправленного счета-фактуры показывается сначала форма подбора исходного документа,
	// поэтому счетчик для него здесь не включаем.
	
	СтруктураПараметров = ПолучитьСтруктуруПараметровФормы(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.ПустаяСсылка"));
	ОткрытьФорму("Документ.СчетФактураПолученный.Форма.ФормаПодбора", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналСчетовФактур(Команда)
	
	СтруктураПараметров = Новый Структура;
	ОтборПоОрганизации  = ВернутьПолеПользовательскогоОтбораКомпоновки(ЭтаФорма,, "Организация");
	
	Если ОтборПоОрганизации <> Неопределено И ОтборПоОрганизации.Использование Тогда
		СтруктураПараметров.Вставить("Организация", ОтборПоОрганизации.ПравоеЗначение);
	КонецЕсли;
	
	ОткрытьФорму("Отчет.ЖурналУчетаСчетовФактур.Форма", СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКнигуПокупок(Команда)
	
	СтруктураПараметров = Новый Структура;
	ОтборПоОрганизации  = ВернутьПолеПользовательскогоОтбораКомпоновки(ЭтаФорма,, "Организация");
	
	Если ОтборПоОрганизации <> Неопределено И ОтборПоОрганизации.Использование Тогда
		СтруктураПараметров.Вставить("Организация", ОтборПоОрганизации.ПравоеЗначение);
	КонецЕсли;
	
	ОткрытьФорму("Отчет.КнигаПокупок.Форма", СтруктураПараметров);
	
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПолучитьСтруктуруПараметровФормы(ВидСчетаФактуры)
	
	СтруктураПараметров = Новый Структура;
	
	ОтборПоОрганизации  = ВернутьПолеПользовательскогоОтбораКомпоновки(ЭтаФорма,, "Организация");
	ОтборПоКонтрагенту 	= ВернутьПолеПользовательскогоОтбораКомпоновки(ЭтаФорма,, "Контрагент");
	
	ЗначенияЗаполнения = Новый Структура();
	
	Если ОтборПоОрганизации <> Неопределено И ОтборПоОрганизации.Использование И ЗначениеЗаполнено(ОтборПоОрганизации.ПравоеЗначение) Тогда
		ЗначенияЗаполнения.Вставить("Организация", ОтборПоОрганизации.ПравоеЗначение);
	КонецЕсли;
	
	Если ОтборПоКонтрагенту <> Неопределено И ОтборПоКонтрагенту.Использование И ЗначениеЗаполнено(ОтборПоКонтрагенту.ПравоеЗначение) Тогда
		ЗначенияЗаполнения.Вставить("Контрагент", ОтборПоКонтрагенту.ПравоеЗначение);
	КонецЕсли;
	
	ЗначенияЗаполнения.Вставить("ВидСчетаФактуры", ВидСчетаФактуры);
	
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Если ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.Корректировочный")
		ИЛИ ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.ПустаяСсылка") Тогда
		
		ЗначениеОтбора = Новый Структура();
		ЗначениеОтбора.Вставить("Исправление", Ложь);
		
		Если ОтборПоОрганизации <> Неопределено Тогда
			ЗначениеОтбора.Вставить("Организация", ОтборПоОрганизации.ПравоеЗначение);
			ЗначениеОтбора.Вставить("ОрганизацияИспользование", ОтборПоОрганизации.Использование);
		КонецЕсли;

		Если ОтборПоКонтрагенту <> Неопределено Тогда
			ЗначениеОтбора.Вставить("Контрагент", ОтборПоКонтрагенту.ПравоеЗначение);
			ЗначениеОтбора.Вставить("КонтрагентИспользование", ОтборПоКонтрагенту.Использование);
		КонецЕсли;
		
		СтруктураПараметров.Вставить("Отбор", ЗначениеОтбора); 
		
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВернутьПолеПользовательскогоОтбораКомпоновки(Форма, Настройки = Неопределено, Знач ИмяПоля)
	
	Если Настройки = Неопределено Тогда
		Настройки = Форма.Список.КомпоновщикНастроек.ПользовательскиеНастройки;
	КонецЕсли;
	
	ПолеОтбораКомпоновки = Неопределено;
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для каждого ЭлементОтбора Из Форма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ЛевоеЗначение Тогда
			ПолеОтбораКомпоновки = Настройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПолеОтбораКомпоновки;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Элементы.Список);
	
КонецПроцедуры


// Конец СтандартныеПодсистемы.Печать