
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("Специалист", Пользователи.ТекущийПользователь());
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"Подрядчик",
	ПараметрыСеанса.ТекущийПользователь,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"Координатор",
	ПараметрыСеанса.ТекущийПользователь,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"СпециалистБиллинга",
	ПараметрыСеанса.ТекущийПользователь,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"ПериодОказанияУслугНачало",
	ПараметрыСеанса.ТекущийПользователь,
	ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
	,
	Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"ПериодОказанияУслугОкончание",
	ПараметрыСеанса.ТекущийПользователь,
	ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
	,
	Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"Ссылка.ПометкаУдаления",
	Ложь,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	Истина,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеСпискаРеестров" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры
