
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗадатьОформление(Параметры.ПараметрОформления);
	
	Для Каждого Строка Из Параметры.ДанныеРасшифровки Цикл
		Если Строка.План = 0 Тогда
			СтрокаТЧ = ТаблицаРасшифровки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Строка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗадатьОформление(ПараметрОформления)
	
	Если ПараметрОформления = 1 Тогда
		Элементы.ТаблицаРасшифровкиФакт.Видимость = Истина;
		Элементы.ТаблицаРасшифровкиAccessorialCost.Видимость = Истина;
	ИначеЕсли ПараметрОформления = 2 Тогда
		Элементы.ТаблицаРасшифровкиWeightФакт.Видимость = Истина;
	ИначеЕсли ПараметрОформления = 3 Тогда
		Элементы.ТаблицаРасшифровкиWeightФакт.Видимость = Истина;
	ИначеЕсли ПараметрОформления = 4 Тогда
		Элементы.ТаблицаРасшифровкиTnKmФакт.Видимость = Истина;
	ИначеЕсли ПараметрОформления = 5 Тогда
		Элементы.ТаблицаРасшифровкиDuration.Видимость = Истина;
	ИначеЕсли ПараметрОформления = 6 Тогда
		Элементы.ТаблицаРасшифровкиФакт.Видимость = Истина;
		Элементы.ТаблицаРасшифровкиAccessorialCost.Видимость = Истина;
		Элементы.ТаблицаРасшифровкиProject.Видимость = Ложь;
		Элементы.ТаблицаРасшифровкиTypeOfTransport.Видимость = Ложь;
		Элементы.ТаблицаРасшифровкиServiceProvider.Видимость = Ложь;
	ИначеЕсли ПараметрОформления = 7 Тогда
		Элементы.ТаблицаРасшифровкиWeightФакт.Видимость = Истина;
		Элементы.ТаблицаРасшифровкиProject.Видимость = Ложь;
		Элементы.ТаблицаРасшифровкиTypeOfTransport.Видимость = Ложь;
		Элементы.ТаблицаРасшифровкиServiceProvider.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасшифровкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ТаблицаРасшифровки.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда 
		ПоказатьЗначение(, ТекДанные.Trip);
	КонецЕсли;
	
КонецПроцедуры
