
Процедура ПриЗаписи(Отказ)
	
	Строка = Новый Структура;
	Строка.Вставить("Account", 0);
	Строка.Вставить("AccountNumber", 0);
    Строка.Вставить("AccountDesc", 0);
	Строка.Вставить("AccountUnit", 0);
	Строка.Вставить("AccountingPeriod", 0);
    Строка.Вставить("AcctUnitDesc", 0);
	Строка.Вставить("Activity", 0);
	Строка.Вставить("AktDate", 0);
	Строка.Вставить("AktOfAcceptance", 0);
	Строка.Вставить("ApInvoice", 0);
    Строка.Вставить("ApTransFormId", 0);
	Строка.Вставить("ArInvoice", 0);
	Строка.Вставить("Area", 0);
	Строка.Вставить("AreaDesc", 0);
	Строка.Вставить("Asset", 0);
	Строка.Вставить("AssetCode", 0);
	Строка.Вставить("AstSerialNbr", 0);
	Строка.Вставить("AutoRev", 0);
    Строка.Вставить("BaseAmount", 0);
    Строка.Вставить("BusSeg", 0);
    Строка.Вставить("CashCode", 0);
	Строка.Вставить("Company", 0);
	Строка.Вставить("ContractNumber", 0);
	Строка.Вставить("CurrencyCode", 0);
	Строка.Вставить("CustomerName", 0);
    Строка.Вставить("CustomerNumber", 0);
    Строка.Вставить("Date", 0);
	Строка.Вставить("Description", 0);
	Строка.Вставить("FiscalYear", 0);
	Строка.Вставить("Geo", 0);
	Строка.Вставить("GeoDesc", 0);
	Строка.Вставить("Item", 0);
    Строка.Вставить("ItemDescription", 0);
    Строка.Вставить("JeType", 0);
    Строка.Вставить("Journal", 0);
    Строка.Вставить("LegalFiscalFlag", 0);
    Строка.Вставить("LineNbr", 0);
    Строка.Вставить("LineNbrIc", 0);
    Строка.Вставить("Location", 0);
	Строка.Вставить("LocationDesc", 0);
	Строка.Вставить("MgmtNIS_BLSummaryAcct", 0);
	Строка.Вставить("Mgmtctry", 0);
	Строка.Вставить("MgmtctryDesc", 0);
	Строка.Вставить("Operator", 0);
	Строка.Вставить("OrigOperatorId", 0);
	Строка.Вставить("PoCode", 0);
	Строка.Вставить("PoNumber", 0);
	Строка.Вставить("PostingDate", 0);
	Строка.Вставить("ProcessLevel", 0);
	Строка.Вставить("Reference", 0);
	Строка.Вставить("SegDesc", 0);
    Строка.Вставить("SeqTrnsNbr", 0);
	Строка.Вставить("SourceCode", 0);
	Строка.Вставить("SubAccount", 0);
	Строка.Вставить("SubGeo", 0);
    Строка.Вставить("SubSeg", 0);
	Строка.Вставить("SubSubSeg", 0);
	Строка.Вставить("SubgeoDesc", 0);
	Строка.Вставить("SubsegDesc", 0);
	Строка.Вставить("SubsubsegDesc", 0);
	Строка.Вставить("SummaryAcct", 0);
	Строка.Вставить("SumAcctNumber", 0);
	Строка.Вставить("SummaryAcctDesc", 0);
	Строка.Вставить("System", 0);
    Строка.Вставить("TaxCode", 0);
    Строка.Вставить("TranAmount", 0);
    Строка.Вставить("TransNbr", 0);
    Строка.Вставить("UpdateDate", 0);
	Строка.Вставить("Vendor", 0);
    Строка.Вставить("VendorVname", 0);
	
	Попытка
		Выполнить("Если " + КодВыполнения + " Тогда КонецЕсли;");
	Исключение
	    Сообщить("Описание ошибки: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
