
Процедура СоздатьВерсию(ER, MOT, CCA, POD, CCAGLRequested, ИзменилсяСостав = Ложь) Экспорт
	
	// ставим исключительную блокировку на рс по эр
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить();
	ЭлементБлокировки.Область = "РегистрСведений.ERVersions";
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ER",ER); 
	Блокировка.Заблокировать();
	
	НаборЗаписей = РегистрыСведений.ERVersions.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	НаборЗаписей.Отбор.ER.Установить(ER);
	НаборЗаписей.Прочитать();
	Запись = НаборЗаписей.Добавить();
	Запись.Период 			= ТекущаяДата();
	Запись.Version 			= Документы.ExportRequest.rgsПолучитьМаксимальнуюВерсию(ER) + 1;
	Запись.ER 				= ER;
	Запись.Регистратор 		= ER;
	Запись.CCA 				= CCA;
	Запись.MOT 				= MOT;
	Запись.POD 				= POD;
	Запись.CCAGLRequested	= CCAGLRequested;
	Запись.CCAGLReceived 	= Дата("01.01.0001 00:00:00");
	Запись.ИзменилсяСостав 	= ИзменилсяСостав;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьВерсию(НомерВерсии, ER, MOT, CCA,  POD, CCAGLRequested, CCAGLReceived, ИзменилсяСостав = Ложь) Экспорт
	
	НаборЗаписей = РегистрыСведений.ERVersions.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	НаборЗаписей.Отбор.ER.Установить(ER);
	НаборЗаписей.Прочитать();
	Запись = НаборЗаписей.Добавить();
	Запись.Период 			= ТекущаяДата();
	Запись.Version 			= НомерВерсии;//Документы.КонсолидированныйПакетЗаявокНаПеревозку.rgsПолучитьКоличествоВерсий(ER) + 1;
	Запись.ER 				= ER;
	Запись.Регистратор 		= ER;
	Запись.CCA 				= CCA;
	Запись.MOT 				= MOT;
	Запись.POD 				= POD;
	Запись.CCAGLRequested	= CCAGLRequested;
	Запись.CCAGLReceived 	= CCAGLReceived;
	Запись.ИзменилсяСостав 	= ИзменилсяСостав;
	НаборЗаписей.Записать();
	
КонецПроцедуры