       
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьЭлементыОтбора();
	
	// { РГ-Софт Пахоменков А. 16.01.2015 ПроверкаКонтрагентов
	ПроверкаКонтрагентов.ФормаСпискаПриСозданииНаСервере(Список);
	// } РГ-Софт Пахоменков А. 16.01.2015
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыОтбора()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Если Не РГСофтСерверПовтИспСеанс.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "УчетПоВсемОрганизациям") Тогда
		
		ОсновнаяОрганизация = РГСофтСерверПовтИспСеанс.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяОрганизация");
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
													"Организация",
													ОсновнаяОрганизация,
													ВидСравненияКомпоновкиДанных.Равно,
													,Истина,
													РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
	КонецЕсли;
												
	Если Не РГСофтСерверПовтИспСеанс.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "УчетПоВсемОтветственным") Тогда
		
		ОсновнойОтветственный = РГСофтСерверПовтИспСеанс.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнойОтветственный");
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
													"Ответственный",
													ОсновнойОтветственный,
													ВидСравненияКомпоновкиДанных.Равно,
													,Истина,
													РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
	КонецЕсли;
	
	Если Не РГСофтСерверПовтИспСеанс.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "УчетПоВсемИнвойсинговымЦентрам") Тогда
		
		ОсновнойИнвойсинговыйЦентр = РГСофтСерверПовтИспСеанс.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнойИнвойсинговыйЦентр");
		СписокИнвойсинговыхЦентров = Новый СписокЗначений;
		СписокИнвойсинговыхЦентров.Добавить(ОсновнойИнвойсинговыйЦентр);
		СписокИнвойсинговыхЦентров.Добавить(Справочники.ИнвойсинговыеЦентры.ПустаяСсылка());
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
													"ИнвойсинговыйЦентр",
													СписокИнвойсинговыхЦентров,
													ВидСравненияКомпоновкиДанных.ВСписке,
													,Истина,
													РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
	КонецЕсли;
												
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////
// КОНТРАГЕНТ

&НаКлиенте
Процедура КонтрагентОтборНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СписокКонтрагентов = ПолучитьСписокКонтрагентов(); 	
	ЭлементСписка = ВыбратьИзСписка(СписокКонтрагентов, Элементы.КонтрагентОтбор);
	
	Если ЭлементСписка <> Неопределено Тогда 
		КонтрагентОтбор = ЭлементСписка.Значение;
		УстановитьОтборПоКонтрагенту();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокКонтрагентов()
	
	СписокКонтрагентов = Новый СписокЗначений;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Контрагенты.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК Контрагенты
	                      |ГДЕ
	                      |	Контрагенты.ЭтоГруппа = ЛОЖЬ
	                      |	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	                      |	И Контрагенты.Наименование <> """"
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Контрагенты.Наименование");
						  
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокКонтрагентов.Добавить(Выборка.Ссылка);
	КонецЦикла;					  
	
	Возврат СписокКонтрагентов;
	
КонецФункции

&НаКлиенте
Процедура КонтрагентОтборПриИзменении(Элемент)
	
	УстановитьОтборПоКонтрагенту();	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКонтрагенту()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.КомпоновщикНастроек,
													"Контрагент",
													КонтрагентОтбор,
													ВидСравненияКомпоновкиДанных.Равно,
													, ?(ЗначениеЗаполнено(КонтрагентОтбор),Истина,Ложь),
													РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
	
КонецПроцедуры
        
///////////////////////////////////////////////////////////////////////
//Номера Инвойсов Lawson

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НомераИнвойсовLawson.Отбор,
													"Документ",
													ТекДанные.Ссылка,
													ВидСравненияКомпоновкиДанных.Равно,
													,Истина,
													РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
		
КонецПроцедуры

&НаКлиенте
Процедура НомераИнвойсовLawsonВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Документ = Элемент.ТекущиеДанные.Документ;
	Если ЗначениеЗаполнено(Документ) Тогда 
		ОткрытьЗначение(Документ);
	КонецЕсли;
	
КонецПроцедуры

