
Функция ПолучитьПоКоду(Код) Экспорт
	
	// Получает Customs по коду
	// В отличие от стандартной функции отсекаются помеченные на удаление элементы
	// Рекомендуется вызывать из модуля с повторным использованием значений
	
	Возврат РГСофт.НайтиСсылку("Справочник", "Customs", "Код", Код);
	
КонецФункции

Функция ПолучитьПоNameForLoading(NameForLoading) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CustomsNamesForLoading.Ссылка КАК Customs
	|ИЗ
	|	Справочник.Customs.NamesForLoading КАК CustomsNamesForLoading
	|ГДЕ
	|	CustomsNamesForLoading.NameForLoading = &NameForLoading
	|	И НЕ CustomsNamesForLoading.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("NameForLoading", NameForLoading);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
	    Возврат Выборка.Customs;
	КонецЕсли;	
	
	Возврат Неопределено;	
	
КонецФункции