
////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизитыБезДополнительныхДанных();
		
	ПроверитьЗаполнениеРеквизитов(Отказ);
		
КонецПроцедуры


////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных()
	
	РГСофтКлиентСервер.УстановитьЗначение(Код, СокрЛП(Код));
	РГСофтКлиентСервер.УстановитьЗначение(Наименование, СокрЛП(Наименование));
	РГСофтКлиентСервер.УстановитьЗначение(TaxCode, СокрЛП(TaxCode));
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Code"" is empty!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли;
	
	//отменила для KZ  - 14/01/2014
	
	//Если НЕ ЗначениеЗаполнено(TaxCode) Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		"""Tax code"" is empty!",
	//		ЭтотОбъект, "Tax code", , Отказ);
	//КонецЕсли;
	
КонецПроцедуры