
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьTransportAvailabilityStatus();
	НастроитьTransportMonthlyRates();
	НастроитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость()
	
	Если Объект.TypeOfTransport = ПредопределенноеЗначение("Перечисление.TypesOfTransport.CallOut") Тогда 
		Для Каждого Элемент из ЭтаФорма.ПодчиненныеЭлементы Цикл
			Элемент.Видимость = Ложь;
		КонецЦикла;
		Элементы.НаименованиеКод.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ГруппаSemitrailer.Видимость = (Объект.TypeOfTransport = ПредопределенноеЗначение("Перечисление.TypesOfTransport.Own"));
	Элементы.ГруппаServiceProviderRate.Видимость = (Объект.TypeOfTransport = ПредопределенноеЗначение("Перечисление.TypesOfTransport.Rental"));
	
КонецПроцедуры

&НаКлиенте
Процедура TypeOfTransportПриИзменении(Элемент)
	
	НастроитьTransportAvailabilityStatus();
	НастроитьВидимость();	
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьTransportAvailabilityStatus()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		TransportAvailabilityStatus.Отбор,
		"Transport",
		?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено),
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
		
КонецПроцедуры
	
&НаКлиенте
Процедура НастроитьTransportMonthlyRates()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		TransportMonthlyRates.Отбор,
		"Transport",
		?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено),
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура TransportAvailabilityStatusПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Trip) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Can not delete status recorded by Trip!",
			, , , Отказ);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РГСофт.ЗаполнитьModification(ТекущийОбъект);
	
КонецПроцедуры
