////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
//

&НаСервере
// Процедура заполняет параметры формы.
//
Процедура ПолучитьЗначенияПараметровФормы()

	ЕстьВалютныйУчет = БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет();
	
	// Тип цен.
	Если Параметры.Свойство("ТипЦен") Тогда
		ТипЦен = Параметры.ТипЦен;
		ТипЦенПриОткрытии = Параметры.ТипЦен;
	Иначе
		Элементы.ТипЦен.Видимость = Ложь;
	КонецЕсли;

	// НДС в сумме.
	СписокВыбораВариантовРасчетаНДС = Элементы.ВариантРасчетаНДС.СписокВыбора;
	
	Если Параметры.Свойство("ДокументБезНДС") Тогда
		
		ПлательщикНДС = Ложь;
		Если Параметры.Свойство("Организация") И Параметры.Свойство("ДатаДокумента") Тогда
			ПлательщикНДС = УчетнаяПолитика.ПлательщикНДС(Параметры.Организация, Параметры.ДатаДокумента);
		КонецЕсли;
		
		Если Не ПлательщикНДС Тогда 
			ДокументБезНДС = Параметры.ДокументБезНДС;
			ДокументБезНДСПриОткрытии = Параметры.ДокументБезНДС;
			СписокВыбораВариантовРасчетаНДС.Добавить(Перечисления.ВариантыРасчетаНДС.ДокументБезНДС);
		КонецЕсли;
		
	КонецЕсли;	
	
	СписокВыбораВариантовРасчетаНДС.Добавить(Перечисления.ВариантыРасчетаНДС.НДСВСумме);
	СписокВыбораВариантовРасчетаНДС.Добавить(Перечисления.ВариантыРасчетаНДС.НДССверху);
			
	Если Параметры.Свойство("СуммаВключаетНДС") Тогда
		СуммаВключаетНДС = Параметры.СуммаВключаетНДС;
		СуммаВключаетНДСЕстьРеквизит = Истина;
		СуммаВключаетНДСПриОткрытии = Параметры.СуммаВключаетНДС;
	Иначе
		Элементы.ВариантРасчетаНДС.Видимость = Ложь;
	КонецЕсли;
		
	Если Параметры.Свойство("ДокументБезНДС") 
		И ДокументБезНДС Тогда 
		ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.ДокументБезНДС;
	ИначеЕсли Параметры.Свойство("СуммаВключаетНДС") Тогда
		ВариантРасчетаНДС = ?(СуммаВключаетНДС, Перечисления.ВариантыРасчетаНДС.НДСВСумме, Перечисления.ВариантыРасчетаНДС.НДССверху);
	Иначе
		Элементы.ВариантРасчетаНДС.Видимость = Ложь;
	КонецЕсли;	

	// НДС включать в стоимость.
	РаздельныйУчетНДСНаСчете19 = Ложь;
	Если Параметры.Свойство("Организация") И Параметры.Свойство("ДатаДокумента") Тогда
		РаздельныйУчетНДСНаСчете19 = УчетнаяПолитика.РаздельныйУчетНДСНаСчете19(Параметры.Организация, Параметры.ДатаДокумента);
	КонецЕсли;
	
	Если Параметры.Свойство("НДСВключенВСтоимость") 
		И НЕ РаздельныйУчетНДСНаСчете19 Тогда
		НДСВключенВСтоимость = Параметры.НДСВключенВСтоимость;
		Если Параметры.Свойство("ДокументБезНДС")
			И ДокументБезНДС Тогда 
			Элементы.НДСВключенВСтоимость.Доступность = Ложь;	
		КонецЕсли;
	Иначе
		Элементы.НДСВключенВСтоимость.Видимость = Ложь;
	КонецЕсли;

	// Валюта.
	Если Параметры.Свойство("ВалютаДокумента") Тогда
		ВалютаДокумента = Параметры.ВалютаДокумента;
		ВалютаДокументаПриОткрытии = Параметры.ВалютаДокумента;
		ВалютаДокументаЕстьРеквизит = Истина;
		
		ВалютаРасчетов = ВалютаДокумента;
	КонецЕсли;

	// Валюта. Курс/кратность валюты расчетов.
	КурсДокументаЕстьРеквизит = Параметры.Свойство("КурсДокумента");
	
	Если Параметры.Свойство("ЭтоПоступление") Тогда
		ЭтоПоступление = Параметры.ЭтоПоступление;
	КонецЕсли;
	
	Если Параметры.Свойство("Договор")
		И ЗначениеЗаполнено(Параметры.Договор) Тогда

		РеквизитыДоговор	= БухгалтерскийУчетПереопределяемый.ПолучитьРеквизитыДоговораКонтрагента(Параметры.Договор);
		ВалютаРасчетов 		= РеквизитыДоговор.ВалютаВзаиморасчетов;
		РасчетыВУЕ    		= РеквизитыДоговор.РасчетыВУсловныхЕдиницах;
		ВидДоговора			= РеквизитыДоговор.ВидДоговора;
		
		Если НЕ Параметры.Свойство("ЭтоПоступление") Тогда
			ЭтоПоступление = (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
				ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		КонецЕсли;
			
		// Если есть параметр "валюта документа" и он равен валюте из договора
		МассивКурсКратность = КурсыВалют.НайтиСтроки(Новый Структура("Валюта", ВалютаРасчетов));

		Если (ВалютаРасчетов <> ВалютаУчета) Тогда
			
			Элементы.ГруппаВалюта.Видимость = ЕстьВалютныйУчет;
			
			Если Параметры.Свойство("Курс") Тогда
				КурсРасчетов = Параметры.Курс;
				Если КурсРасчетов = 1 Тогда
					Если ЗначениеЗаполнено(МассивКурсКратность) Тогда
						КурсРасчетов = МассивКурсКратность[0].Курс;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(МассивКурсКратность) Тогда
					КурсРасчетов = МассивКурсКратность[0].Курс;
				Иначе
					КурсРасчетов = 1;
				КонецЕсли;
			КонецЕсли;
			
			Если Параметры.Свойство("Кратность") Тогда
				КратностьРасчетов = Параметры.Кратность;
			Иначе
				Если ЗначениеЗаполнено(МассивКурсКратность) Тогда
					КратностьРасчетов = МассивКурсКратность[0].Кратность;
				Иначе
					КратностьРасчетов = 1;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			Элементы.ГруппаВалюта.Видимость = Ложь;
			
			Если ЗначениеЗаполнено(МассивКурсКратность) Тогда
				КурсРасчетов = МассивКурсКратность[0].Курс;
				КратностьРасчетов = МассивКурсКратность[0].Кратность;
			Иначе
				КурсРасчетов = 1;
				КратностьРасчетов = 1;
			КонецЕсли;
			
		КонецЕсли;

		ДоговорЕстьРеквизит = Истина;
		
	ИначеЕсли Не КурсДокументаЕстьРеквизит Тогда
		
		Элементы.ГруппаВалюта.Видимость = Ложь;
		ДоговорЕстьРеквизит = Ложь;
	
	КонецЕсли;
	
	// Валюта. Курс/кратность валюты документа.
	Если ЗначениеЗаполнено(ВалютаДокумента)  Тогда
		МассивКурсКратность = КурсыВалют.НайтиСтроки(Новый Структура("Валюта", ВалютаДокумента));
		
		Если ВалютаДокумента = ВалютаРасчетов
		   И КурсРасчетов <> 0
		   И КратностьРасчетов <> 0 
		   И (НЕ КурсДокументаЕстьРеквизит) Тогда
		   
			Курс = КурсРасчетов;
			Кратность = КратностьРасчетов;
			
		ИначеЕсли КурсДокументаЕстьРеквизит Тогда
			
			Курс = Параметры.КурсДокумента;
			Кратность = Параметры.КратностьДокумента;
			
			Если Курс = 0 
			   И Кратность = 0 
			   И ЗначениеЗаполнено(МассивКурсКратность) Тогда
			
				Курс = МассивКурсКратность[0].Курс;
				Кратность = МассивКурсКратность[0].Кратность;
				
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(МассивКурсКратность) Тогда
				
				Курс = МассивКурсКратность[0].Курс;
				Кратность = МассивКурсКратность[0].Кратность;
				
			Иначе
				
				Курс = 0;
				Кратность = 0;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	ДатаДокумента = Параметры.ДатаДокумента;

КонецПроцедуры

&НаСервере
// Процедура заполняет таблицу курсов валют
//
Процедура ЗаполнитьТаблицуКурсовВалют()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента", Параметры.ДатаДокумента);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта,
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних";

	ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	КурсыВалют.Загрузить(ТаблицаРезультатаЗапроса);

КонецПроцедуры

&НаКлиенте
// Процедура проверяет правильность заполнения реквизитов формы.
//
Процедура ПроверитьЗаполнениеРеквизитовФормы(Отказ)

	Если СуммаВключаетНДСЕстьРеквизит И
		Не ЗначениеЗаполнено(ВариантРасчетаНДС) Тогда 
		ТекстСообщения = ВернутьСтр("ru = 'Не заполнен вариант расчета НДС!'");
		Поле = "ВариантРасчетаНДС";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
	КонецЕсли;	
	
	// Расчеты.
	Если ДоговорЕстьРеквизит И НЕ КурсДокументаЕстьРеквизит Тогда	
		
		Если РасчетыВУЕ И ВалютаУчета <> ВалютаРасчетов Тогда //у.е.
			Если ЭтоПоступление Тогда 
				Если НЕ ЗначениеЗаполнено(КурсРасчетов) Тогда
					ТекстСообщения = ВернутьСтр("ru = 'Обнаружен нулевой курс валюты расчетов!'");
					Поле = "КурсРасчетов";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
                КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ВалютаУчета <> ВалютаРасчетов Тогда //валюта
			Если ЭтоПоступление Тогда
				Если НЕ ЗначениеЗаполнено(КурсРасчетов) Тогда 
					ТекстСообщения = ВернутьСтр("ru = 'Обнаружен нулевой курс валюты расчетов!'");
					Поле = "КурсВалютаПоступление";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли КурсДокументаЕстьРеквизит Тогда //прочее
		
		Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда 
			ТекстСообщения = ВернутьСтр("ru = 'Не заполнена валюта документа!'");
			Поле = "Валюта";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(Курс) Тогда 
			ТекстСообщения = ВернутьСтр("ru = 'Не заполнен курс!'");
			Поле = "Курс";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура заполнения курса и кратности валюты документа.
//
Процедура ЗаполнитьКурсКратностьВалютыДокумента(ПересчитатьВалютуДокумента = Ложь)

	Если ЗначениеЗаполнено(ВалютаДокумента) И (НЕ КурсДокументаЕстьРеквизит ИЛИ ПересчитатьВалютуДокумента) Тогда
		МассивКурсКратность = КурсыВалют.НайтиСтроки(Новый Структура("Валюта", ВалютаДокумента));
		Если ВалютаДокумента = ВалютаРасчетов
				И КурсРасчетов <> 0
				И КратностьРасчетов <> 0 Тогда
			Курс = КурсРасчетов;
			Кратность = КратностьРасчетов;
		Иначе
			Если ЗначениеЗаполнено(МассивКурсКратность) Тогда
				Курс = МассивКурсКратность[0].Курс;
				Кратность = МассивКурсКратность[0].Кратность;
			Иначе
				Курс = 0;
				Кратность = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
// В процедуре осуществляется
// - инициализация параметров формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВалютаУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ЗаполнитьТаблицуКурсовВалют();
	ПолучитьЗначенияПараметровФормы();

	СписокКурсовВалют = ПолучитьСписокКурсовВалют();
	 
	Валюты = ?(ВалютаДокумента = ВалютаРасчетов, 0, 1); 
	
	Если ДоговорЕстьРеквизит И НЕ КурсДокументаЕстьРеквизит Тогда	
		
		Если РасчетыВУЕ И ВалютаУчета <> ВалютаРасчетов Тогда //у.е.
			
			Элементы.СтраницыВалютаУЕ.ТекущаяСтраница = Элементы.СтраницаУЕ;
			Элементы.ВалютыУЕПоступление.СписокВыбора.Добавить(0, ВалютаРасчетов);
			Элементы.ВалютыУЕПоступление.СписокВыбора.Добавить(1, ВалютаУчета);
			
			Элементы.ГруппаВалютаРасчетов.ТекущаяСтраница = Элементы.СтраницаРасчетыУЕ;
			
			Если ЭтоПоступление Тогда 
				СтрокаДляПодстановки = ВернутьСтр("ru = 'Оприходовать по курсу %1%2 ='");
			Иначе
				СтрокаДляПодстановки = ВернутьСтр("ru = 'Реализовать по курсу %1%2 = '");
			КонецЕсли;
				
			Элементы.НадписьВалютаРасчетов1.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				СтрокаДляПодстановки, ?(КратностьРасчетов = 1, "", КратностьРасчетов), ВалютаРасчетов);
				
			Элементы.НадписьВалютаРасчетов2.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ВернутьСтр("ru = '%1'"), ВалютаУчета);
				
			Для Каждого КурсНаДату Из СписокКурсовВалют Цикл
				Элементы.КурсРасчетов.СписокВыбора.Добавить(КурсНаДату.Значение, КурсНаДату.Представление);
			КонецЦикла;
			
		ИначеЕсли ВалютаУчета <> ВалютаРасчетов Тогда //валюта
			
			Элементы.ГруппаВалютаРасчетов.Видимость = Ложь;
			
			Элементы.СтраницыВалютаУЕ.ТекущаяСтраница = Элементы.СтраницаВалюта;
			Элементы.НадписьВалюта1.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ВернутьСтр("ru = '%1%2 = '"), ?(КратностьРасчетов = 1, "", КратностьРасчетов), ВалютаРасчетов);
			Элементы.НадписьВалюта2.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ВернутьСтр("ru = '%1'"), ВалютаУчета);	
			Для Каждого КурсНаДату Из СписокКурсовВалют Цикл
				Элементы.КурсВалютаПоступление.СписокВыбора.Добавить(КурсНаДату.Значение, КурсНаДату.Представление);
			КонецЦикла;	
			
		КонецЕсли;
		
	ИначеЕсли КурсДокументаЕстьРеквизит Тогда
		Элементы.СтраницыВалютаУЕ.ТекущаяСтраница = Элементы.СтраницаПрочее;
		Элементы.ГруппаВалютаРасчетов.Видимость 	= Ложь;
		Для Каждого КурсНаДату Из СписокКурсовВалют Цикл
			Элементы.Курс.СписокВыбора.Добавить(КурсНаДату.Значение, КурсНаДату.Представление);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКурсовВалют()
	
	СписокКурсовВалют = Новый СписокЗначений;
	
	Если ВалютаУчета <> ВалютаРасчетов Тогда 
		
		КурсНаДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРасчетов, ДатаДокумента);
		СписокКурсовВалют.Добавить(КурсНаДату.Курс, Строка(КурсНаДату.Курс) + " (на " + Формат(ДатаДокумента, "ДФ = дд.ММ.гг") + ")");
		Для ДеньМинус = 1 По 5 Цикл
			ДатаКурса = ДатаДокумента - (ДеньМинус * 86400);
			КурсНаДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРасчетов, ДатаКурса);
			СписокКурсовВалют.Добавить(КурсНаДату.Курс, Строка(КурсНаДату.Курс) + " (на " + Формат(ДатаКурса, "ДФ = дд.ММ.гг") + ")");
		КонецЦикла;
		СписокКурсовВалют.Добавить(0, "<Выбрать другую дату>");
		
	КонецЕсли;
	
	Возврат СписокКурсовВалют;
	
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события нажатия кнопки ПересчитатьИЗакрыть.
//
Процедура КомандаПересчитатьИЗакрыть(Команда)

	Отказ = Ложь;

	ПроверитьЗаполнениеРеквизитовФормы(Отказ);
		
	Если НЕ Отказ Тогда

		ПересчитатьЦены = ЗначениеЗаполнено(ВалютаДокумента)
			И ВалютаДокументаПриОткрытии <> ВалютаДокумента;
			
		ПересчитатьНДС = СуммаВключаетНДС <> СуммаВключаетНДСПриОткрытии
			ИЛИ ДокументБезНДСПриОткрытии <> ДокументБезНДС;
	
		СтруктураРеквизитовФормы = Новый Структура;

		СтруктураРеквизитовФормы.Вставить("БылиВнесеныИзменения", ЭтаФорма.Модифицированность);
		СтруктураРеквизитовФормы.Вставить("ТипЦен",               ТипЦен);
		СтруктураРеквизитовФормы.Вставить("ВалютаДокумента",      ВалютаДокумента);
		СтруктураРеквизитовФормы.Вставить("СуммаВключаетНДС",     СуммаВключаетНДС);
		СтруктураРеквизитовФормы.Вставить("НДСВключенВСтоимость", НДСВключенВСтоимость);
		СтруктураРеквизитовФормы.Вставить("ВалютаРасчетов",       ВалютаРасчетов);
		СтруктураРеквизитовФормы.Вставить("Курс",                 Курс);
		СтруктураРеквизитовФормы.Вставить("КурсРасчетов",         КурсРасчетов);
		СтруктураРеквизитовФормы.Вставить("Кратность",            Кратность);
		СтруктураРеквизитовФормы.Вставить("КратностьРасчетов",    КратностьРасчетов);
		СтруктураРеквизитовФормы.Вставить("ПредВалютаДокумента",  ВалютаДокументаПриОткрытии);
		СтруктураРеквизитовФормы.Вставить("ИмяФормы",             "ОбщаяФорма.ФормаВалюта");
		СтруктураРеквизитовФормы.Вставить("ДокументБезНДС",       ДокументБезНДС);
		СтруктураРеквизитовФормы.Вставить("ПерезаполнитьЦены",    ПерезаполнитьЦены);
		СтруктураРеквизитовФормы.Вставить("ПересчитатьЦены",      ПересчитатьЦены);
		СтруктураРеквизитовФормы.Вставить("ПересчитатьНДС",       ПересчитатьНДС);
		
		Закрыть(СтруктураРеквизитовФормы);

	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ
//

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	
	//Для "Перезаполнения"
	Если Не ПерезаполнитьЦены Тогда
		ПерезаполнитьЦены = Истина;
	КонецЕсли;
	
	Если НЕ ДокументБезНДС И ЗначениеЗаполнено(ТипЦен) Тогда
		СуммаВключаетНДС = ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(ТипЦен, "ЦенаВключаетНДС");
		
		Если СуммаВключаетНДС Тогда
			ВариантРасчетаНДС = ПредопределенноеЗначение("Перечисление.ВариантыРасчетаНДС.НДСВСумме");
		Иначе
			ВариантРасчетаНДС = ПредопределенноеЗначение("Перечисление.ВариантыРасчетаНДС.НДССверху");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Валюта, СтраницаПрочее
//
Процедура ВалютаПриИзменении(Элемент)

	Элементы.Курс.СписокВыбора.Очистить();
	ВалютаРасчетов = ВалютаДокумента;
	
	ЗаполнитьКурсКратностьВалютыДокумента(Истина);
	
	СписокКурсовВалют = ПолучитьСписокКурсовВалют();

	Для Каждого КурсНаДату Из СписокКурсовВалют Цикл
		Элементы.Курс.СписокВыбора.Добавить(КурсНаДату.Значение, КурсНаДату.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода КурсРасчетов, СтраницаРасчетыУЕПосиупление
//
Процедура КурсРасчетовПриИзменении(Элемент)

	ЗаполнитьКурсКратностьВалютыДокумента();

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода КурсВалютаПоступление, СтраницаВалютаПоступление
//
&НаКлиенте
Процедура КурсВалютаПоступлениеПриИзменении(Элемент)
	
	ЗаполнитьКурсКратностьВалютыДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ВариантРасчетаНДСПриИзменении(Элемент)
	
	Если ВариантРасчетаНДС = ПредопределенноеЗначение("Перечисление.ВариантыРасчетаНДС.ДокументБезНДС") Тогда 
		ДокументБезНДС 		= Истина;
	ИначеЕсли ВариантРасчетаНДС = ПредопределенноеЗначение("Перечисление.ВариантыРасчетаНДС.НДСВСумме") Тогда 
		ДокументБезНДС 		= Ложь;
		СуммаВключаетНДС 	= Истина;
	Иначе
		ДокументБезНДС 		= Ложь;
		СуммаВключаетНДС 	= Ложь;
	КонецЕсли;
	
	Элементы.НДСВключенВСтоимость.Доступность = Не ДокументБезНДС;	
	
КонецПроцедуры

&НаКлиенте
Процедура КурсРасчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОбработчикОповещенияОЗакрытии = Новый ОписаниеОповещения("КурсРасчетовОбработкаВыбораЗавершение", ЭтотОбъект);
		ПоказатьВводДаты(ОбработчикОповещенияОЗакрытии, ДатаДокумента, "Укажите дату курса валюты", ЧастиДаты.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсРасчетовОбработкаВыбораЗавершение(ДатаКурса, ДополнительныеПараметры) Экспорт
	
	Если ДатаКурса <> Неопределено Тогда
		КурсРасчетовОбработкаВыбораНаСервере(ДатаКурса);
		ЗаполнитьКурсКратностьВалютыДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КурсРасчетовОбработкаВыбораНаСервере(ДатаКурса)
	
	КурсНаДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРасчетов, ДатаКурса);
	ЭтаФорма.КурсРасчетов = КурсНаДату.Курс;
	ЭтаФорма.КратностьРасчетов = КурсНаДату.Кратность;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОбработчикОповещенияОЗакрытии = Новый ОписаниеОповещения("КурсОбработкаВыбораЗавершение", ЭтотОбъект);
		ПоказатьВводДаты(ОбработчикОповещенияОЗакрытии, ДатаДокумента, "Укажите дату курса валюты", ЧастиДаты.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсОбработкаВыбораЗавершение(ДатаКурса, ДополнительныеПараметры) Экспорт
	
	Если ДатаКурса <> Неопределено Тогда
		КурсОбработкаВыбораНаСервере(ДатаКурса);
		ЗаполнитьКурсКратностьВалютыДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КурсОбработкаВыбораНаСервере(ДатаКурса)
	
	КурсНаДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса);
	ЭтаФорма.Курс = КурсНаДату.Курс;
	ЭтаФорма.Кратность = КурсНаДату.Кратность;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсВалютаПоступлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОбработчикОповещенияОЗакрытии = Новый ОписаниеОповещения("КурсРасчетовОбработкаВыбораЗавершение", ЭтотОбъект);
		ПоказатьВводДаты(ОбработчикОповещенияОЗакрытии, ДатаДокумента, "Укажите дату курса валюты", ЧастиДаты.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКурсВалют(Команда)
	
	ОткрытьФорму("РегистрСведений.КурсыВалют.ФормаСписка",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютыУЕПоступлениеПриИзменении(Элемент)
	
	ПриИзмененииВалюты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВалюты()
	
	Если Валюты = 0 Тогда 
		ВалютаДокумента = ВалютаРасчетов;
	Иначе
		ВалютаДокумента = ВалютаУчета;
	КонецЕсли;
	
	ЗаполнитьКурсКратностьВалютыДокумента();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПОЛЕЗНАЯ ИНФОРМАЦИЯ

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	//Обновление на бух. корп. 3.0.38.43
	//ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	//<=
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	//Обновление на бух. корп. 3.0.38.43
	//ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	//<=
	
КонецПроцедуры
