  
Процедура УстановитьПараметрUserSegments(Знач ИмяПараметра, УстановленныеПараметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.UserSegments = ПолучитьSegmentsТекущегоПользователя();	
	УстановленныеПараметры.Добавить("UserSegments");
	
КонецПроцедуры 

Функция ПолучитьSegmentsТекущегоПользователя() Экспорт
	
	ТЗ = РегистрыСведений.JobLogAccessRights.СрезПоследних(ТекущаяДата(), Новый Структура("User", ПараметрыСеанса.ТекущийПользователь));
	     	
	Если ТЗ.Количество() > 0 Тогда 
		МассивСегментов = РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(ТЗ, "Segment");
	иначе 
		МассивСегментов = Новый Массив;
		МассивСегментов.Добавить(Справочники.Сегменты.ПустаяСсылка());
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(МассивСегментов);
	
КонецФункции

Процедура ЗаполнитьSubSegmentИСчетаLawsonПоУмолчаниюДляСегмента(Объект) Экспорт 
	
	ТекSegment = СокрЛП(Строка(Объект.Segment));
	
	Объект.ServiceReimbursableAccount = ПланыСчетов.Lawson.НайтиПоКоду("429999");
	Объект.ProductReimbursableAccount = ПланыСчетов.Lawson.НайтиПоКоду("459999");
		
	Если ТекSegment = "ALS" Тогда 
		
		Объект.ServiceAccount = ПланыСчетов.Lawson.НайтиПоКоду("425009");
		Объект.ProductAccount = ПланыСчетов.Lawson.НайтиПоКоду("455009");
		Объект.SubSegment = Справочники.Сегменты.НайтиПоКоду("ATL");
		
	ИначеЕсли ТекSegment = "WSV" Тогда 
		
		ТекSubSegment = СокрЛП(Строка(Объект.SubSegment));
		
		Если ТекSubSegment = "WPS" Тогда 
			
			Account = ПланыСчетов.Lawson.НайтиПоКоду("410002");
			Объект.ServiceAccount = Account;
			Объект.ProductAccount = Account;
			
		ИначеЕсли ТекSubSegment = "WCS" Тогда 
			
			Account = ПланыСчетов.Lawson.НайтиПоКоду("409001");
			Объект.ServiceAccount = Account;
			Объект.ProductAccount = Account;
			
		КонецЕсли;
	
	ИначеЕсли ТекSegment = "WIS" Тогда 
		
		Account = ПланыСчетов.Lawson.НайтиПоКоду("411001");
		Объект.ServiceAccount = Account;
		Объект.ProductAccount = Account;
		
	иначе
		
		Объект.ServiceReimbursableAccount = Неопределено;
		Объект.ProductReimbursableAccount = Неопределено;
		Объект.ServiceAccount = Неопределено;
		Объект.ProductAccount = Неопределено;
		
		Объект.ServiceReimbursable = 0;
		Объект.ProductReimbursable = 0;
		Объект.Service = 0;
		Объект.Product = 0;
		    	
	КонецЕсли;
	
	Если ТекSegment = "DBM" Тогда 
		Объект.SubSegment = Справочники.Сегменты.НайтиПоКоду("ANA");
	ИначеЕсли ТекSegment = "REW" Тогда 
		Объект.SubSegment = Справочники.Сегменты.НайтиПоКоду("WL");
	КонецЕсли;

КонецПроцедуры