
Процедура ПередЗаписью(Отказ)
	
	РГСофтКлиентСервер.УстановитьЗначение(Наименование, СокрЛП(Наименование));
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеРеквизитов(Отказ);
		
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Name' is empty!",
			ЭтотОбъект, "Наименование", , Отказ);
		
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Seller) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Seller' is empty!",
			ЭтотОбъект, "Seller", , Отказ);
		
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ConsignTo) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Consign-to' is empty!",
			ЭтотОбъект, "ConsignTo", , Отказ);
		
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Incoterms) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Incoterms' is empty!",
			ЭтотОбъект, "Incoterms", , Отказ);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Date) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Date' is empty!",
			ЭтотОбъект, "Date", , Отказ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ExpiryDate) Тогда
		
		Если ExpiryDate < Date Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Expiry date can not be earlier than Date!",
				ЭтотОбъект, "ExpiryDate", , Отказ);
			
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Expiry date' is empty!",
			ЭтотОбъект, "ExpiryDate", , Отказ);
		
	КонецЕсли;	
	
КонецПроцедуры
