
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураНастройки") Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ВыборИзServiceProviders" Тогда
			НастроитьДляВыбораИзServiceProviders(СтруктураНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Параметры.Отбор.Свойство("ПометкаУдаления") Тогда
		Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзServiceProviders(СтруктураНастройки)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"Ссылка",
			СтруктураНастройки.МассивPOA,
			ВидСравненияКомпоновкиДанных.НеВСписке);
			
КонецПроцедуры
