
Процедура СформироватьПриходInventoryTangibleAssetsCosts(Ссылка, ДатаДокумента) Экспорт 
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДок", ДатаДокумента);
	Запрос.УстановитьПараметр("ВалютаSLB", Справочники.Валюты.НайтиПоКоду("999"));
	Запрос.УстановитьПараметр("ВалютаРуб", Справочники.Валюты.НайтиПоКоду("643"));
	Запрос.УстановитьПараметр("AccountLawsonRNI", ПланыСчетов.Lawson.НайтиПоКоду("201900"));
	Запрос.УстановитьПараметр("AccountLawsonINR", ПланыСчетов.Lawson.НайтиПоКоду("130508"));
	Запрос.УстановитьПараметр("AccountLawsonICO", ПланыСчетов.Lawson.НайтиПоКоду("130004"));
	//Пахоменков изменил на дсс
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Курс
	               |ПОМЕСТИТЬ КурсSLB
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДок, Валюта = &ВалютаSLB) КАК КурсыВалютСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПроводкаDSS.Ссылка КАК ПроводкаДеталейСКП,
	               |	ПроводкаDSS.BaseAmount КАК ManagementSum,
	               |	ПроводкаDSS.Дата,
	               |	ВЫБОР
	               |		КОГДА ПроводкаDSS.POLine.Количество ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ ПроводкаDSS.POLine.Количество
	               |	КОНЕЦ КАК Количество
	               |ПОМЕСТИТЬ ПроводкиДеталей
	               |ИЗ
	               |	Документ.ПроводкаDSS КАК ПроводкаDSS
	               |ГДЕ
	               |	(ПроводкаDSS.AccountLawson = &AccountLawsonRNI
	               |			ИЛИ ПроводкаDSS.AccountLawson = &AccountLawsonINR
	               |			ИЛИ ПроводкаDSS.AccountLawson = &AccountLawsonICO)
	               |	И ПроводкаDSS.System = ""GL""
	               |	И ПроводкаDSS.Документ = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИСТИНА КАК Активность,
	               |	ЗНАЧЕНИЕ(виддвижениянакопления.Приход) КАК ВидДвижения,
	               |	ПроводкиДеталей.ПроводкаДеталейСКП КАК ПроводкаДеталейСКП,
	               |	ПроводкиДеталей.ManagementSum КАК ManagementSum,
	               |	ВЫБОР
	               |		КОГДА ПроводкиДеталей.ПроводкаДеталейСКП.Currency = &ВалютаРуб
	               |			ТОГДА ПроводкиДеталей.ПроводкаДеталейСКП.TranAmount
	               |		ИНАЧЕ ПроводкиДеталей.ПроводкаДеталейСКП.BaseAmount * КурсSLB.Курс
	               |	КОНЕЦ КАК FiscalSum,
	               |	ПроводкиДеталей.Дата,
	               |	ПроводкиДеталей.Количество
	               |ИЗ
	               |	ПроводкиДеталей КАК ПроводкиДеталей,
	               |	КурсSLB КАК КурсSLB";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ДвиженияInventory = РегистрыНакопления.InventoryTangibleAssetsCosts.СоздатьНаборЗаписей();
	ДвиженияInventory.Отбор.Регистратор.Установить(Ссылка);
	ДвиженияInventory.Записывать = Истина;
	ДвиженияInventory.Загрузить(Результат);
	
	ДвиженияInventory.Записать();
		
КонецПроцедуры

