/////////////////////////////////////////////////////////////
//ВЕРСИЯ ПРОЦЕДУР И ФУНКЦИЙ ОБЛАСТИ "ТиповаяБухгалтерия": БУХ. КОРП. 3.0.38.42 бета

#Область ТиповаяБухгалтерия

// Функция возвращает курс ставку НДС
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты, валюта, по которой необходимо получить курс
//  ДатаКурса - Дата, календарная дата, на которую необходимо получить курс валюты
//
// Возвращаемое значение:
//	Курс переданной валюты на переданную дату, 1 в случае отсутствия значения.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2 = Ложь) Экспорт

	Возврат УчетНДСПереопределяемый.ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2);

КонецФункции // ПолучитьСтавкуНДС()

// Массив счетов учета товаров, по которым требуется учет по ГТД
//
Функция СчетаУчетаДляГТД() Экспорт

	//Обновление на бух. корп. 3.0.38.42
	//СчетаГруппы = Новый Массив;
	//СчетаГруппы.Добавить(ПланыСчетов.Хозрасчетный.ТоварыНаСкладах);
	//СчетаГруппы.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговле);
	//СчетаГруппы.Добавить(ПланыСчетов.Хозрасчетный.ТоварыПринятыеНаКомиссию);
	//СчетаГруппы.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
	//СчетаГруппы.Добавить(ПланыСчетов.Хозрасчетный.ПокупныеИзделия);

	//СчетаУчета = Новый Массив;
	//Для каждого СчетГруппа Из СчетаГруппы Цикл
	//	Для каждого СчетУчета Из БухгалтерскийУчетВызовСервераПовтИсп.СчетаВИерархии(СчетГруппа) Цикл
	//		СчетаУчета.Добавить(СчетУчета);
	//	КонецЦикла;
	//КонецЦикла;
	//Возврат СчетаУчета; 
	Возврат Новый Массив;
	//<=	

КонецФункции

#КонецОбласти
