
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// попытка отмены проведения сопоставленного документа
	Ответ = ПопыткаОтменыПроведенияНаСервере(ПараметрКоманды);
	//ПараметрыВыполненияКоманды.Источник.Прочитать();
	
	Если Ответ = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
	
	Если НЕ Ответ.Отказ Тогда
		ПараметрыВыполненияКоманды.Источник.ТолькоПросмотр = Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документы в обеих базах успешно распровелись.";
		Сообщение.Сообщить();
	Иначе
		// отправляем запрос на пересогласование в Ico через заполнение формы
		ПараметрыФормы = Новый Структура("Ключ", ПараметрКоманды);
		Параметр = Новый Структура("", );
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормы", ПолучитьФорму("ОбщаяФорма.rgsПересогласование"), ПараметрКоманды);
		ОткрытьФорму("ОбщаяФорма.rgsПересогласование",ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,,,,Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПопыткаОтменыПроведенияНаСервере(Документ)
	
	Отказ = Ложь;
	ТекстОшибки = "";
	
	Если Документ.Проведен И Документ.ЭтоДокументИнтеркомпани Тогда
		//Если Константы.rgsПроводитьДокументыЧерезМодульКонтроля.Получить() Тогда
			//СтруктураДанных = rgsКонтрольПроведенияСервер.СформироватьСтруктуруИдентификацииДокументаXDTO(Документ);
			СсылкаНаОбъект = Документ.Ссылка;
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("ТипОбъекта",		"Документ." + СсылкаНаОбъект.Метаданные().Имя);
			СтруктураДанных.Вставить("УникальныйИдентификатор", Строка(СсылкаНаОбъект.УникальныйИдентификатор()));
			СтруктураДанных.Вставить("Пользователь", 	СокрЛП(Пользователи.ТекущийПользователь()));
			СтруктураДанных.Вставить("СуперПользователь", Ложь); //РольДоступна("ПолныеПрава"));
			СтруктураДанных.Вставить("База", "SVS");
			СтруктураДанных.Вставить("IcoОтменаПроведения", Истина);
			СтруктураДанныхСериализируемая = СериализаторXDTO.ЗаписатьXDTO(СтруктураДанных);
			
			Ответ = КонтрольПроведенияСервер.ДействиеМодуляКонтроля("UndoPosting", Отказ, ТекстОшибки, СтруктураДанныхСериализируемая);
		//КонецЕсли;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для отмены проведения документ должен быть проведен.";
		Сообщение.Сообщить();
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

