
//////////////////////////////////////////////////////////////////////////////////////////
// ФОРМА

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	РГСофтКлиент.ПроверитьНеобходимостьЗаписиДокумента(ПараметрыЗаписи.РежимЗаписи, Объект.Проведен, Модифицированность, Отказ);
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ModifiedBy = ПараметрыСеанса.ТекущийПользователь;
	ТекущийОбъект.ModificationDate = ТекущаяДата();
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////////
// CUSTOMS FILES

&НаКлиенте
Процедура CustomsFilesПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.ProcessLevel) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""ProcessLevel"" is empty!",
			, "ProcessLevel", "Объект");
		Возврат;
	КонецЕсли;
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Имя", "ВыборИзBoxOfCustomsFiles"); 
	СтруктураНастройки.Вставить("ProcessLevel", Объект.ProcessLevel);
	CurrentCustomsFiles = РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(Объект.CustomsFiles, "CustomsFile");
	СтруктураНастройки.Вставить("CurrentCustomsFiles", CurrentCustomsFiles);
	СтруктураНастройки.Вставить("CurrentBox", Объект.Ссылка);
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураНастройки", СтруктураНастройки);
	ОткрытьФорму("Документ.ГТД.Форма.ФормаПодбора", СтруктураПараметров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура CustomsFilesОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив")
		И ВыбранноеЗначение.Количество()
		И ТипЗнч(ВыбранноеЗначение[0]) = Тип("ДокументСсылка.ГТД") Тогда
		
		Для Каждого CustomsFile Из ВыбранноеЗначение Цикл
			
			НоваяСтрока = Объект.CustomsFiles.Добавить();
			НоваяСтрока.CustomsFile = CustomsFile;
			
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CustomsFilesВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	CurrentCustomsFile = Элемент.ТекущиеДанные.CustomsFile;
	Если ЗначениеЗаполнено(CurrentCustomsFile) Тогда
		ПоказатьЗначение(,CurrentCustomsFile);
	КонецЕсли; 
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////////
// CUSTOMS FILES LIGHT

&НаКлиенте
Процедура CustomsFilesLightПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.ProcessLevel) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Process level"" is empty!",
			, "ProcessLevel", "Объект");
		Возврат;
	КонецЕсли;
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Имя", "ВыборИзBoxOfCustomsFiles"); 
	СтруктураНастройки.Вставить("ProcessLevel", Объект.ProcessLevel);
	CurrentCustomsFilesLight = РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(Объект.CustomsFilesLight, "CustomsFileLight");
	СтруктураНастройки.Вставить("CurrentCustomsFilesLight", CurrentCustomsFilesLight);
	СтруктураНастройки.Вставить("CurrentBox", Объект.Ссылка);
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураНастройки", СтруктураНастройки);
	ОткрытьФорму("Документ.CustomsFilesLight.Форма.ФормаПодбора", СтруктураПараметров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура CustomsFilesLightОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив")
		И ВыбранноеЗначение.Количество()
		И ТипЗнч(ВыбранноеЗначение[0]) = Тип("ДокументСсылка.CustomsFilesLight") Тогда
		
		Для Каждого CustomsFileLight Из ВыбранноеЗначение Цикл
			
			НоваяСтрока = Объект.CustomsFilesLight.Добавить();
			НоваяСтрока.CustomsFileLight = CustomsFileLight;
			
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CustomsFilesLightВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	CurrentCustomsFileLight = Элемент.ТекущиеДанные.CustomsFileLight;
	Если ЗначениеЗаполнено(CurrentCustomsFileLight) Тогда
		ПоказатьЗначение(,CurrentCustomsFileLight);
	КонецЕсли; 
	
КонецПроцедуры
