
Функция ПолучитьГеолокациюТрипа(Трип) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МестоположениеПоставки.Местоположение,
	|	МестоположениеПоставки.ВремяМестоположения,
	|	МестоположениеПоставки.Описание
	|ИЗ
	|	Задача.МестоположениеПоставки КАК МестоположениеПоставки
	|ГДЕ
	|	МестоположениеПоставки.Trip = &Trip
	|	И НЕ МестоположениеПоставки.Выполнена
	|	И МестоположениеПоставки.Местоположение <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	МестоположениеПоставки.Дата УБЫВ";
	Запрос.УстановитьПараметр("Trip", Трип);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Количество() > 0 Тогда
		Результат.Следующий();
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
