
&НаКлиенте
Процедура ПриЗакрытии()
	
	СохранитьНастройки();
	
КонецПроцедуры


&НаСервере
Процедура СохранитьНастройки()
	
	ХранилищеОбщихНастроек.Сохранить("СправочникНалоговыеОрганы_РежимОтображения", , Элементы.Список.Отображение);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()

	РежимОтображения = ХранилищеОбщихНастроек.Загрузить("СправочникНалоговыеОрганы_РежимОтображения");
	Если РежимОтображения <> Неопределено Тогда
		Элементы.Список.Отображение = РежимОтображения;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВосстановитьНастройки();
	
КонецПроцедуры
