//#Если Не ТолстыйКлиентУправляемоеПриложение Или Сервер Тогда

//// СтандартныеПодсистемы.ВерсионированиеОбъектов

//// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
////
//// Параметры:
////  Настройки - Структура - настройки подсистемы.
//Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

//КонецПроцедуры

//// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


//#Область ОбновлениеИнформационнойБазы

//Процедура ЗаполнитьТабличнуюЧастьФизическихЛицИНаборыЗначенийДоступа() Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	РеестрФизическиеЛица.Ссылка КАК Ссылка
//	|ПОМЕСТИТЬ РеестрыСФизическимиЛицами
//	|ИЗ
//	|	Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.ФизическиеЛица КАК РеестрФизическиеЛица
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РеестрСведения.Ссылка КАК Ссылка,
//	|	ЗаявлениеСотрудника.ФизическоеЛицо КАК ФизическоеЛицо
//	|ИЗ
//	|	Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.СведенияНеобходимыеДляНазначенияПособий КАК РеестрСведения
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеСотрудникаНаВыплатуПособия КАК ЗаявлениеСотрудника
//	|		ПО РеестрСведения.Заявление = ЗаявлениеСотрудника.Ссылка
//	|ГДЕ
//	|	НЕ РеестрСведения.Ссылка В
//	|				(ВЫБРАТЬ
//	|					РеестрыСФизическимиЛицами.Ссылка
//	|				ИЗ
//	|					РеестрыСФизическимиЛицами)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка,
//	|	ФизическоеЛицо";
//	Результат = Запрос.Выполнить();
//	
//	Если Не Результат.Пустой() Тогда
//		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//		Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
//			Документ = Выборка.Ссылка.ПолучитьОбъект();
//			Пока Выборка.Следующий() Цикл
//				ЗаполнитьЗначенияСвойств(Документ.ФизическиеЛица.Добавить(), Выборка, "ФизическоеЛицо");			
//			КонецЦикла;
//			Документ.ОбменДанными.Загрузка = Истина;
//			Документ.ДополнительныеСвойства.Вставить("ЗаписатьНаборыЗначенийДоступа", Истина);
//			Документ.Записать(РежимЗаписиДокумента.Запись);
//		КонецЦикла;	
//	КонецЕсли;
//	
//КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

//#Область Печать

//// Заполняет список команд печати.
//// 
//// Параметры:
////   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
////
//Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ФормированиеФайла

//Функция ПолучитьФайлДляОтправки(Ссылка, Отказ) Экспорт
//	
//	ОписаниеФайла = ПолучитьОписаниеФайла(Ссылка, Отказ);
//	
//	Если Отказ Тогда
//		Возврат Неопределено
//	КонецЕсли;
//	
//	ТекстФайла 	= ОписаниеФайла.ТекстФайла;
//	ИмяФайла 	= ЗарплатаКадры.ЗаписатьФайлОтчетностиНаДиск(ОписаниеФайла.ИмяФайла, ТекстФайла);
//	
//	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
//	СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
//	
//	ФайлДляОтправки = Новый Структура("АдресФайлаВыгрузки, ИмяФайлаВыгрузки, ТипФайлаВыгрузки, КодировкаФайлаВыгрузки");
//	
//	ФайлДляОтправки.ИмяФайлаВыгрузки 		= ОписаниеФайла.ИмяФайла+".xml";
//	ФайлДляОтправки.АдресФайлаВыгрузки 		= СсылкаНаДвоичныеДанныеФайла;
//	ФайлДляОтправки.ТипФайлаВыгрузки 		= "РеестрЗаявленийНаВыплатуПособийДляПередачиВФСС";
//	ФайлДляОтправки.КодировкаФайлаВыгрузки 	= КодировкаТекста.ANSI;
//	
//	Возврат ФайлДляОтправки;
//	
//КонецФункции

//Функция ПолучитьОписаниеФайла(Ссылка, Отказ) Экспорт
//	
//	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапкеДокумента(Ссылка).Выбрать();
//	ВыборкаПоШапкеДокумента.Следующий();
//	
//	ОписаниеРеестра  = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Ссылка, ВидРеестра, Дата");
//	
//	ВыборкаСведенийДляРасчетаПособия = СформироватьЗапросСведенийДляРасчетаПособия(ОписаниеРеестра).Выбрать();
//	
//	ОписаниеФайла = Новый Структура("ИмяФайла, ТекстФайла, Описание");
//	ОписаниеФайла.ИмяФайла = ИмяФайла(Ссылка);
//	ОписаниеФайла.ТекстФайла = СформироватьФайлРеестра(ОписаниеРеестра, Ссылка, Отказ, ВыборкаПоШапкеДокумента, ВыборкаСведенийДляРасчетаПособия);
//	
//	ПолноеИмяФайла = ЗарплатаКадры.ЗаписатьФайлОтчетностиНаДиск(ОписаниеФайла.ИмяФайла, ОписаниеФайла.ТекстФайла);
//	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
//	ОписаниеФайла.Описание = Новый ОписаниеПередаваемогоФайла(ОписаниеФайла.ИмяФайла + ".xml", ПоместитьВоВременноеХранилище(ДвоичныеДанные));
//	
//	Возврат	ОписаниеФайла;
//	
//КонецФункции 

//Функция СформироватьФайлРеестра(ОписаниеРеестра, Ссылка, Отказ, ВыборкаПоШапкеДокумента, ВыборкаСведенийДляРасчетаПособия)
//	
//	НачалоНомераСтроки = ИмяФайла(Ссылка) + ":";
//	
//	НомерДокументаВПачке = 0;
//	
//	ROWSET = ПрямыеВыплатыПособийСоциальногоСтрахования.КорневойЭлементРеестраПилотногоПроектаФСС();	
//	
//	ROWSET.author 			= ?(ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ФИОСоставителя), ВыборкаПоШапкеДокумента.ФИОСоставителя, "");
//	ROWSET.version 			= "1.7.2";
//	ROWSET.software 		= Лев("1С:" + Метаданные.Синоним, 255);
//	ROWSET.version_software = Лев(Метаданные.Версия, 15);
//	ROWSET.phone 			= ВыборкаПоШапкеДокумента.ТелефонСоставителя;
//	ROWSET.email 			= ВыборкаПоШапкеДокумента.АдресЭлектроннойПочтыСоставителя;
//	ROWSET.EMPL_OGRN 		= ВыборкаПоШапкеДокумента.ОГРНОрганизации;
//	ROWSET.EMPL_REG_NO		= ВыборкаПоШапкеДокумента.РегистрационныйНомерФСС;
//	ROWSET.EMPL_KPP 		= ВыборкаПоШапкеДокумента.КППОрганизации;
//	ROWSET.EMPL_INN 		= ВыборкаПоШапкеДокумента.ИННОрганизации;
//	
//	СписокROW = ПрямыеВыплатыПособийСоциальногоСтрахования.СписокЭлементовРеестраПилотногоПроектаФСС(ROWSET);
//	
//	СписокФизлиц = Новый Массив;
//	СписокФизлиц.Добавить(ВыборкаПоШапкеДокумента.Руководитель);
//	СписокФизлиц.Добавить(ВыборкаПоШапкеДокумента.ГлавныйБухгалтер);
//	
//	КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СписокФизлиц, "ФИОПолные");
//	ФИОРуководителя = КадровыеДанныеФизическихЛиц.Найти(ВыборкаПоШапкеДокумента.Руководитель, "ФизическоеЛицо");
//	ФИОГлавногоБухгалтера = КадровыеДанныеФизическихЛиц.Найти(ВыборкаПоШапкеДокумента.ГлавныйБухгалтер, "ФизическоеЛицо");
//	
//	Пока ВыборкаСведенийДляРасчетаПособия.Следующий()	Цикл
//		
//		НомерДокументаВПачке 	= НомерДокументаВПачке + 1;
//		
//		ROW 					= ПрямыеВыплатыПособийСоциальногоСтрахования.ЭлементРеестраПилотногоПроектаФСС(ROWSET);
//		ROW.BATCH_NO 			= НачалоНомераСтроки + Формат(НомерДокументаВПачке,"ЧЦ=10; ЧГ=0");
//		ROW.EMPLOYER 			= ВыборкаПоШапкеДокумента.ОрганизацияСокращенно;
//		ROW.EMPL_OGRN 			= ВыборкаПоШапкеДокумента.ОГРНОрганизации;
//		ROW.EMPL_REG_NO			= ВыборкаПоШапкеДокумента.РегистрационныйНомерФСС;
//		ROW.EMPL_PARENT_NO 		= ВыборкаПоШапкеДокумента.КодПодчиненностиФСС;
//		ROW.EMPL_KPP 			= ВыборкаПоШапкеДокумента.КППОрганизации;
//		ROW.EMPL_INN 			= ВыборкаПоШапкеДокумента.ИННОрганизации;
//		
//		ROW.APPROVE1 			= ?(ФИОРуководителя <> Неопределено, ФИОРуководителя.ФИОПолные,"");
//		ROW.APPROVE1_ROLE 		= ВыборкаПоШапкеДокумента.ДолжностьРуководителя;
//		
//		Если ЗначениеЗаполнено(ФИОГлавногоБухгалтера) Тогда
//			ROW.APPROVE2 		= ?(ФИОГлавногоБухгалтера <> Неопределено, ФИОГлавногоБухгалтера.ФИОПолные, "");
//		КонецЕсли;
//		
//		ЗаполнитьСтрокуРеестра(ROW, ВыборкаСведенийДляРасчетаПособия);
//		
//		СписокROW.Добавить(ROW);
//		
//	КонецЦикла;
//	
//	СтрокаXML = ПрямыеВыплатыПособийСоциальногоСтрахования.ЗаписатьРеестрВСтрокуXML(ROWSET);
//	
//	Возврат СтрокаXML;
//	
//КонецФункции 

//Функция ПредставлениеСтатусаНалогоплательщикаДляРеестра(СтатусНалогоплательщика)
//	
//	ПредставлениеСтатусаНалогоплательщика = 0;
//	
//	Если СтатусНалогоплательщика = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент") Тогда
//		ПредставлениеСтатусаНалогоплательщика = 1;	
//	ИначеЕсли СтатусНалогоплательщика = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент") Тогда
//		ПредставлениеСтатусаНалогоплательщика = 2;	
//	КонецЕсли;
//	
//	Возврат ПредставлениеСтатусаНалогоплательщика;
//	
//КонецФункции

//Процедура ЗаполнитьСтрокуРеестра(ROW, СтруктураДанных)
//	
//	ROW.TYPE_INFO = Формат(СтруктураДанных.Перерасчет,"БЛ=0; БИ=1");
//	
//	Если СтруктураДанных.ВидВыплаты = "1" Тогда
//		ROW.FSS_PAYMENT_FLAG = ?(ЗначениеЗаполнено(СтруктураДанных.ДатаНачалаОплаты), 1, 0);
//	КонецЕсли;
//	
//	Если СтруктураДанных.Перерасчет Тогда
//		ROW.RECALC_REASON_CODE = Число(СтруктураДанных.КодПричиныПерерасчета);
//	КонецЕсли;
//	
//	ROW.DOC_TYPE 		= СтруктураДанных.ВидВыплаты;
//	ROW.DOC_DT1 		= СтруктураДанных.ДатаПредставленияПакетаДокументов;
//	ROW.SNILS			= СтрЗаменить(СтрЗаменить(СтруктураДанных.СтраховойНомерПФР, "-","")," ","");
//	ROW.INN_PERSON 		= СтруктураДанных.ИНН;
//	ROW.SURNAME 		= СтруктураДанных.Фамилия;
//	ROW.NAME 			= СтруктураДанных.Имя;
//	ROW.PATRONIMIC 		= СтруктураДанных.Отчество;
//	
//	ROW.RESIDENT_FLAG 	= ПредставлениеСтатусаНалогоплательщикаДляРеестра(СтруктураДанных.СтатусНалогоплательщика);
//	
//	ROW.RESIDENT_CODE	= СтруктураДанных.КодСтраны;
//	ROW.BIRTHDAY 		= СтруктураДанных.ДатаРождения;
//	ROW.GENDER 			= Формат(СтруктураДанных.Пол = Перечисления.ПолФизическогоЛица.Женский, "БЛ=0; БИ=1");
//	ROW.ID_TYPE 		= СтруктураДанных.ВидУдостоверенияЛичности;
//	ROW.ID_NO 			= СтруктураДанных.СерияДокумента + " " + СтруктураДанных.НомерДокумента;
//	ROW.ID_DT 			= СтруктураДанных.ДатаВыдачиДокумента;
//	ROW.ID_DEPT 		= СтруктураДанных.КемВыданДокумент;
//	ROW.OWNER_FLAG 		= 1;
//	ROW.PAYMENT_TYPE 	= Формат(СтруктураДанных.ПеречислятьПособиеПочтовымПереводом,"БЛ=1; БИ=0");
//	
//	ROW.EMPL_FLAG 		= Формат(СтруктураДанных.Совместительство,"БЛ=1; БИ=0");
//	
//	Если СтруктураДанных.ПеречислятьПособиеПочтовымПереводом Тогда
//		
//		ТипАдреса = Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица;
//		ОписаниеАдреса = УчетПособийСоциальногоСтрахования.ОписаниеАдреса(СтруктураДанных.АдресПочтовый, ТипАдреса);
//		
//		КодКладр = ?(СтрДлина(Формат(ОписаниеАдреса.КодКЛАДР, "ЧГ=0")) = 16, "0" + Формат(ОписаниеАдреса.КодКЛАДР, "ЧГ=0"), Формат(ОписаниеАдреса.КодКЛАДР, "ЧГ=0")); 
//		
//		ROW.ADDR_KLADR 		= "#" + КодКладр;
//		ROW.POST_INDEX 		= ОписаниеАдреса.Индекс;
//		ROW.ADDR_A1 		= ОписаниеАдреса.Регион;
//		ROW.ADDR_A2 		= ОписаниеАдреса.Район;
//		ROW.ADDR_A3 		= ОписаниеАдреса.Город;
//		ROW.ADDR_A4 		= ОписаниеАдреса.НаселенныйПункт;
//		ROW.ADDR_A5 		= ОписаниеАдреса.Улица;
//		ROW.ADDR_HOUSE 		= ОписаниеАдреса.Дом;
//		ROW.ADDR_BUILDING 	= ОписаниеАдреса.Корпус;
//		ROW.ADDR_FLAT 		= ОписаниеАдреса.Квартира;
//	Иначе
//		ROW.ACCOUNT_BIC 	= СтруктураДанных.БИКБанка;
//		ROW.ACCOUNT_NAME 	= СтруктураДанных.НаименованиеБанка;
//		ROW.ACCOUNT 		= ОставитьТолькоЦифрыВСтроке(СтруктураДанных.НомерЛицевогоСчета);
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(СтруктураДанных.АдресРегистрации) Тогда
//		Если СтруктураДанных.СтатусНалогоплательщика = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент") Тогда	
//			
//			ТипАдреса = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица;
//			ОписаниеАдреса = УчетПособийСоциальногоСтрахования.ОписаниеАдреса(СтруктураДанных.АдресРегистрации, ТипАдреса);
//			
//			КодКладр = ?(СтрДлина(Формат(ОписаниеАдреса.КодКЛАДР, "ЧГ=0")) = 16, "0" + Формат(ОписаниеАдреса.КодКЛАДР, "ЧГ=0"), Формат(ОписаниеАдреса.КодКЛАДР, "ЧГ=0")); 
//			
//			ROW.ADDR2_KLADR 		= "#" + КодКладр;
//			ROW.POST_INDEX2 		= ОписаниеАдреса.Индекс;
//			ROW.ADDR2_A1 			= ОписаниеАдреса.Регион;
//			ROW.ADDR2_A2 			= ОписаниеАдреса.Район;
//			ROW.ADDR2_A3 			= ОписаниеАдреса.Город;
//			ROW.ADDR2_A4 			= ОписаниеАдреса.НаселенныйПункт;
//			ROW.ADDR2_A5 			= ОписаниеАдреса.Улица;
//			ROW.ADDR2_HOUSE 		= ОписаниеАдреса.Дом;
//			ROW.ADDR2_BUILDING 		= ОписаниеАдреса.Корпус;
//			ROW.ADDR2_FLAT 			= ОписаниеАдреса.Квартира;
//		Иначе
//			
//			ТипАдреса = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица;
//			ROW.ADDR2 = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(СтруктураДанных.АдресРегистрации, ТипАдреса);
//			
//		КонецЕсли;
//	КонецЕсли;
//		
//	ROW.CALC_METHOD = 1;
//	Если СтруктураДанных.РайонныйКоэффициент >= 1.10 И СтруктураДанных.РайонныйКоэффициент <= 3 Тогда
//		ROW.KF_REG 		= СтруктураДанных.РайонныйКоэффициент * 100;
//	Иначе
//		ROW.KF_REG 		= 100;
//	КонецЕсли;
//	
//	Если СтруктураДанных.ВидВыплаты = "1" Или СтруктураДанных.ВидВыплаты = "2" Тогда
//		Если ЗначениеЗаполнено(СтруктураДанных.ПериодПростояС) И ЗначениеЗаполнено(СтруктураДанных.ПериодПростояПо) Тогда
//			СтрокаПериодов 				= ROW.PERIODS.PERIOD.Добавить();
//			СтрокаПериодов.START_DATE 	= Формат(СтруктураДанных.ПериодПростояС, "ДФ=yyyy-MM-dd");
//			СтрокаПериодов.END_DATE 	= Формат(СтруктураДанных.ПериодПростояПо, "ДФ=yyyy-MM-dd");
//			СтрокаПериодов.IDLE_AVERAGE = СтруктураДанных.СреднийЗаработокНаПериодПростоя;
//		КонецЕсли;
//		ROW.INSUR_YY 	= СтруктураДанных.СтажЛет;
//		ROW.INSUR_MM 	= СтруктураДанных.СтажМесяцев;
//		РазностьСтажей 	= УчетПособийСоциальногоСтрахования.ПодсчитатьРазностьСтажейВГодахИМесяцах(СтруктураДанных.СтажРасширенныйЛет,
//																								 СтруктураДанных.СтажРасширенныйМесяцев, 
//																								 СтруктураДанных.СтажЛет, 
//																								 СтруктураДанных.СтажМесяцев);
//		ЛетСтажа 		= РазностьСтажей.РазностьЛет;
//		МесяцевСтажа 	= РазностьСтажей.РазностьМесяцев;

//		Если ЛетСтажа <> 0 ИЛИ МесяцевСтажа <> 0 Тогда
//			ROW.NOT_INSUR_YY 	= ЛетСтажа;
//			ROW.NOT_INSUR_MM 	= МесяцевСтажа;
//		КонецЕсли;
//		ROW.LN_CODE 			= СтруктураДанных.НомерВходящегоДокумента;
//		Если ЗначениеЗаполнено(СтруктураДанных.НомерПервичногоБольничного) Тогда
//			ROW.PREV_LN_CODE 	= СтруктураДанных.НомерПервичногоБольничного;
//			ROW.PRIMARY_FLAG 	= 0;
//		Иначе
//			ROW.PRIMARY_FLAG 	= 1;
//		КонецЕсли;
//		ROW.DUPLICATE_FLAG = Формат(СтруктураДанных.ЯвляетсяДубликатом, "БЛ=0; БИ=1");
//		ROW.LN_DATE 	= Формат(СтруктураДанных.ДатаВыдачиБольничного, "ДФ=yyyy-MM-dd");
//		ROW.LPU_NAME 	= СтруктураДанных.НаименованиеЛПУ;
//		ROW.LPU_OGRN 	= СтруктураДанных.ОГРН_ЛПУ;
//		ROW.REASON1 	= СтруктураДанных.КодПричиныНетрудоспособности;
//		ROW.REASON2 	= СтруктураДанных.ДополнительныйКодПричиныНетрудоспособности;
//		ROW.REASON3 	= СтруктураДанных.ВторойКодПричиныНетрудоспособности;
//		Если СтруктураДанных.Совместительство Тогда
//			ROW.PARENT_CODE = СтруктураДанных.НомерЛисткаПоОсновномуМестуРаботы;
//		КонецЕсли;
//		ROW.DATE1 			= Формат(СтруктураДанных.ДатаИзмененияКодаПричиныНетрудоспособности, "ДФ=yyyy-MM-dd");    
//		ROW.DATE2 			= Формат(СтруктураДанных.ДатаОкончанияПутевки, "ДФ=yyyy-MM-dd");
//		ROW.VOUCHER_NO 		= СтруктураДанных.НомерПутевки;
//		ROW.VOUCHER_OGRN 	= СтруктураДанных.ОГРН_Санатория;
//		Если ЗначениеЗаполнено(СтруктураДанных.УходЗаРодственникомФИО1) Тогда
//			ROW.SERV1_AGE 			= СтруктураДанных.УходЗаРодственникомЛет1;
//			ROW.SERV1_MM 			= СтруктураДанных.УходЗаРодственникомМесяцев1;
//			ROW.SERV1_RELATION_CODE = СтруктураДанных.УходЗаРодственникомРодственнаяСвязь1;
//			ROW.SERV1_FIO 			= СтруктураДанных.УходЗаРодственникомФИО1;
//			ROW.SERV1_DAYS 			= СтруктураДанных.УходЗаРодственникомИспользованоДней1;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.УходЗаРодственникомФИО2) Тогда
//			ROW.SERV2_AGE 			= СтруктураДанных.УходЗаРодственникомЛет2;
//			ROW.SERV2_MM 			= СтруктураДанных.УходЗаРодственникомМесяцев2;
//			ROW.SERV2_RELATION_CODE = СтруктураДанных.УходЗаРодственникомРодственнаяСвязь2;
//			ROW.SERV2_FIO 			= СтруктураДанных.УходЗаРодственникомФИО2;
//			ROW.SERV2_DAYS 			= СтруктураДанных.УходЗаРодственникомИспользованоДней2;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.ПериодНахожденияВСтационареСРебенкомС) И ЗначениеЗаполнено(СтруктураДанных.ПериодНахожденияВСтационареСРебенкомПо) Тогда
//			ROW.HOSPITAL_DT1 		= Формат(СтруктураДанных.ПериодНахожденияВСтационареСРебенкомС, "ДФ=yyyy-MM-dd");
//			ROW.HOSPITAL_DT2		= Формат(СтруктураДанных.ПериодНахожденияВСтационареСРебенкомПо, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.КодНарушенияРежима) И ЗначениеЗаполнено(СтруктураДанных.ДатаНарушенияРежима) Тогда
//			ROW.HOSPITAL_BREACH_CODE 	= СтруктураДанных.КодНарушенияРежима;
//			ROW.HOSPITAL_BREACH_DT 		= Формат(СтруктураДанных.ДатаНарушенияРежима, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		ROW.MSE_DT1 = Формат(СтруктураДанных.ДатаНаправленияВБюроМСЭ, "ДФ=yyyy-MM-dd");
//		ROW.MSE_DT2 = Формат(СтруктураДанных.ДатаРегистрацииДокументовМСЭ, "ДФ=yyyy-MM-dd");
//		ROW.MSE_DT3 = Формат(СтруктураДанных.ДатаОсвидетельствованияМСЭ, "ДФ=yyyy-MM-dd");
//		Если ЗначениеЗаполнено(СтруктураДанных.ГруппаИнвалидности) Тогда
//			ROW.MSE_INVALID_GROUP = СтруктураДанных.ГруппаИнвалидности;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.ДнейБолезниИнвалида) Тогда
//			ROW.MSE_INVALID_DAYS = СтруктураДанных.ДнейБолезниИнвалида;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.НовыйСтатусНетрудоспособного) Тогда
//			ROW.MSE_RESULT = СтруктураДанных.НовыйСтатусНетрудоспособного;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеС1) И ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеПо1) Тогда
//			ROW.TREAT1_DT1 			= Формат(СтруктураДанных.ОсвобождениеС1, "ДФ=yyyy-MM-dd");
//			ROW.TREAT1_DT2 			= Формат(СтруктураДанных.ОсвобождениеПо1, "ДФ=yyyy-MM-dd");
//			ROW.TREAT1_DOCTOR_ROLE 	= СтруктураДанных.ДолжностьВрача1;
//			ROW.TREAT1_DOCTOR 		= СтруктураДанных.ФИОВрача1;
//			ROW.TREAT1_DOC_ID 		= СтруктураДанных.ИдентификационныйНомерВрача1;
//			ROW.TREAT1_DOCTOR2_ROLE = СтруктураДанных.ДолжностьВрачаПредседателяВК1;
//			ROW.TREAT1_CHAIRMAN_VK 	= СтруктураДанных.ФИОВрачаПредседателяВК1;
//			ROW.TREAT1_DOC2_ID 		= СтруктураДанных.ИдентификационныйНомерВрачаПредседателяВК1;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеС2) И ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеПо2) Тогда
//			ROW.TREAT2_DT1 			= Формат(СтруктураДанных.ОсвобождениеС2, "ДФ=yyyy-MM-dd");
//			ROW.TREAT2_DT2 			= Формат(СтруктураДанных.ОсвобождениеПо2, "ДФ=yyyy-MM-dd");
//			ROW.TREAT2_DOCTOR_ROLE 	= СтруктураДанных.ДолжностьВрача2;
//			ROW.TREAT2_DOCTOR 		= СтруктураДанных.ФИОВрача2;
//			ROW.TREAT2_DOC_ID 		= СтруктураДанных.ИдентификационныйНомерВрача2;
//			ROW.TREAT2_DOCTOR2_ROLE = СтруктураДанных.ДолжностьВрачаПредседателяВК2;
//			ROW.TREAT2_CHAIRMAN_VK 	= СтруктураДанных.ФИОВрачаПредседателяВК2;
//			ROW.TREAT2_DOC2_ID 		= СтруктураДанных.ИдентификационныйНомерВрачаПредседателяВК2;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеС3) И ЗначениеЗаполнено(СтруктураДанных.ОсвобождениеПо3) Тогда
//			ROW.TREAT3_DT1 			= Формат(СтруктураДанных.ОсвобождениеС3, "ДФ=yyyy-MM-dd");
//			ROW.TREAT3_DT2 			= Формат(СтруктураДанных.ОсвобождениеПо3, "ДФ=yyyy-MM-dd");
//			ROW.TREAT3_DOCTOR_ROLE 	= СтруктураДанных.ДолжностьВрача3;
//			ROW.TREAT3_DOCTOR 		= СтруктураДанных.ФИОВрача3;
//			ROW.TREAT3_DOC_ID 		= СтруктураДанных.ИдентификационныйНомерВрача3;
//			ROW.TREAT3_DOCTOR2_ROLE = СтруктураДанных.ДолжностьВрачаПредседателяВК3;
//			ROW.TREAT3_CHAIRMAN_VK 	= СтруктураДанных.ФИОВрачаПредседателяВК3;
//			ROW.TREAT3_DOC2_ID 		= СтруктураДанных.ИдентификационныйНомерВрачаПредседателяВК3;
//		КонецЕсли;
//		ROW.OTHER_STATE_DT 			= Формат(СтруктураДанных.ДатаНовыйСтатусНетрудоспособного, "ДФ=yyyy-MM-dd");
//		ROW.RETURN_DATE_LPU 		= Формат(СтруктураДанных.ДатаВыходаНаРаботу, "ДФ=yyyy-MM-dd");
//		ROW.NEXT_LN_CODE 			= СтруктураДанных.НомерЛисткаПродолжения;
//		ROW.CALC_CONDITION1 		= СтруктураДанных.УсловияИсчисленияКод1;
//		ROW.CALC_CONDITION2 		= СтруктураДанных.УсловияИсчисленияКод2;
//		ROW.CALC_CONDITION3 		= СтруктураДанных.УсловияИсчисленияКод3;
//		Если СтруктураДанных.УсловияИсчисленияКод1 = "43" Или СтруктураДанных.УсловияИсчисленияКод2 = "43" Или СтруктураДанных.УсловияИсчисленияКод3 = "43" Тогда
//			Если СтруктураДанных.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ОснованияФинансированияПособияФедеральнымБюджетом.Чернобыль Тогда
//				ROW.CODE_NUCLEAR 	= 1;
//			ИначеЕсли СтруктураДанных.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ОснованияФинансированияПособияФедеральнымБюджетом.Семипалатинск Тогда
//				ROW.CODE_NUCLEAR 	= 2;
//			ИначеЕсли СтруктураДанных.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ОснованияФинансированияПособияФедеральнымБюджетом.Маяк Тогда
//				ROW.CODE_NUCLEAR 	= 3;
//			ИначеЕсли СтруктураДанных.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ОснованияФинансированияПособияФедеральнымБюджетом.ПодразделенияОсобогоРиска Тогда
//				ROW.CODE_NUCLEAR	= 4;
//			КонецЕсли;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.ДатаАктаФормыН1) Тогда
//			ROW.FORM1_DT 			= Формат(СтруктураДанных.ДатаАктаФормыН1, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.ДатаНачалаРаботы) Тогда
//			ROW.RETURN_DATE_EMPL 	= Формат(СтруктураДанных.ДатаНачалаРаботы, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.СрочныйДоговорС) И ЗначениеЗаполнено(СтруктураДанных.СрочныйДоговорПо) Тогда
//			ROW.WORK_CONTRACT_START_DT 	= Формат(СтруктураДанных.СрочныйДоговорС, "ДФ=yyyy-MM-dd");
//			ROW.WORK_CONTRACT_FINISH_DT = Формат(СтруктураДанных.СрочныйДоговорПо, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.ДатаНачалаОплаты) Тогда
//			ROW.DT1 = Формат(СтруктураДанных.ДатаНачалаОплаты, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.ДатаОкончанияОплаты) Тогда
//			ROW.DT2 = Формат(СтруктураДанных.ДатаОкончанияОплаты, "ДФ=yyyy-MM-dd");
//		КонецЕсли;		
//		Если ЗначениеЗаполнено(СтруктураДанных.СуммаПособияРаботодателя) Тогда
//			ROW.EMPL_PAYMENT 	= СтруктураДанных.СуммаПособияРаботодателя;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.СуммаПособияФСС) Тогда
//			ROW.FSS_PAYMENT		= СтруктураДанных.СуммаПособияФСС;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.СуммаПособияВсего) Тогда
//			ROW.PAYMENT 		= СтруктураДанных.СуммаПособияВсего;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Если СтруктураДанных.ВидВыплаты = "2" Или СтруктураДанных.ВидВыплаты = "3" Тогда
//		ROW.PREGN12W_FLAG = Формат(СтруктураДанных.ПоставленаНаУчетВРанниеСрокиБеременности И СтруктураДанных.ВидВыплаты = "3","БЛ=0; БИ=1");
//	КонецЕсли;
//	
//	Если СтруктураДанных.ВидВыплаты = "1" Или СтруктураДанных.ВидВыплаты = "2" Или СтруктураДанных.ВидВыплаты = "5" Тогда
//		ROW.BASE_AVG_DAILY_SAL = СтруктураДанных.СреднийДневнойЗаработок;
//		Если СтруктураДанных.ПорядокРасчетаСреднегоЗаработка = Перечисления.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.СреднийЗаработок
//			И НЕ СтруктураДанных.СчитатьПоПравилам2010Года Тогда
//			ROW.YEAR1 = СтруктураДанных.ПервыйГодРасчета;
//			ROW.YEAR2 = СтруктураДанных.ВторойГодРасчета; 
//			
//			Если СтруктураДанных.ЗамененыКалендарныеГодыРасчетаСреднегоЗаработка Тогда
//				ROW.YEAR_CHANGE_FLAG = 1;
//				ROW.YEAR1_OLD = СтруктураДанных.ЗамененныйПервыйГодРасчета;
//				ROW.YEAR2_OLD = СтруктураДанных.ЗамененныйВторойГодРасчета;
//			Иначе
//				ROW.YEAR_CHANGE_FLAG = 0;
//			КонецЕсли;	
//			
//			Если СтруктураДанных.ВидВыплаты = "2" Или СтруктураДанных.ВидВыплаты = "5" Тогда
//				ROW.BASE_CALC_DAYS = СтруктураДанных.КалендарныхДнейРасчетногоПериода;
//			КонецЕсли;
//			
//			ROW.BASE_SUM1 = СтруктураДанных.ЗаработокПервыйГодРасчета;
//			ROW.BASE_SUM2 = СтруктураДанных.ЗаработокВторойГодРасчета;
//			ROW.BASE_AVG_SAL = СреднийЗаработокЗаДваКалендарныхГода(СтруктураДанных, Истина);
//			
//		Иначе
//			ROW.CALC_METHOD = 0;
//			ROW.BASE_CALC_DAYS = СтруктураДанных.КалендарныхДнейРасчетногоПериода;
//			ROW.CALC_MH_PERIOD_START = Формат(СтруктураДанных.ПериодРасчетаСреднегоЗаработкаНачало, "ДФ=yyyy-MM-dd");
//			ROW.CALC_MH_PERIOD_FINISH = Формат(СтруктураДанных.ПериодРасчетаСреднегоЗаработкаОкончание, "ДФ=yyyy-MM-dd");
//			Если СтруктураДанных.ПорядокРасчетаСреднегоЗаработка = Перечисления.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.СреднийЗаработок
//				И СтруктураДанных.СчитатьПоПравилам2010Года Тогда
//				ROW.BASE_AVG_SAL = СтруктураДанных.ЗаработокЗаПериодРасчета;
//			Иначе
//				Если СтруктураДанных.ПорядокРасчетаСреднегоЗаработка = Перечисления.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзТарифнойСтавки Тогда
//					ROW.ROLE_WAGE = СтруктураДанных.ТарифнаяСтавкаОклад;
//				ИначеЕсли СтруктураДанных.ПорядокРасчетаСреднегоЗаработка = Перечисления.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзМРОТ Тогда
//					ROW.ROLE_WAGE = СтруктураДанных.МРОТ;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//		Если СтруктураДанных.ДоляВремени > 0 И СтруктураДанных.ДоляВремени < 1 Тогда
//			ROW.KF_SHORT_DAY = СтруктураДанных.ДоляВремени;
//		Иначе
//			ROW.KF_SHORT_DAY = 1;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Если СтруктураДанных.ВидВыплаты = "3" Тогда
//		ROW.REF_12WEEK_NO = СтруктураДанных.НомерСправкиБеременной;
//		ROW.REF_12WEEK_DT = Формат(СтруктураДанных.ДатаСправкиБеременной, "ДФ=yyyy-MM-dd");
//	КонецЕсли;
//	
//	Если СтруктураДанных.ВидВыплаты = "4" Тогда
//		
//		Если ЗначениеЗаполнено(СтруктураДанных.ВидСправкиОРожденииРебенка) И ЗначениеЗаполнено(СтруктураДанных.НомерСправки) И ЗначениеЗаполнено(СтруктураДанных.ДатаСправки) Тогда
//			Если СтруктураДанных.ВидСправкиОРожденииРебенка = Перечисления.ФормыСправкиОРожденииРебенка.Форма24 Тогда
//				ВидСправкиОРожденииРебенка = "24"; 
//			ИначеЕсли СтруктураДанных.ВидСправкиОРожденииРебенка = Перечисления.ФормыСправкиОРожденииРебенка.Форма25 Тогда
//				ВидСправкиОРожденииРебенка = "25"; 
//			ИначеЕсли СтруктураДанных.ВидСправкиОРожденииРебенка = Перечисления.ФормыСправкиОРожденииРебенка.Форма26 Тогда
//				ВидСправкиОРожденииРебенка = "26"; 
//			КонецЕсли;	
//			ROW.REF_TYPE = ВидСправкиОРожденииРебенка;
//			ROW.REF_24_NO = СтруктураДанных.НомерСправки;
//			ROW.REF_24_DT = Формат(СтруктураДанных.ДатаСправки, "ДФ=yyyy-MM-dd");
//		Иначе 	
//			Если ЗначениеЗаполнено(СтруктураДанных.ДокументОРожденииДатаВыдачи) Тогда
//				ROW.O_CERT_NO = СтруктураДанных.ДокументОРожденииСерияНомер;
//				ROW.O_CERT_DT = Формат(СтруктураДанных.ДокументОРожденииДатаВыдачи, "ДФ=yyyy-MM-dd");
//			Иначе
//				ROW.O_CERT_NO = СтруктураДанных.НомерИногоПодтвержденияРождения;
//				ROW.O_CERT_DT = Формат(СтруктураДанных.ДатаИногоПодтвержденияРождения, "ДФ=yyyy-MM-dd");
//			КонецЕсли;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.НомерДоговораОПередачеНаВоспитание) И ЗначениеЗаполнено(СтруктураДанных.ДатаДоговораОПередачеНаВоспитание) Тогда
//			ROW.REF_FAMILY_NO = СтруктураДанных.НомерДоговораОПередачеНаВоспитание;
//			ROW.REF_FAMILY_DT = Формат(СтруктураДанных.ДатаДоговораОПередачеНаВоспитание, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		ROW.REF_NPAY_OTHER_NO = СтруктураДанных.НомерСправкиОтДругогоРодителя;
//		ROW.REF_NPAY_OTHER_DT = Формат(СтруктураДанных.ДатаСправкиОтДругогоРодителя, "ДФ=yyyy-MM-dd"); 
//		
//	КонецЕсли;
//	
//	Если СтруктураДанных.ВидВыплаты = "4" Или СтруктураДанных.ВидВыплаты = "5" Тогда
//		
//		ROW.CERT_BR = Формат(СтруктураДанных.ДатаРожденияРебенка, "ДФ=yyyy-MM-dd");
//		ROW.CERT_SURNAME = СтруктураДанных.ФамилияРебенка;
//		ROW.CERT_NAME = СтруктураДанных.ИмяРебенка;
//		ROW.CERT_PATRONIMIC = СтруктураДанных.ОтчествоРебенка;
//		Если ЗначениеЗаполнено(СтруктураДанных.УсыновлениеОпека) Тогда
//			ROW.WARD_FLAG = СтруктураДанных.УсыновлениеОпека;
//			ROW.WARD_REF_NO = СтруктураДанных.УсыновлениеОпекаСерияНомер;
//			ROW.WARD_REF_DT = Формат(СтруктураДанных.УсыновлениеОпекаДатаВыдачи,"ДФ=yyyy-MM-dd");
//		КонецЕсли;
//	КонецЕсли;
//	
//	Если СтруктураДанных.ВидВыплаты = "5" Тогда
//		
//		ROW.HOLID_DT_ST = Формат(СтруктураДанных.ДатаНачала, "ДФ=yyyy-MM-dd");
//		ROW.HOLID_DT_FN = Формат(СтруктураДанных.ДатаОкончания, "ДФ=yyyy-MM-dd");
//		ROW.MULTPATR = Формат(СтруктураДанных.ОдновременныйУходЗаНесколькимиДетьми,"БЛ=0; БИ=1");
//		ROW.CHILD_SER = СтруктураДанных.Очередность;
//		ROW.MH_OUT = Формат(СтруктураДанных.НаличиеРешенияСудаОЛишенииПрав,"БЛ=0; БИ=1");
//		ROW.OTHER_CHILD_FLAG_DT = Формат(СтруктураДанных.НаличиеДокументаОСмерти,"БЛ=0; БИ=1");
//		ROW.OTHER_CHILD_FLAG_BR = Формат(СтруктураДанных.НаличиеДокументаОРождении,"БЛ=0; БИ=1");
//		
//		Если СтруктураДанных.ДокументОРожденииВид = Перечисления.ВидыПодтверждающихДокументовОтпускаПоУходу.СвидетельствоОРождении Тогда
//			ROW.CERT_NO = СтруктураДанных.ДокументОРожденииСерияНомер;
//			ROW.CERT_DT = Формат(СтруктураДанных.ДокументОРожденииДатаВыдачи, "ДФ=yyyy-MM-dd");
//		Иначе
//			Если ЗначениеЗаполнено(СтруктураДанных.ДокументОРожденииДатаВыдачи) Тогда
//				ROW.O_CERT_NO = СтруктураДанных.ДокументОРожденииСерияНомер;
//				ROW.O_CERT_DT = Формат(СтруктураДанных.ДокументОРожденииДатаВыдачи, "ДФ=yyyy-MM-dd");
//			Иначе
//				ROW.O_CERT_NO = СтруктураДанных.НомерИногоПодтвержденияРождения;
//				ROW.O_CERT_DT = Формат(СтруктураДанных.ДатаИногоПодтвержденияРождения, "ДФ=yyyy-MM-dd");
//			КонецЕсли;
//		КонецЕсли;
//		Если СтруктураДанных.ОдновременныйУходЗаНесколькимиДетьми Тогда
//			ROW.AVG_SAL = СтруктураДанных.СреднийДневнойЗаработок * 30.4;
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.НомерПриказаНаОтпускПоУходуЗаРебенком) И ЗначениеЗаполнено(СтруктураДанных.ДатаПриказаНаОтпускПоУходуЗаРебенком) Тогда
//			ROW.HOLID_ORD_NO = СтруктураДанных.НомерПриказаНаОтпускПоУходуЗаРебенком;
//			ROW.HOLID_ORD_DT = Формат(СтруктураДанных.ДатаПриказаНаОтпускПоУходуЗаРебенком, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.НомерПриказаОЗаменеПослеродовогоОтпуска) И ЗначениеЗаполнено(СтруктураДанных.ДатаПриказаОЗаменеПослеродовогоОтпуска) Тогда
//			ROW.HOLID_CH_ORD_NO = СтруктураДанных.НомерПриказаОЗаменеПослеродовогоОтпуска;
//			ROW.HOLID_CH_ORD_DT = Формат(СтруктураДанных.ДатаПриказаОЗаменеПослеродовогоОтпуска, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.НомерСправкиОНеполученииПособияОтОтца) И ЗначениеЗаполнено(СтруктураДанных.ДатаСправкиОНеполученииПособияОтОтца) Тогда
//			ROW.REF_NPAY_FATHER_NO = СтруктураДанных.НомерСправкиОНеполученииПособияОтОтца;
//			ROW.REF_NPAY_FATHER_DT = Формат(СтруктураДанных.ДатаСправкиОНеполученииПособияОтОтца, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.НомерСправкиОНеполученииПособияОтМатери) И ЗначениеЗаполнено(СтруктураДанных.ДатаСправкиОНеполученииПособияОтМатери) Тогда
//			ROW.REF_NPAY_MOTHER_NO = СтруктураДанных.НомерСправкиОНеполученииПособияОтМатери;
//			ROW.REF_NPAY_MOTHER_DT = Формат(СтруктураДанных.ДатаСправкиОНеполученииПособияОтМатери, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.ДатаСмертиРебенка) Тогда
//			ROW.CERT_DT_DATE = Формат(СтруктураДанных.ДатаСмертиРебенка, "ДФ=yyyy-MM-dd");
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураДанных.ВыплатаЗаСчетФедеральногоБюджета) 
//			И НЕ СтруктураДанных.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ОснованияФинансированияПособияФедеральнымБюджетом.ЗачетНестраховыхПериодов 
//			И ЗначениеЗаполнено(СтруктураДанных.ПроживаниеРаботаВЛьготнойЗоне)
//			И НЕ СтруктураДанных.ПроживаниеРаботаВЛьготнойЗоне = Перечисления.ОтношениеКОсобойЗоне.Нет Тогда
//			
//			Если СтруктураДанных.ПроживаниеРаботаВЛьготнойЗоне = Перечисления.ОтношениеКОсобойЗоне.Проживает Тогда
//				ROW.LIVE_COND_FLAG 	= 1; 
//			ИначеЕсли СтруктураДанных.ПроживаниеРаботаВЛьготнойЗоне = Перечисления.ОтношениеКОсобойЗоне.Работает Тогда	
//				ROW.LIVE_COND_FLAG 	= 2; 
//			КонецЕсли;
//			
//			Если СтруктураДанных.СтатусЛьготнойЗоны = Перечисления.ВидыОсобойЗоныПроживанияРаботы.ЗонаСПравомНаОтселение Тогда
//				ROW.LIVE_COND 		= 1;
//			ИначеЕсли СтруктураДанных.СтатусЛьготнойЗоны = Перечисления.ВидыОсобойЗоныПроживанияРаботы.ЗонаОтселения Тогда	
//				ROW.LIVE_COND 		= 2;
//			ИначеЕсли СтруктураДанных.СтатусЛьготнойЗоны = Перечисления.ВидыОсобойЗоныПроживанияРаботы.ЗонаСЛьготнымСоциальноЭкономическимСтатусом Тогда 
//				ROW.LIVE_COND 		= 3;
//			КонецЕсли;
//			
//			Если СтруктураДанных.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ОснованияФинансированияПособияФедеральнымБюджетом.Чернобыль Тогда
//				ROW.CODE_NUCLEAR = 1;
//			ИначеЕсли СтруктураДанных.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ОснованияФинансированияПособияФедеральнымБюджетом.Семипалатинск Тогда
//				ROW.CODE_NUCLEAR = 2;
//			ИначеЕсли СтруктураДанных.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ОснованияФинансированияПособияФедеральнымБюджетом.Маяк Тогда
//				ROW.CODE_NUCLEAR = 3;
//			ИначеЕсли СтруктураДанных.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ОснованияФинансированияПособияФедеральнымБюджетом.ПодразделенияОсобогоРиска Тогда
//				ROW.CODE_NUCLEAR = 4;
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//Функция ИмяФайла(Ссылка)
//	
//	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка.Организация, "ОбособленноеПодразделение")  Тогда
//		РегистрационныйНомерФСС = Ссылка.ДополнительныйКодФСС;
//	Иначе
//		РегистрационныйНомерФСС = Ссылка.РегистрационныйНомерФСС;
//	КонецЕсли;
//	
//	Возврат "E_" + РегистрационныйНомерФСС + "_" + Формат(Ссылка.Дата,"ДФ=yyyy_MM_dd") + "_" + ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Ссылка.Номер, Истина, Истина);
//	
//КонецФункции 

//Функция СформироватьЗапросПоШапкеДокумента(Ссылка)
//	
//	Запрос = Новый Запрос();
//	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ДанныеДокумента.Дата КАК ДатаПодачиЗаявления,
//	|	ДанныеДокумента.Организация КАК Организация,
//	|	ДанныеДокумента.РегистрационныйНомерФСС,
//	|	ДанныеДокумента.ДополнительныйКодФСС,
//	|	ДанныеДокумента.КодПодчиненностиФСС,
//	|	ДанныеДокумента.Руководитель КАК Руководитель,
//	|	ДанныеДокумента.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
//	|	ДанныеДокумента.РеестрСоставил КАК РеестрСоставил,
//	|	ДанныеДокумента.ТелефонСоставителя,
//	|	ДанныеДокумента.АдресЭлектроннойПочтыСоставителя,
//	|	Должности.Наименование КАК ДолжностьРуководителя,
//	|	ДанныеДокумента.ОГРН КАК ОГРНОрганизации,
//	|	ДанныеДокумента.Ссылка,
//	|	ДанныеДокумента.ИНН КАК ИННОрганизации,
//	|	ДанныеДокумента.КПП КАК КППОрганизации,
//	|	ВЫБОР
//	|		КОГДА (ВЫРАЗИТЬ(ДанныеДокумента.Организация.НаименованиеСокращенное КАК СТРОКА(100))) = """"
//	|			ТОГДА ДанныеДокумента.Организация.НаименованиеПолное
//	|		ИНАЧЕ ДанныеДокумента.Организация.НаименованиеСокращенное
//	|	КОНЕЦ КАК ОрганизацияСокращенно
//	|ПОМЕСТИТЬ ДанныеДокументов
//	|ИЗ
//	|	Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий КАК ДанныеДокумента
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
//	|		ПО ДанныеДокумента.ДолжностьРуководителя = Должности.Ссылка
//	|ГДЕ
//	|	ДанныеДокумента.Ссылка = &Ссылка
//	|";
//	
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	Запрос.Выполнить();
//	
//	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
//		Запрос.МенеджерВременныхТаблиц, "ДанныеДокументов", "РеестрСоставил,ДатаПодачиЗаявления");
//		
//	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "ФИОПолные");
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ДанныеДокументов.ДатаПодачиЗаявления,
//	|	ДанныеДокументов.Организация,
//	|	ДанныеДокументов.РегистрационныйНомерФСС,
//	|	ДанныеДокументов.ДополнительныйКодФСС,
//	|	ДанныеДокументов.КодПодчиненностиФСС,
//	|	ДанныеДокументов.Руководитель,
//	|	ДанныеДокументов.ГлавныйБухгалтер,
//	|	ДанныеДокументов.РеестрСоставил,
//	|	ДанныеДокументов.ТелефонСоставителя,
//	|	ДанныеДокументов.АдресЭлектроннойПочтыСоставителя,
//	|	ДанныеДокументов.ДолжностьРуководителя,
//	|	ДанныеДокументов.ОГРНОрганизации,
//	|	ДанныеДокументов.Ссылка,
//	|	ДанныеДокументов.ИННОрганизации,
//	|	ДанныеДокументов.КППОрганизации,
//	|	ДанныеДокументов.ОрганизацияСокращенно,
//	|	ВТКадровыеДанныеФизическихЛиц.ФИОПолные КАК ФИОСоставителя
//	|ИЗ
//	|	ДанныеДокументов КАК ДанныеДокументов
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ВТКадровыеДанныеФизическихЛиц
//	|		ПО ДанныеДокументов.РеестрСоставил = ВТКадровыеДанныеФизическихЛиц.ФизическоеЛицо
//	|			И ДанныеДокументов.ДатаПодачиЗаявления = ВТКадровыеДанныеФизическихЛиц.Период";
//	
//	Возврат Запрос.Выполнить();	
//	
//КонецФункции 

//Функция СформироватьЗапросСведенийДляРасчетаПособия(ОписаниеРеестра)
//	
//	Запрос = Новый Запрос();
//	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	Запрос.УстановитьПараметр("Ссылка", ОписаниеРеестра.Ссылка);
//	Запрос.УстановитьПараметр("Дата", ОписаниеРеестра.Дата);

//	ТекстЗапроса = 
//	"ВЫБРАТЬ ПЕРВЫЕ 1
//	|	Пособия.Заявление.ПервыйРасчетныйГод КАК Год
//	|ИЗ
//	|	Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.СведенияНеобходимыеДляНазначенияПособий КАК Пособия
//	|ГДЕ
//	|	Пособия.Ссылка = &Ссылка
//	|	И Пособия.Заявление.ПервыйРасчетныйГод <> 0
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Год";
//	
//	Запрос.Текст = ТекстЗапроса;
//	МинимальныйГод = Запрос.Выполнить().Выгрузить();
//	Если МинимальныйГод.Количество() = 0 Тогда
//		ИзмеренияГоды = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Год(ТекущаяДатаСеанса()));
//	Иначе
//		ИзмеренияГоды = Новый Массив;
//		ТекущийГод = МинимальныйГод[0].Год;
//		Пока ТекущийГод <= Год(ТекущаяДатаСеанса()) Цикл
//			ИзмеренияГоды.Добавить(ТекущийГод);
//			ТекущийГод = ТекущийГод + 1;
//		КонецЦикла;
//	КонецЕсли;
//		
//	УчетПособийСоциальногоСтрахования.СоздатьВТПредельнаяВеличинаБазы(Запрос.МенеджерВременныхТаблиц, ИзмеренияГоды);
//	
//	ТекстЗапроса = 
//	"ВЫБРАТЬ
//	|	ЗаявлениеСотрудника.ФамилияПолучателя + "" "" + ЗаявлениеСотрудника.ИмяПолучателя + "" "" + ЗаявлениеСотрудника.ОтчествоПолучателя КАК ФИОСотрудника,
//	|	ЗаявлениеСотрудника.ДатаРожденияПолучателя КАК ДатаРождения,
//	|	ЕСТЬNULL(ЗаявлениеСотрудника.Гражданство.Код, """") КАК КодСтраны,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ТипЗанятостиРаботника = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК Совместительство,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.СпособВыплатыПособия = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыПособия.ПочтовымПереводом)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ПеречислятьПособиеПочтовымПереводом,
//	|	ЗаявлениеСотрудника.НаименованиеБанка,
//	|	ЗаявлениеСотрудника.Банк,
//	|	ЗаявлениеСотрудника.БИКБанка,
//	|	ЗаявлениеСотрудника.НомерЛицевогоСчета,
//	|	ЗаявлениеСотрудника.АдресПолучателяРегистрации КАК АдресРегистрации,
//	|	ЗаявлениеСотрудника.АдресПолучателяФактический КАК АдресПочтовый,
//	|	ЗаявлениеСотрудника.ФамилияПолучателя КАК Фамилия,
//	|	ЗаявлениеСотрудника.ИмяПолучателя КАК Имя,
//	|	ЗаявлениеСотрудника.ОтчествоПолучателя КАК Отчество,
//	|	ЗаявлениеСотрудника.СчитатьПоПравилам2010Года КАК СчитатьПоПравилам2010Года,
//	|	ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка КАК ПорядокРасчетаСреднегоЗаработка,
//	|	ЗаявлениеСотрудника.ДатаСправкиОПостановкеНаУчетВРанниеСрокиБеременности КАК ДатаСправкиБеременной,
//	|	ЗаявлениеСотрудника.НомерСправкиОПостановкеНаУчетВРанниеСрокиБеременности КАК НомерСправкиБеременной,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПособияНазначаемыеФСС.ПособиеВставшимНаУчетВРанниеСроки)
//	|				ИЛИ ЗаявлениеСотрудника.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодамВставшимНаУчетВРанниеСроки)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ПоставленаНаУчетВРанниеСрокиБеременности,
//	|	ЗаявлениеСотрудника.ПериодПростоя1ДатаНачала КАК ПериодПростояС,
//	|	ЗаявлениеСотрудника.ПериодПростоя1ДатаОкончания КАК ПериодПростояПо,
//	|	ЗаявлениеСотрудника.ПериодПростоя1СреднийЗаработок КАК СреднийЗаработокНаПериодПростоя,
//	|	ЕСТЬNULL(ЗаявлениеСотрудника.ВидДокументаУдостоверяющегоЛичностьПолучателя.КодМВД, ""01"") КАК ВидУдостоверенияЛичности,
//	|	ЗаявлениеСотрудника.СерияДокументаУдостоверяющегоЛичностьПолучателя КАК СерияДокумента,
//	|	ЗаявлениеСотрудника.НомерДокументаУдостоверяющегоЛичностьПолучателя КАК НомерДокумента,
//	|	ЗаявлениеСотрудника.ДатаВыдачиДокументаУдостоверяющегоЛичностьПолучателя КАК ДатаВыдачиДокумента,
//	|	ЗаявлениеСотрудника.КемВыданДокументУдостоверяющийЛичностьПолучателя КАК КемВыданДокумент,
//	|	ЗаявлениеСотрудника.СНИЛСПолучателя КАК СтраховойНомерПФР,
//	|	ЗаявлениеСотрудника.ИННПолучателя КАК ИНН,
//	|	ЗаявлениеСотрудника.НомерПриказаОПредоставленииОтпускаПоУходуЗаРебенком КАК НомерПриказаНаОтпускПоУходуЗаРебенком,
//	|	ЗаявлениеСотрудника.ДатаПриказаОПредоставленииОтпускаПоУходуЗаРебенком КАК ДатаПриказаНаОтпускПоУходуЗаРебенком,
//	|	ЗаявлениеСотрудника.ДатаНачалаОтпускаПоУходуЗаРебенком КАК ДатаНачала,
//	|	ЗаявлениеСотрудника.ДатаОкончанияОтпускаПоУходуЗаРебенком КАК ДатаОкончания,
//	|	ЗаявлениеСотрудника.РайонныйКоэффициент,
//	|	ЗаявлениеСотрудника.РазмерСтавки КАК ДоляВремени,
//	|	ЗаявлениеСотрудника.ПервыйРасчетныйГод КАК ПервыйГодРасчета,
//	|	ЗаявлениеСотрудника.ВторойРасчетныйГод КАК ВторойГодРасчета,
//	|	ЗаявлениеСотрудника.ЗамененыКалендарныеГодыРасчетаСреднегоЗаработка КАК ЗамененыКалендарныеГодыРасчетаСреднегоЗаработка,
//	|	ЗаявлениеСотрудника.ПервыйЗамененныйГод КАК ЗамененныйПервыйГодРасчета,
//	|	ЗаявлениеСотрудника.ВторойЗамененныйГод КАК ЗамененныйВторойГодРасчета,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ЗаработокПервыйГодРасчета > ПредельнаяВеличинаЗаПервыйГодРасчета.Размер
//	|			ТОГДА ПредельнаяВеличинаЗаПервыйГодРасчета.Размер
//	|		ИНАЧЕ ЗаявлениеСотрудника.ЗаработокПервыйГодРасчета
//	|	КОНЕЦ КАК ЗаработокПервыйГодРасчета,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ЗаработокВторойГодРасчета > ПредельнаяВеличинаЗаВторойГодРасчета.Размер
//	|			ТОГДА ПредельнаяВеличинаЗаВторойГодРасчета.Размер
//	|		ИНАЧЕ ЗаявлениеСотрудника.ЗаработокВторойГодРасчета
//	|	КОНЕЦ КАК ЗаработокВторойГодРасчета,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзТарифнойСтавки)
//	|				ИЛИ ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзМРОТ)
//	|			ТОГДА НАЧАЛОПЕРИОДА(Пособия.ОсвобождениеДатаНачала1, МЕСЯЦ)
//	|		ИНАЧЕ ЗаявлениеСотрудника.ДатаНачалаРасчетногоПериода
//	|	КОНЕЦ КАК ПериодРасчетаСреднегоЗаработкаНачало,
//	|	ВЫБОР
//	|		КОГДА (ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзТарифнойСтавки)
//	|				ИЛИ ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзМРОТ))
//	|				И Пособия.ОсвобождениеДатаНачала1 <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА КОНЕЦПЕРИОДА(Пособия.ОсвобождениеДатаНачала1, МЕСЯЦ)
//	|		ИНАЧЕ ЗаявлениеСотрудника.ДатаОкончанияРасчетногоПериода
//	|	КОНЕЦ КАК ПериодРасчетаСреднегоЗаработкаОкончание,
//	|	ВЫБОР
//	|		КОГДА (ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзТарифнойСтавки)
//	|				ИЛИ ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзМРОТ))
//	|				И Пособия.ОсвобождениеДатаНачала1 <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДЕНЬ(КОНЕЦПЕРИОДА(Пособия.ОсвобождениеДатаНачала1, МЕСЯЦ))
//	|		ИНАЧЕ ЗаявлениеСотрудника.ЧислоКалендарныхДнейРасчетногоПериода
//	|	КОНЕЦ КАК КалендарныхДнейРасчетногоПериода,
//	|	ЗаявлениеСотрудника.СреднийЗаработокЗаРасчетныйПериод КАК ЗаработокЗаПериодРасчета,
//	|	ЗаявлениеСотрудника.ДолжностнойОклад КАК ТарифнаяСтавкаОклад,
//	|	ЗаявлениеСотрудника.Дата КАК ДатаПредставленияПакетаДокументов,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодам)
//	|				ИЛИ ЗаявлениеСотрудника.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодамВставшимНаУчетВРанниеСроки)
//	|			ТОГДА ""2""
//	|		КОГДА ЗаявлениеСотрудника.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПособияНазначаемыеФСС.ПособиеВставшимНаУчетВРанниеСроки)
//	|			ТОГДА ""3""
//	|		КОГДА ЗаявлениеСотрудника.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПособияНазначаемыеФСС.ЕдиновременноеПособиеПриРожденииРебенка)
//	|			ТОГДА ""4""
//	|		КОГДА ЗаявлениеСотрудника.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПособияНазначаемыеФСС.ЕжемесячноеПособиеПоУходуЗаРебенком)
//	|			ТОГДА ""5""
//	|		ИНАЧЕ ""1""
//	|	КОНЕЦ КАК ВидВыплаты,
//	|	ЗаявлениеСотрудника.ВидПособия,
//	|	ЗаявлениеСотрудника.СреднийЗаработокЗаРасчетныйПериод КАК СреднийДневнойЗаработок,
//	|	ЗаявлениеСотрудника.МРОТ,
//	|	ЗаявлениеСотрудника.ДатаНачалаТрудовогоДоговораПолучателя КАК СрочныйДоговорС,
//	|	ЗаявлениеСотрудника.ДатаОкончанияТрудовогоДоговораПолучателя КАК СрочныйДоговорПо,
//	|	ЗаявлениеСотрудника.СтатусНалогоплательщикаПолучателя КАК СтатусНалогоплательщика,
//	|	ЗаявлениеСотрудника.ВидДокументаНаПроживание КАК НаименованиеДокументаНаПроживание,
//	|	ЗаявлениеСотрудника.СерияДокументаНаПроживание КАК СерияДокументаНаПроживание,
//	|	ЗаявлениеСотрудника.НомерДокументаНаПроживание КАК НомерДокументаНаПроживание,
//	|	ЗаявлениеСотрудника.ДатаВыдачиДокументаНаПроживание КАК ДатаВыдачиДокументаНаПроживание,
//	|	Пособия.НомерСтроки КАК НомерСтроки,
//	|	Пособия.ПриступитьКРаботеС КАК ДатаВыходаНаРаботу,
//	|	Пособия.ДатаРегистрацииДокументовМСЭ КАК ДатаРегистрацииДокументовМСЭ,
//	|	Пособия.ПериодНахожденияВСтационареСРебенкомС КАК ПериодНахожденияВСтационареСРебенкомС,
//	|	Пособия.ПериодНахожденияВСтационареСРебенкомПо КАК ПериодНахожденияВСтационареСРебенкомПо,
//	|	Пособия.ДатаИзмененияКодаПричиныНетрудоспособности КАК ДатаИзмененияКодаПричиныНетрудоспособности,
//	|	Пособия.КодПричиныНетрудоспособности КАК КодПричиныНетрудоспособности,
//	|	Пособия.ДополнительныйКодПричиныНетрудоспособности КАК ДополнительныйКодПричиныНетрудоспособности,
//	|	Пособия.ВторойКодПричиныНетрудоспособности КАК ВторойКодПричиныНетрудоспособности,
//	|	Пособия.УсловияИсчисленияКод1,
//	|	Пособия.УсловияИсчисленияКод2,
//	|	Пособия.УсловияИсчисленияКод3,
//	|	Пособия.НомерЛисткаНетрудоспособности КАК НомерВходящегоДокумента,
//	|	Пособия.ДатаВыдачиЛисткаНетрудоспособности КАК ДатаВыдачиБольничного,
//	|	Пособия.НомерПервичногоЛисткаНетрудоспособности КАК НомерПервичногоБольничного,
//	|	Пособия.КодНарушенияРежима КАК КодНарушенияРежима,
//	|	Пособия.ДатаНарушенияРежима,
//	|	Пособия.ДатаНовыйСтатусНетрудоспособного,
//	|	Пособия.НовыйСтатусНетрудоспособного,
//	|	Пособия.ДатаОсвидетельствованияМСЭ,
//	|	Пособия.ДатаНаправленияВБюроМСЭ,
//	|	Пособия.НомерЛисткаПродолжения,
//	|	Пособия.ОГРН_Санатория,
//	|	Пособия.НомерПутевки,
//	|	Пособия.ДатаОкончанияПутевки,
//	|	Пособия.НомерЛисткаПоОсновномуМестуРаботы,
//	|	Пособия.ОГРНМедицинскойОрганизации КАК ОГРН_ЛПУ,
//	|	Пособия.НаименованиеМедицинскойОрганизации КАК НаименованиеЛПУ,
//	|	Пособия.ПредоставленДубликатЛисткаНетрудоспособности КАК ЯвляетсяДубликатом,
//	|	Пособия.ПоУходуВозрастЛет1 КАК УходЗаРодственникомЛет1,
//	|	Пособия.ПоУходуВозрастМесяцев1 КАК УходЗаРодственникомМесяцев1,
//	|	Пособия.ПоУходуРодственнаяСвязь1 КАК УходЗаРодственникомРодственнаяСвязь1,
//	|	Пособия.ПоУходуФИО1 КАК УходЗаРодственникомФИО1,
//	|	Пособия.ПоУходуИспользованоДней1 КАК УходЗаРодственникомИспользованоДней1,
//	|	Пособия.ПоУходуВозрастЛет2 КАК УходЗаРодственникомЛет2,
//	|	Пособия.ПоУходуВозрастМесяцев2 КАК УходЗаРодственникомМесяцев2,
//	|	Пособия.ПоУходуРодственнаяСвязь2 КАК УходЗаРодственникомРодственнаяСвязь2,
//	|	Пособия.ПоУходуФИО2 КАК УходЗаРодственникомФИО2,
//	|	Пособия.ПоУходуИспользованоДней2 КАК УходЗаРодственникомИспользованоДней2,
//	|	Пособия.ОсвобождениеДатаНачала1 КАК ОсвобождениеС1,
//	|	Пособия.ОсвобождениеДатаОкончания1 КАК ОсвобождениеПо1,
//	|	Пособия.ОсвобождениеДолжностьВрача1 КАК ДолжностьВрача1,
//	|	Пособия.ОсвобождениеФИОВрача1 КАК ФИОВрача1,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрача1 КАК ИдентификационныйНомерВрача1,
//	|	Пособия.ОсвобождениеФИОВрачаПредседателяВК1 КАК ФИОВрачаПредседателяВК1,
//	|	Пособия.ОсвобождениеДолжностьВрачаПредседателяВК1 КАК ДолжностьВрачаПредседателяВК1,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрачаПредседателяВК1 КАК ИдентификационныйНомерВрачаПредседателяВК1,
//	|	Пособия.ОсвобождениеДатаНачала2 КАК ОсвобождениеС2,
//	|	Пособия.ОсвобождениеДатаОкончания2 КАК ОсвобождениеПо2,
//	|	Пособия.ОсвобождениеДолжностьВрача2 КАК ДолжностьВрача2,
//	|	Пособия.ОсвобождениеФИОВрача2 КАК ФИОВрача2,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрача2 КАК ИдентификационныйНомерВрача2,
//	|	Пособия.ОсвобождениеФИОВрачаПредседателяВК2 КАК ФИОВрачаПредседателяВК2,
//	|	Пособия.ОсвобождениеДолжностьВрачаПредседателяВК2 КАК ДолжностьВрачаПредседателяВК2,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрачаПредседателяВК2 КАК ИдентификационныйНомерВрачаПредседателяВК2,
//	|	Пособия.ОсвобождениеДатаНачала3 КАК ОсвобождениеС3,
//	|	Пособия.ОсвобождениеДатаОкончания3 КАК ОсвобождениеПо3,
//	|	Пособия.ОсвобождениеДолжностьВрача3 КАК ДолжностьВрача3,
//	|	Пособия.ОсвобождениеФИОВрача3 КАК ФИОВрача3,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрача3 КАК ИдентификационныйНомерВрача3,
//	|	Пособия.ОсвобождениеФИОВрачаПредседателяВК3 КАК ФИОВрачаПредседателяВК3,
//	|	Пособия.ОсвобождениеДолжностьВрачаПредседателяВК3 КАК ДолжностьВрачаПредседателяВК3,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрачаПредседателяВК3 КАК ИдентификационныйНомерВрачаПредседателяВК3,
//	|	Пособия.ГруппаИнвалидности,
//	|	ФизическиеЛица.Пол КАК Пол,
//	|	Пособия.ДатаНачалаОплаты КАК ДатаНачалаОплаты,
//	|	Пособия.ДатаОкончанияОплаты КАК ДатаОкончанияОплаты,
//	|	Пособия.СтажЛет КАК СтажЛет,
//	|	Пособия.СтажМесяцев КАК СтажМесяцев,
//	|	Пособия.СтажРасширенныйЛет КАК СтажРасширенныйЛет,
//	|	Пособия.СтажРасширенныйМесяцев КАК СтажРасширенныйМесяцев,
//	|	Пособия.ФинансированиеФедеральнымБюджетом КАК ВыплатаЗаСчетФедеральногоБюджета,
//	|	Пособия.ДатаАктаН1 КАК ДатаАктаФормыН1,
//	|	ЗаявлениеСотрудника.ДатаСправкиОНеполученииПособияОтОтца КАК ДатаСправкиОНеполученииПособияОтОтца,
//	|	ЗаявлениеСотрудника.НомерСправкиОНеполученииПособияОтОтца КАК НомерСправкиОНеполученииПособияОтОтца,
//	|	ЗаявлениеСотрудника.ДатаСправкиОНеполученииПособияОтМатери КАК ДатаСправкиОНеполученииПособияОтМатери,
//	|	ЗаявлениеСотрудника.НомерСправкиОНеполученииПособияОтМатери КАК НомерСправкиОНеполученииПособияОтМатери,
//	|	ЗаявлениеСотрудника.ВидОсобойЗоныПроживанияРаботы КАК СтатусЛьготнойЗоны,
//	|	ЗаявлениеСотрудника.ОтношениеКОсобойЗоне КАК ПроживаниеРаботаВЛьготнойЗоне,
//	|	ЗаявлениеСотрудника.ДатаСправкиОНеполученииПособияПоДругимМестамРаботы КАК ДатаСправкиПоДругимМестамРаботы,
//	|	ЗаявлениеСотрудника.НомерСправкиОНеполученииПособияПоДругимМестамРаботы КАК НомерСправкиПоДругимМестамРаботы,
//	|	ЗаявлениеСотрудника.НомерПриказаОЗаменеПослеродовогоОтпуска КАК НомерПриказаОЗаменеПослеродовогоОтпуска,
//	|	ЗаявлениеСотрудника.ДатаПриказаОЗаменеПослеродовогоОтпуска КАК ДатаПриказаОЗаменеПослеродовогоОтпуска,
//	|	ЗаявлениеСотрудника.ДатаРожденияРебенка КАК ДатаРожденияРебенка,
//	|	ЗаявлениеСотрудника.ФамилияРебенка КАК ФамилияРебенка,
//	|	ЗаявлениеСотрудника.ИмяРебенка КАК ИмяРебенка,
//	|	ЗаявлениеСотрудника.ОтчествоРебенка КАК ОтчествоРебенка,
//	|	ЗаявлениеСотрудника.ФормаСправкиОРожденииРебенка КАК ВидСправкиОРожденииРебенка,
//	|	ЗаявлениеСотрудника.ДатаСправкиОРожденииРебенка КАК ДатаСправки,
//	|	ЗаявлениеСотрудника.НомерСправкиОРожденииРебенка КАК НомерСправки,
//	|	ЗаявлениеСотрудника.ДатаРешенияОбОпеке КАК ДатаРешенияОбОпеке,
//	|	ЗаявлениеСотрудника.НомерРешенияОбОпеке КАК НомерРешенияОбОпеке,
//	|	ЗаявлениеСотрудника.ДатаРешенияОбУсыновлении КАК ДатаРешенияОбУсыновлении,
//	|	ЗаявлениеСотрудника.НомерРешенияОбУсыновлении КАК НомерРешенияОбУсыновлении,
//	|	ЗаявлениеСотрудника.ДатаДоговораОПередачеРебенкаВПриемнуюСемью КАК ДатаДоговораОПередачеНаВоспитание,
//	|	ЗаявлениеСотрудника.НомерДоговораОПередачеРебенкаВПриемнуюСемью КАК НомерДоговораОПередачеНаВоспитание,
//	|	ЗаявлениеСотрудника.ДатаСвидетельстваОРождении КАК ДатаСвидетельстваОРождении,
//	|	ЗаявлениеСотрудника.СерияСвидетельстваОРождении КАК СерияСвидетельстваОРождении,
//	|	ЗаявлениеСотрудника.НомерСвидетельстваОРождении КАК НомерСвидетельстваОРождении,
//	|	ЗаявлениеСотрудника.ДатаИногоДокументаПодтверждающегоРождение КАК ДатаИногоПодтвержденияРождения,
//	|	ЗаявлениеСотрудника.НомерИногоДокументаПодтверждающегоРождение КАК НомерИногоПодтвержденияРождения,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ДатаСправкиОРожденииРебенка <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.ДатаСправкиОРожденииРебенка
//	|		КОГДА ЗаявлениеСотрудника.ДатаСвидетельстваОРождении <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.ДатаСвидетельстваОРождении
//	|	КОНЕЦ КАК ДатаСправкиОРождении,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ДатаСправкиОРожденииРебенка <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.НомерСправкиОРожденииРебенка
//	|		КОГДА ЗаявлениеСотрудника.ДатаСвидетельстваОРождении <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.СерияСвидетельстваОРождении + "" "" + ЗаявлениеСотрудника.НомерСвидетельстваОРождении
//	|	КОНЕЦ КАК НомерСправкиОРождении,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбОпеке <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ""1""
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбУсыновлении <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ""2""
//	|		ИНАЧЕ """"
//	|	КОНЕЦ КАК УсыновлениеОпека,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбОпеке <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.ДатаРешенияОбОпеке
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбУсыновлении <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.ДатаРешенияОбУсыновлении
//	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
//	|	КОНЕЦ КАК УсыновлениеОпекаДатаВыдачи,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбОпеке <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.НомерРешенияОбОпеке
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбУсыновлении <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.НомерРешенияОбУсыновлении
//	|		ИНАЧЕ """"
//	|	КОНЕЦ КАК УсыновлениеОпекаСерияНомер,
//	|	Пособия.ВидПодтверждающегоДокумента КАК ДокументОРожденииВид,
//	|	ВЫБОР
//	|		КОГДА Пособия.ВидПодтверждающегоДокумента <> ЗНАЧЕНИЕ(Перечисление.ВидыПодтверждающихДокументовОтпускаПоУходу.РешениеОбУстановленииОпеки)
//	|			ТОГДА Пособия.ДатаДокумента
//	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
//	|	КОНЕЦ КАК ДокументОРожденииДатаВыдачи,
//	|	ВЫБОР
//	|		КОГДА Пособия.ВидПодтверждающегоДокумента <> ЗНАЧЕНИЕ(Перечисление.ВидыПодтверждающихДокументовОтпускаПоУходу.РешениеОбУстановленииОпеки)
//	|			ТОГДА Пособия.СерияДокумента + "" "" + Пособия.НомерДокумента
//	|		ИНАЧЕ """"
//	|	КОНЕЦ КАК ДокументОРожденииСерияНомер,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.СправкаОНеполученииПособия = ЗНАЧЕНИЕ(Перечисление.РодителиПредоставившиеСправкуОНеполученииПособия.Отец)
//	|			ТОГДА ЗаявлениеСотрудника.ДатаСправкиОНеполученииПособияОтОтца
//	|		ИНАЧЕ ЗаявлениеСотрудника.ДатаСправкиОНеполученииПособияОтМатери
//	|	КОНЕЦ КАК ДатаСправкиОтДругогоРодителя,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.СправкаОНеполученииПособия = ЗНАЧЕНИЕ(Перечисление.РодителиПредоставившиеСправкуОНеполученииПособия.Отец)
//	|			ТОГДА ЗаявлениеСотрудника.НомерСправкиОНеполученииПособияОтОтца
//	|		ИНАЧЕ ЗаявлениеСотрудника.НомерСправкиОНеполученииПособияОтМатери
//	|	КОНЕЦ КАК НомерСправкиОтДругогоРодителя,
//	|	ЗаявлениеСотрудника.НаличиеОдногоИзДокументовНаПредыдущихДетей КАК НаличиеДокументаОРождении,
//	|	ЗаявлениеСотрудника.НаличиеСвидетельстваОСмертиПредыдущихДетей КАК НаличиеДокументаОСмерти,
//	|	Пособия.ОчередностьРожденияРебенка КАК Очередность,
//	|	Пособия.НаличиеРешенияСудаОЛишенииПрав КАК НаличиеРешенияСудаОЛишенииПрав,
//	|	Пособия.ОдновременныйУходЗаНесколькимиДетьми КАК ОдновременныйУходЗаНесколькимиДетьми,
//	|	ЗаявлениеСотрудника.Перерасчет КАК Перерасчет,
//	|	ЗаявлениеСотрудника.КодПричиныПерерасчета КАК КодПричиныПерерасчета,
//	|	0 КАК СуммаПособияРаботодателя,
//	|	0 КАК СуммаПособияФСС,
//	|	0 КАК СуммаПособияВсего,
//	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаСмертиРебенка,
//	|	0 КАК ДнейБолезниИнвалида,
//	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачалаРаботы
//	|ИЗ
//	|	Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.СведенияНеобходимыеДляНазначенияПособий КАК Пособия
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявлениеСотрудникаНаВыплатуПособия КАК ЗаявлениеСотрудника
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
//	|			ПО ЗаявлениеСотрудника.ФизическоеЛицо = ФизическиеЛица.Ссылка
//	|		ПО (ЗаявлениеСотрудника.Ссылка = Пособия.Заявление)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличинаБазы КАК ПредельнаяВеличинаЗаПервыйГодРасчета
//	|		ПО (ВЫБОР
//	|				КОГДА Пособия.Заявление.ПервыйРасчетныйГод < 2010
//	|					ТОГДА 2010
//	|				ИНАЧЕ Пособия.Заявление.ПервыйРасчетныйГод
//	|			КОНЕЦ = ПредельнаяВеличинаЗаПервыйГодРасчета.Год)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличинаБазы КАК ПредельнаяВеличинаЗаВторойГодРасчета
//	|		ПО (ВЫБОР
//	|				КОГДА Пособия.Заявление.ВторойРасчетныйГод < 2010
//	|					ТОГДА 2010
//	|				ИНАЧЕ Пособия.Заявление.ВторойРасчетныйГод
//	|			КОНЕЦ = ПредельнаяВеличинаЗаВторойГодРасчета.Год)
//	|ГДЕ
//	|	Пособия.Ссылка = &Ссылка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ЗаявлениеСотрудника.ФамилияПолучателя + "" "" + ЗаявлениеСотрудника.ИмяПолучателя + "" "" + ЗаявлениеСотрудника.ОтчествоПолучателя,
//	|	ЗаявлениеСотрудника.ДатаРожденияПолучателя,
//	|	ЕСТЬNULL(ЗаявлениеСотрудника.Гражданство.Код, """"),
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ТипЗанятостиРаботника = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.СпособВыплатыПособия = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыПособия.ПочтовымПереводом)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ,
//	|	ЗаявлениеСотрудника.НаименованиеБанка,
//	|	ЗаявлениеСотрудника.Банк,
//	|	ЗаявлениеСотрудника.БИКБанка,
//	|	ЗаявлениеСотрудника.НомерЛицевогоСчета,
//	|	ЗаявлениеСотрудника.АдресПолучателяРегистрации,
//	|	ЗаявлениеСотрудника.АдресПолучателяФактический,
//	|	ЗаявлениеСотрудника.ФамилияПолучателя,
//	|	ЗаявлениеСотрудника.ИмяПолучателя,
//	|	ЗаявлениеСотрудника.ОтчествоПолучателя,
//	|	ЗаявлениеСотрудника.СчитатьПоПравилам2010Года,
//	|	ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка,
//	|	ЗаявлениеСотрудника.ДатаСправкиОПостановкеНаУчетВРанниеСрокиБеременности,
//	|	ЗаявлениеСотрудника.НомерСправкиОПостановкеНаУчетВРанниеСрокиБеременности,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПособияНазначаемыеФСС.ПособиеВставшимНаУчетВРанниеСроки)
//	|				ИЛИ ЗаявлениеСотрудника.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодамВставшимНаУчетВРанниеСроки)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ,
//	|	ЗаявлениеСотрудника.ПериодПростоя1ДатаНачала,
//	|	ЗаявлениеСотрудника.ПериодПростоя1ДатаОкончания,
//	|	ЗаявлениеСотрудника.ПериодПростоя1СреднийЗаработок,
//	|	ЕСТЬNULL(ЗаявлениеСотрудника.ВидДокументаУдостоверяющегоЛичностьПолучателя.КодМВД, ""01""),
//	|	ЗаявлениеСотрудника.СерияДокументаУдостоверяющегоЛичностьПолучателя,
//	|	ЗаявлениеСотрудника.НомерДокументаУдостоверяющегоЛичностьПолучателя,
//	|	ЗаявлениеСотрудника.ДатаВыдачиДокументаУдостоверяющегоЛичностьПолучателя,
//	|	ЗаявлениеСотрудника.КемВыданДокументУдостоверяющийЛичностьПолучателя,
//	|	ЗаявлениеСотрудника.СНИЛСПолучателя,
//	|	ЗаявлениеСотрудника.ИННПолучателя,
//	|	ЗаявлениеСотрудника.НомерПриказаОПредоставленииОтпускаПоУходуЗаРебенком,
//	|	ЗаявлениеСотрудника.ДатаПриказаОПредоставленииОтпускаПоУходуЗаРебенком,
//	|	ЗаявлениеСотрудника.ДатаНачалаОтпускаПоУходуЗаРебенком,
//	|	ЗаявлениеСотрудника.ДатаОкончанияОтпускаПоУходуЗаРебенком,
//	|	ЗаявлениеСотрудника.РайонныйКоэффициент,
//	|	ЗаявлениеСотрудника.РазмерСтавки,
//	|	ЗаявлениеСотрудника.ПервыйРасчетныйГод,
//	|	ЗаявлениеСотрудника.ВторойРасчетныйГод,
//	|	ЗаявлениеСотрудника.ЗамененыКалендарныеГодыРасчетаСреднегоЗаработка,
//	|	ЗаявлениеСотрудника.ПервыйЗамененныйГод,
//	|	ЗаявлениеСотрудника.ВторойЗамененныйГод,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ЗаработокПервыйГодРасчета > ПредельнаяВеличинаЗаПервыйГодРасчета.Размер
//	|			ТОГДА ПредельнаяВеличинаЗаПервыйГодРасчета.Размер
//	|		ИНАЧЕ ЗаявлениеСотрудника.ЗаработокПервыйГодРасчета
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ЗаработокВторойГодРасчета > ПредельнаяВеличинаЗаВторойГодРасчета.Размер
//	|			ТОГДА ПредельнаяВеличинаЗаВторойГодРасчета.Размер
//	|		ИНАЧЕ ЗаявлениеСотрудника.ЗаработокВторойГодРасчета
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзТарифнойСтавки)
//	|				ИЛИ ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзМРОТ)
//	|			ТОГДА НАЧАЛОПЕРИОДА(Пособия.ОсвобождениеДатаНачала1, МЕСЯЦ)
//	|		ИНАЧЕ ЗаявлениеСотрудника.ДатаНачалаРасчетногоПериода
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА (ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзТарифнойСтавки)
//	|				ИЛИ ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзМРОТ))
//	|				И Пособия.ОсвобождениеДатаНачала1 <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА КОНЕЦПЕРИОДА(Пособия.ОсвобождениеДатаНачала1, МЕСЯЦ)
//	|		ИНАЧЕ ЗаявлениеСотрудника.ДатаОкончанияРасчетногоПериода
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА (ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзТарифнойСтавки)
//	|				ИЛИ ЗаявлениеСотрудника.ПорядокРасчетаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСреднегоЗаработкаДляОплатыПособия.ИсходяИзМРОТ))
//	|				И Пособия.ОсвобождениеДатаНачала1 <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДЕНЬ(КОНЕЦПЕРИОДА(Пособия.ОсвобождениеДатаНачала1, МЕСЯЦ))
//	|		ИНАЧЕ ЗаявлениеСотрудника.ЧислоКалендарныхДнейРасчетногоПериода
//	|	КОНЕЦ,
//	|	ЗаявлениеСотрудника.СреднийЗаработокЗаРасчетныйПериод,
//	|	ЗаявлениеСотрудника.ДолжностнойОклад,
//	|	ЗаявлениеСотрудника.Дата,
//	|	""3"",
//	|	ЗаявлениеСотрудника.ВидПособия,
//	|	ЗаявлениеСотрудника.СреднийЗаработокЗаРасчетныйПериод,
//	|	ЗаявлениеСотрудника.МРОТ,
//	|	ЗаявлениеСотрудника.ДатаНачалаТрудовогоДоговораПолучателя,
//	|	ЗаявлениеСотрудника.ДатаОкончанияТрудовогоДоговораПолучателя,
//	|	ЗаявлениеСотрудника.СтатусНалогоплательщикаПолучателя,
//	|	ЗаявлениеСотрудника.ВидДокументаНаПроживание,
//	|	ЗаявлениеСотрудника.СерияДокументаНаПроживание,
//	|	ЗаявлениеСотрудника.НомерДокументаНаПроживание,
//	|	ЗаявлениеСотрудника.ДатаВыдачиДокументаНаПроживание,
//	|	Пособия.НомерСтроки,
//	|	Пособия.ПриступитьКРаботеС,
//	|	Пособия.ДатаРегистрацииДокументовМСЭ,
//	|	Пособия.ПериодНахожденияВСтационареСРебенкомС,
//	|	Пособия.ПериодНахожденияВСтационареСРебенкомПо,
//	|	Пособия.ДатаИзмененияКодаПричиныНетрудоспособности,
//	|	Пособия.КодПричиныНетрудоспособности,
//	|	Пособия.ДополнительныйКодПричиныНетрудоспособности,
//	|	Пособия.ВторойКодПричиныНетрудоспособности,
//	|	Пособия.УсловияИсчисленияКод1,
//	|	Пособия.УсловияИсчисленияКод2,
//	|	Пособия.УсловияИсчисленияКод3,
//	|	Пособия.НомерЛисткаНетрудоспособности,
//	|	Пособия.ДатаВыдачиЛисткаНетрудоспособности,
//	|	Пособия.НомерПервичногоЛисткаНетрудоспособности,
//	|	Пособия.КодНарушенияРежима,
//	|	Пособия.ДатаНарушенияРежима,
//	|	Пособия.ДатаНовыйСтатусНетрудоспособного,
//	|	Пособия.НовыйСтатусНетрудоспособного,
//	|	Пособия.ДатаОсвидетельствованияМСЭ,
//	|	Пособия.ДатаНаправленияВБюроМСЭ,
//	|	Пособия.НомерЛисткаПродолжения,
//	|	Пособия.ОГРН_Санатория,
//	|	Пособия.НомерПутевки,
//	|	Пособия.ДатаОкончанияПутевки,
//	|	Пособия.НомерЛисткаПоОсновномуМестуРаботы,
//	|	Пособия.ОГРНМедицинскойОрганизации,
//	|	Пособия.НаименованиеМедицинскойОрганизации,
//	|	Пособия.ПредоставленДубликатЛисткаНетрудоспособности,
//	|	Пособия.ПоУходуВозрастЛет1,
//	|	Пособия.ПоУходуВозрастМесяцев1,
//	|	Пособия.ПоУходуРодственнаяСвязь1,
//	|	Пособия.ПоУходуФИО1,
//	|	Пособия.ПоУходуИспользованоДней1,
//	|	Пособия.ПоУходуВозрастЛет2,
//	|	Пособия.ПоУходуВозрастМесяцев2,
//	|	Пособия.ПоУходуРодственнаяСвязь2,
//	|	Пособия.ПоУходуФИО2,
//	|	Пособия.ПоУходуИспользованоДней2,
//	|	Пособия.ОсвобождениеДатаНачала1,
//	|	Пособия.ОсвобождениеДатаОкончания1,
//	|	Пособия.ОсвобождениеДолжностьВрача1,
//	|	Пособия.ОсвобождениеФИОВрача1,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрача1,
//	|	Пособия.ОсвобождениеФИОВрачаПредседателяВК1,
//	|	Пособия.ОсвобождениеДолжностьВрачаПредседателяВК1,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрачаПредседателяВК1,
//	|	Пособия.ОсвобождениеДатаНачала2,
//	|	Пособия.ОсвобождениеДатаОкончания2,
//	|	Пособия.ОсвобождениеДолжностьВрача2,
//	|	Пособия.ОсвобождениеФИОВрача2,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрача2,
//	|	Пособия.ОсвобождениеФИОВрачаПредседателяВК2,
//	|	Пособия.ОсвобождениеДолжностьВрачаПредседателяВК2,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрачаПредседателяВК2,
//	|	Пособия.ОсвобождениеДатаНачала3,
//	|	Пособия.ОсвобождениеДатаОкончания3,
//	|	Пособия.ОсвобождениеДолжностьВрача3,
//	|	Пособия.ОсвобождениеФИОВрача3,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрача3,
//	|	Пособия.ОсвобождениеФИОВрачаПредседателяВК3,
//	|	Пособия.ОсвобождениеДолжностьВрачаПредседателяВК3,
//	|	Пособия.ОсвобождениеИдентификационныйНомерВрачаПредседателяВК3,
//	|	Пособия.ГруппаИнвалидности,
//	|	ФизическиеЛица.Пол,
//	|	Пособия.ДатаНачалаОплаты,
//	|	Пособия.ДатаОкончанияОплаты,
//	|	Пособия.СтажЛет,
//	|	Пособия.СтажМесяцев,
//	|	Пособия.СтажРасширенныйЛет,
//	|	Пособия.СтажРасширенныйМесяцев,
//	|	Пособия.ФинансированиеФедеральнымБюджетом,
//	|	Пособия.ДатаАктаН1,
//	|	ЗаявлениеСотрудника.ДатаСправкиОНеполученииПособияОтОтца,
//	|	ЗаявлениеСотрудника.НомерСправкиОНеполученииПособияОтОтца,
//	|	ЗаявлениеСотрудника.ДатаСправкиОНеполученииПособияОтМатери,
//	|	ЗаявлениеСотрудника.НомерСправкиОНеполученииПособияОтМатери,
//	|	ЗаявлениеСотрудника.ВидОсобойЗоныПроживанияРаботы,
//	|	ЗаявлениеСотрудника.ОтношениеКОсобойЗоне,
//	|	ЗаявлениеСотрудника.ДатаСправкиОНеполученииПособияПоДругимМестамРаботы,
//	|	ЗаявлениеСотрудника.НомерСправкиОНеполученииПособияПоДругимМестамРаботы,
//	|	ЗаявлениеСотрудника.НомерПриказаОЗаменеПослеродовогоОтпуска,
//	|	ЗаявлениеСотрудника.ДатаПриказаОЗаменеПослеродовогоОтпуска,
//	|	ЗаявлениеСотрудника.ДатаРожденияРебенка,
//	|	ЗаявлениеСотрудника.ФамилияРебенка,
//	|	ЗаявлениеСотрудника.ИмяРебенка,
//	|	ЗаявлениеСотрудника.ОтчествоРебенка,
//	|	ЗаявлениеСотрудника.ФормаСправкиОРожденииРебенка,
//	|	ЗаявлениеСотрудника.ДатаСправкиОРожденииРебенка,
//	|	ЗаявлениеСотрудника.НомерСправкиОРожденииРебенка,
//	|	ЗаявлениеСотрудника.ДатаРешенияОбОпеке,
//	|	ЗаявлениеСотрудника.НомерРешенияОбОпеке,
//	|	ЗаявлениеСотрудника.ДатаРешенияОбУсыновлении,
//	|	ЗаявлениеСотрудника.НомерРешенияОбУсыновлении,
//	|	ЗаявлениеСотрудника.ДатаДоговораОПередачеРебенкаВПриемнуюСемью,
//	|	ЗаявлениеСотрудника.НомерДоговораОПередачеРебенкаВПриемнуюСемью,
//	|	ЗаявлениеСотрудника.ДатаСвидетельстваОРождении,
//	|	ЗаявлениеСотрудника.СерияСвидетельстваОРождении,
//	|	ЗаявлениеСотрудника.НомерСвидетельстваОРождении,
//	|	ЗаявлениеСотрудника.ДатаИногоДокументаПодтверждающегоРождение,
//	|	ЗаявлениеСотрудника.НомерИногоДокументаПодтверждающегоРождение,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ДатаСправкиОРожденииРебенка <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.ДатаСправкиОРожденииРебенка
//	|		КОГДА ЗаявлениеСотрудника.ДатаСвидетельстваОРождении <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.ДатаСвидетельстваОРождении
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ДатаСправкиОРожденииРебенка <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.НомерСправкиОРожденииРебенка
//	|		КОГДА ЗаявлениеСотрудника.ДатаСвидетельстваОРождении <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.СерияСвидетельстваОРождении + "" "" + ЗаявлениеСотрудника.НомерСвидетельстваОРождении
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбОпеке <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ""1""
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбУсыновлении <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ""2""
//	|		ИНАЧЕ """"
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбОпеке <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.ДатаРешенияОбОпеке
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбУсыновлении <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.ДатаРешенияОбУсыновлении
//	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбОпеке <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.НомерРешенияОбОпеке
//	|		КОГДА ЗаявлениеСотрудника.ДатаРешенияОбУсыновлении <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ЗаявлениеСотрудника.НомерРешенияОбУсыновлении
//	|		ИНАЧЕ """"
//	|	КОНЕЦ,
//	|	Пособия.ВидПодтверждающегоДокумента,
//	|	ВЫБОР
//	|		КОГДА Пособия.ВидПодтверждающегоДокумента <> ЗНАЧЕНИЕ(Перечисление.ВидыПодтверждающихДокументовОтпускаПоУходу.РешениеОбУстановленииОпеки)
//	|			ТОГДА Пособия.ДатаДокумента
//	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА Пособия.ВидПодтверждающегоДокумента <> ЗНАЧЕНИЕ(Перечисление.ВидыПодтверждающихДокументовОтпускаПоУходу.РешениеОбУстановленииОпеки)
//	|			ТОГДА Пособия.СерияДокумента + "" "" + Пособия.НомерДокумента
//	|		ИНАЧЕ """"
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.СправкаОНеполученииПособия = ЗНАЧЕНИЕ(Перечисление.РодителиПредоставившиеСправкуОНеполученииПособия.Отец)
//	|			ТОГДА ЗаявлениеСотрудника.ДатаСправкиОНеполученииПособияОтОтца
//	|		ИНАЧЕ ЗаявлениеСотрудника.ДатаСправкиОНеполученииПособияОтМатери
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЗаявлениеСотрудника.СправкаОНеполученииПособия = ЗНАЧЕНИЕ(Перечисление.РодителиПредоставившиеСправкуОНеполученииПособия.Отец)
//	|			ТОГДА ЗаявлениеСотрудника.НомерСправкиОНеполученииПособияОтОтца
//	|		ИНАЧЕ ЗаявлениеСотрудника.НомерСправкиОНеполученииПособияОтМатери
//	|	КОНЕЦ,
//	|	ЗаявлениеСотрудника.НаличиеОдногоИзДокументовНаПредыдущихДетей,
//	|	ЗаявлениеСотрудника.НаличиеСвидетельстваОСмертиПредыдущихДетей,
//	|	Пособия.ОчередностьРожденияРебенка,
//	|	Пособия.НаличиеРешенияСудаОЛишенииПрав,
//	|	Пособия.ОдновременныйУходЗаНесколькимиДетьми,
//	|	ЗаявлениеСотрудника.Перерасчет,
//	|	ЗаявлениеСотрудника.КодПричиныПерерасчета,
//	|	0,
//	|	0,
//	|	0,
//	|	ДАТАВРЕМЯ(1, 1, 1),
//	|	0,
//	|	ДАТАВРЕМЯ(1, 1, 1)
//	|ИЗ
//	|	Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.СведенияНеобходимыеДляНазначенияПособий КАК Пособия
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявлениеСотрудникаНаВыплатуПособия КАК ЗаявлениеСотрудника
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
//	|			ПО ЗаявлениеСотрудника.ФизическоеЛицо = ФизическиеЛица.Ссылка
//	|		ПО (ЗаявлениеСотрудника.Ссылка = Пособия.Заявление)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличинаБазы КАК ПредельнаяВеличинаЗаПервыйГодРасчета
//	|		ПО (ВЫБОР
//	|				КОГДА Пособия.Заявление.ПервыйРасчетныйГод < 2010
//	|					ТОГДА 2010
//	|				ИНАЧЕ Пособия.Заявление.ПервыйРасчетныйГод
//	|			КОНЕЦ = ПредельнаяВеличинаЗаПервыйГодРасчета.Год)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличинаБазы КАК ПредельнаяВеличинаЗаВторойГодРасчета
//	|		ПО (ВЫБОР
//	|				КОГДА Пособия.Заявление.ВторойРасчетныйГод < 2010
//	|					ТОГДА 2010
//	|				ИНАЧЕ Пособия.Заявление.ВторойРасчетныйГод
//	|			КОНЕЦ = ПредельнаяВеличинаЗаВторойГодРасчета.Год)
//	|ГДЕ
//	|	Пособия.Ссылка = &Ссылка
//	|	И ЗаявлениеСотрудника.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодамВставшимНаУчетВРанниеСроки)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	НомерСтроки,
//	|	ВидВыплаты";
//	
//	Запрос.Текст = ТекстЗапроса;
//	
//	Возврат Запрос.Выполнить();
//	
//КонецФункции 

//Функция СреднийЗаработокЗаДваКалендарныхГода(СтруктураДанных, ПодменятьТолькоНулевойЗаработок = Ложь) 
//	
//	ЗаработокПервыйГодРасчета = СтруктураДанных.ЗаработокПервыйГодРасчета;
//	ЗаработокВторойГодРасчета = СтруктураДанных.ЗаработокВторойГодРасчета;
//	СреднийЗаработокИзМРОТ = СтруктураДанных.МРОТ * ?(СтруктураДанных.ДоляВремени > 0 И СтруктураДанных.ДоляВремени < 1, СтруктураДанных.ДоляВремени, 1);
//	
//	Если ЗаработокПервыйГодРасчета + ЗаработокВторойГодРасчета = 0 Тогда
//		СреднийЗаработок = СреднийЗаработокИзМРОТ;
//	Иначе
//		Разница = СтруктураДанных.СреднийДневнойЗаработок - (ЗаработокПервыйГодРасчета + ЗаработокВторойГодРасчета) / ?(СтруктураДанных.КалендарныхДнейРасчетногоПериода = 0, 730, СтруктураДанных.КалендарныхДнейРасчетногоПериода);
//		Если (Разница > -0.02 И Разница < 0.02) Или СтруктураДанных.СреднийДневнойЗаработок = 0 Или ПодменятьТолькоНулевойЗаработок Тогда
//			СреднийЗаработок = ЗаработокПервыйГодРасчета + ЗаработокВторойГодРасчета;
//		Иначе
//			СреднийЗаработок = СреднийЗаработокИзМРОТ;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат СреднийЗаработок
//	
//КонецФункции 

//// Функция оставляет в строке только цифры, отбрасывая все следующие за цифрами буквы и другие символы,
//// причем если строка начинается с буквы - то считаем, что.
////
//// Параметры:
////    РазбираемаяСтрока   - Строка - строка, из которой будут отбрасываться все не цифровые символы.
////    ПропускаемыеСимволы - Строка - символы, которые при разборе можно пропустить, на любых других разбор прекращается.
////                          Например, при разборе "К25СТР1", если пропускаемые символы:
////                          "" - то возвратится "0", 
////                          "К" - возвратится "25",
////                          "КСТР" - возвратится "251".
//// Возвращаемое значение:
////    Строка - строка, состоящая только из цифр, полученных из исходной строки.
////
//Функция ОставитьТолькоЦифрыВСтроке(РазбираемаяСтрока, ПропускаемыеСимволы = "")
//	
//	Цифры = "1234567890";
//	ЦифроваяЧасть = "";
//	Для НомерСимвола = 1 По СтрДлина(РазбираемаяСтрока) Цикл
//		ТекущийСимвол = Сред(РазбираемаяСтрока, НомерСимвола, 1);
//		Если СтрНайти(Цифры, ТекущийСимвол) Тогда
//			ЦифроваяЧасть = ЦифроваяЧасть + ТекущийСимвол;
//		Иначе
//			Если СтрНайти(ПропускаемыеСимволы, ТекущийСимвол) = Неопределено Тогда
//				Прервать;
//			Иначе
//				Продолжить;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	
//	// Если пустую строку попробовать преобразовать в число - то будет ошибка,
//	// поэтому в данном случае вместо пустой строки возвращаем строку с нулем.
//	Если ЦифроваяЧасть = "" Тогда
//		ЦифроваяЧасть = "0";
//	КонецЕсли;
//	
//	Возврат ЦифроваяЧасть;
//КонецФункции

//#КонецОбласти

//#Область МеханизмФиксацииИзменений

//Функция ПараметрыФиксацииВторичныхДанных() Экспорт
//	Возврат ФиксацияВторичныхДанныхВДокументах.ПараметрыФиксацииВторичныхДанных(ФиксацияОписаниеФиксацииРеквизитов(), , ФиксацияОписанияТЧ());
//КонецФункции

//Функция ФиксацияОписаниеФиксацииРеквизитов()
//	Возврат ПрямыеВыплатыПособийСоциальногоСтрахования.ОписаниеФиксацииРеквизитовРеестраСведенийНеобходимыхДляНазначенияИВыплатыПособий();
//КонецФункции

//Функция ФиксацияОписанияТЧ()
//	
//	МассивПолей = Новый Массив;
//	МассивПолей.Добавить("Заявление");
//	
//	СтруктураКлючевыхПолей = Новый Структура("СведенияНеобходимыеДляНазначенияПособий", МассивПолей);
//	
//	Возврат СтруктураКлючевыхПолей;
//	
//КонецФункции
//	
//#КонецОбласти

//Функция СтруктураДанныхЗаполнения() Экспорт
//	
//	СтруктураДанныхЗаполнения = Новый Структура;
//	
//	СтруктураДанныхЗаполнения.Вставить("Дата");
//	СтруктураДанныхЗаполнения.Вставить("Организация");
//	СтруктураДанныхЗаполнения.Вставить("ВидРеестра");
//	СтруктураДанныхЗаполнения.Вставить("СтатусДокумента", Перечисления.СтатусыЗаявленийИРеестровНаВыплатуПособий.ВРаботе);
//	
//	Возврат СтруктураДанныхЗаполнения; 	
//	
//КонецФункции

//#КонецОбласти

//#КонецЕсли

