
&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Пользователь = Параметры.Пользователь;
	Объект.Пароль = Параметры.Пароль;
	Объект.АдресБазы = Параметры.АдресБазы;
	Объект.ЗагружатьЗакрытыеОтмененныеВопросы = Параметры.ЗагружатьЗакрытыеОтмененныеВопросы;
	Объект.ОбновлятьАвтоматически = Параметры.ОбновлятьАвтоматически;
	Объект.ВремяОбновления = Параметры.ВремяОбновления;
	Объект.ОтображатьТекстВопросаСЗадержкой = Параметры.ОтображатьТекстВопросаСЗадержкой;
	Объект.ВремяОбновленияТекстаВопроса = Параметры.ВремяОбновленияТекстаВопроса;
	Объект.ТолькоМои = Параметры.ТолькоМои;
	Объект.ПоказатьПолностью = Параметры.ПоказатьПолностью;
	Объект.ОтображатьКонтакты = Параметры.ОтображатьКонтакты;
	Объект.ИспользоватьПомощник = Параметры.ИспользоватьПомощник;

	Элементы.ВремяОбновления.Доступность = Объект.ОбновлятьАвтоматически;
  
КонецПроцедуры

&НаКлиенте
// Процедура формирует структуру настроек
//
Процедура ОК(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("Пользователь", Объект.Пользователь);
	Структура.Вставить("Пароль", Объект.Пароль);
    Структура.Вставить("АдресБазы", Объект.АдресБазы);
	Структура.Вставить("ЗагружатьЗакрытыеОтмененныеВопросы", Объект.ЗагружатьЗакрытыеОтмененныеВопросы);
    Структура.Вставить("ВремяОбновления", Объект.ВремяОбновления);
    Структура.Вставить("ОбновлятьАвтоматически", Объект.ОбновлятьАвтоматически);
	Структура.Вставить("ОтображатьТекстВопросаСЗадержкой", Объект.ОтображатьТекстВопросаСЗадержкой);
    Структура.Вставить("ВремяОбновленияТекстаВопроса", Объект.ВремяОбновленияТекстаВопроса);
    Структура.Вставить("ТолькоМои", Объект.ТолькоМои);
	Структура.Вставить("ПоказатьПолностью", Объект.ПоказатьПолностью);
    Структура.Вставить("ОтображатьКонтакты", Объект.ОтображатьКонтакты);
	Структура.Вставить("ИспользоватьПомощник", Объект.ИспользоватьПомощник);
	
	Оповестить("НастройкиИзменены",Структура, ЭтаФорма);
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбновлятьАвтоматическиПриИзменении(Элемент)
	
	Элементы.ВремяОбновления.Доступность = Объект.ОбновлятьАвтоматически;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗакрыватьПриЗакрытииВладельца = Истина;
	
КонецПроцедуры
