
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НоменклатураПоставщика.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	НоменклатураПоставщика.Параметры.УстановитьЗначениеПараметра(
											"Номенклатура",
											Справочники.Номенклатура.ПустаяСсылка());
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	НоменклатураПоставщика.Параметры.УстановитьЗначениеПараметра("Номенклатура", Элемент.ТекущаяСтрока);
	
КонецПроцедуры


