
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СчетФактураСНастройкой") Тогда 
		Элементы.ВыводитьСкидку.Видимость = Ложь;
		Элементы.ПроцентСкидки.Видимость  = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ВыводитьSIRВСФ", ВыводитьSIRВСФ);
	ПараметрыПечати.Вставить("ВыводитьДанныеОСкважинеВСФ", ВыводитьДанныеОСкважинеВСФ);
	ПараметрыПечати.Вставить("ВыводитьЗаголовокСФ", ВыводитьЗаголовокСФ);
	ПараметрыПечати.Вставить("ВыводитьЗаказНарядВСФ", ВыводитьЗаказНарядВСФ);
	ПараметрыПечати.Вставить("ВыводитьРасчетныйСчетВСФ", ВыводитьРасчетныйСчетВСФ);
	ПараметрыПечати.Вставить("ВыводитьДанныеОДоговореВСФ", ВыводитьДанныеОДоговореВСФ);
	ПараметрыПечати.Вставить("ВыводитьНомерАкта", ВыводитьНомерАкта);
	ПараметрыПечати.Вставить("ВыводитьУЕ", ВыводитьУЕ);
	ПараметрыПечати.Вставить("ВыводитьСкидку", ВыводитьСкидку);
	ПараметрыПечати.Вставить("ПроцентСкидки", ПроцентСкидки);
	ПараметрыПечати.Вставить("ДоговорВШапке", ДоговорВШапке);
	ЭтаФорма.Закрыть(ПараметрыПечати);
	
КонецПроцедуры
