
&НаСервере
Процедура СформироватьДвиженияНаСервере()
	
	Если Объект.AU = Объект.AUСтарый Тогда
		Возврат;
	КонецЕсли;
	
	текДок = РеквизитФормыВЗначение("Объект");
	текДок.СформироватьЗаписиМестонахождениеОС();
	текДок.СформироватьДвиженияВзаиморасчетыСПокупателями();
	текДок.СформироватьДвиженияОборудование();
	текДок.СформироватьДвиженияОборудованиеАрендованное();
	текДок.СформироватьДвиженияОборудованиеЛокальное();
	текДок.СформироватьДвиженияОборудованиеЭкспорт();
	текДок.СформироватьДвиженияInventoryBatches();
	ЗначениеВРеквизитФормы(текДок, "Объект");
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДвижения(Команда)
	
	Если Объект.Движения.МестонахождениеОСБухгалтерскийУчет.Количество() <> 0 Или
		Объект.Движения.ВзаиморасчетыСПокупателями.Количество() <> 0 Или
		Объект.Движения.Оборудование.Количество() <> 0 Или
		Объект.Движения.ОборудованиеАрендованное.Количество() <> 0 Или
		Объект.Движения.ОборудованиеЛокальное.Количество() <> 0 Или
		Объект.Движения.ОборудованиеЭкспорт.Количество() <> 0 Или
		Объект.Движения.InventoryBatches.Количество() <> 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВопроса", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Перезаполнить движения документа? Документ будет записан!", РежимДиалогаВопрос.ДаНет, 0);
	Иначе
		СформироватьДвиженияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВопроса(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Движения.МестонахождениеОСБухгалтерскийУчет.Очистить();
		Объект.Движения.ВзаиморасчетыСПокупателями.Очистить();
		Объект.Движения.Оборудование.Очистить();
		Объект.Движения.ОборудованиеАрендованное.Очистить();
		Объект.Движения.ОборудованиеЛокальное.Очистить();
		Объект.Движения.ОборудованиеЭкспорт.Очистить();
		Объект.Движения.InventoryBatches.Очистить();
		Записать();
		СформироватьДвиженияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДвижения(Команда)
	
	Если Объект.Движения.МестонахождениеОСБухгалтерскийУчет.Количество() <> 0 Или
		Объект.Движения.ВзаиморасчетыСПокупателями.Количество() <> 0 Или
		Объект.Движения.Оборудование.Количество() <> 0 Или
		Объект.Движения.ОборудованиеАрендованное.Количество() <> 0 Или
		Объект.Движения.ОборудованиеЛокальное.Количество() <> 0 Или
		Объект.Движения.ОборудованиеЭкспорт.Количество() <> 0 Или
		Объект.Движения.InventoryBatches.Количество() <> 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьПослеЗакрытияВопроса", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Очистить движения документа? Документ будет записан!", РежимДиалогаВопрос.ДаНет, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПослеЗакрытияВопроса(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Движения.МестонахождениеОСБухгалтерскийУчет.Очистить();
		Объект.Движения.ВзаиморасчетыСПокупателями.Очистить();
		Объект.Движения.Оборудование.Очистить();
		Объект.Движения.ОборудованиеАрендованное.Очистить();
		Объект.Движения.ОборудованиеЛокальное.Очистить();
		Объект.Движения.ОборудованиеЭкспорт.Очистить();
		Объект.Движения.InventoryBatches.Очистить();
		Записать();
	КонецЕсли;
	
КонецПроцедуры

