
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Approval = ПолучитьСсылкуНаApproval(ПараметрКоманды);
	
	Если Approval = Неопределено Тогда
		
		Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS()  Тогда 
			Сообщить("Для поставки нет отправленных заявок на утверждение!");
		Иначе 
			Сообщить("There are no approvals for current trip!");
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ОбработкаКомандыCancelApprovalЗавершение", 
		LocalDistributionForNonLawsonКлиент, Новый Структура("Approval,Trip", Approval,ПараметрКоманды)),
		?(РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS(),
		"Отменить утверждение?",
		"Cancel approval?"), 
		РежимДиалогаВопрос.ДаНет,
		60,
		КодВозвратаДиалога.Нет,
		,
		КодВозвратаДиалога.Нет);
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаApproval(Trip)
	
	Возврат Задачи.TripsNonLawsonApproval.ПолучитьСсылкуНаApproval(Trip);	
	
КонецФункции

