
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТабЗнач") Тогда
		ТабЗнач = Параметры.ТабЗнач;
		ТабСоответствий.Загрузить(ТабЗнач);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	Для каждого Строка Из ТабСоответствий Цикл
		Если ЗначениеЗаполнено(Строка.AU) И НЕ ЗначениеЗаполнено(Строка.AU.TaxRegistration) И НЕ Строка.НалоговаяРегистрация.Пустая() Тогда
			AUОбъект = Строка.AU.ПолучитьОбъект();
			AUОбъект.TaxRegistration = Строка.НалоговаяРегистрация;
			Если AUОбъект.SubSegment <> AUОбъект.Сегмент.Родитель Тогда
			    AUОбъект.SubSegment = AUОбъект.Сегмент.Родитель;
			КонецЕсли; 
			AUОбъект.Записать();
		КонецЕсли; 		
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура AUПриИзменении(Элемент)
	ТекСтрока = Элементы.ТабСоответствий.ТекущиеДанные;
	Если НЕ ТекСтрока.AU.Пустая() Тогда
		ТекСтрока.НалоговаяРегистрация = ВернутьНалоговуюРегистрацию(ТекСтрока.AU);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ВернутьНалоговуюРегистрацию(AU)
	 Возврат AU.TaxRegistration;
КонецФункции // ВернутьНалоговуюРегистрацию()

&НаКлиенте
Процедура ТабСоответствийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекСтрока = Элементы.ТабСоответствий.ТекущиеДанные;
	Если НЕ ТекСтрока.AU.Пустая() Тогда
		ТекСтрока.НалоговаяРегистрация = ВернутьНалоговуюРегистрацию(ТекСтрока.AU);
	КонецЕсли; 
	// Вставить содержимое обработчика.
КонецПроцедуры

