
// Функция возвращает текст надписи "Цены и валюта".
//
Функция СформироватьНадписьЦеныИВалюта(СтруктураНадписи) Экспорт

	ТекстНадписи = "";
	ВалютаРегламентированногоУчета = SalesBookСервер.ПолучитьВалютуРегламентированногоУчета();

	// Валюта.
	Если СтруктураНадписи.Свойство("ВалютаДокумента") Тогда
		Если ЗначениеЗаполнено(СтруктураНадписи.ВалютаДокумента) Тогда
			Если (СтруктураНадписи.ВалютаДокумента <> ВалютаРегламентированногоУчета) Тогда
				ТекстНадписи = ВернутьСтр("ru = '%1 %2 = %3 %4'");
				ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ТекстНадписи,
					СтруктураНадписи.Кратность,
					СтруктураНадписи.ВалютаДокумента,
					СтруктураНадписи.Курс,
					ВалютаРегламентированногоУчета);
			ИначеЕсли НЕ СтруктураНадписи.Свойство("СуммаВключаетНДС") 
				И НЕ СтруктураНадписи.Свойство("ТипЦен") Тогда 
				ТекстНадписи = ВернутьСтр("ru = 'Валюта: <нет>'");
				ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ВернутьСтр("ru = 'Валюта: %1'"),
					ВалютаРегламентированногоУчета);
			КонецЕсли;
		ИначеЕсли СтруктураНадписи.ВалютаДокумента <> Неопределено Тогда // Передана пустая ссылка
			ТекстНадписи = ВернутьСтр("ru = 'Валюта: <нет>'");
		КонецЕсли;
	КонецЕсли;

	// Флаг сумма включает НДС.
	Если СтруктураНадписи.Свойство("СуммаВключаетНДС") Тогда
		Если ТипЗнч(СтруктураНадписи.СуммаВключаетНДС) = Тип("Булево") Тогда
			ТекстНадписи = ТекстНадписи + ?(ПустаяСтрока(ТекстНадписи), "", ", ")
				+ ?(СтруктураНадписи.СуммаВключаетНДС, ВернутьСтр("ru = 'Цена включает НДС'"), ВернутьСтр("ru = 'Цена не включает НДС'"));
		КонецЕсли;
	КонецЕсли;

	// Тип цен.
	Если СтруктураНадписи.Свойство("ТипЦен") Тогда
		Если ЗначениеЗаполнено(СтруктураНадписи.ТипЦен) Тогда
			ТекстНадписи = ТекстНадписи + ?(ПустаяСтрока(ТекстНадписи), "", ", ") + ВернутьСтр("ru = 'Тип цен: %1'");
			ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстНадписи, СтруктураНадписи.ТипЦен);
		ИначеЕсли ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ВернутьСтр("ru = 'Тип цен: <не указан>'");
		КонецЕсли;
	КонецЕсли;

	Возврат ТекстНадписи;

КонецФункции

Функция ДанныеНадписиОСчетеФактуреВыданном(ОснованиеСФ, ТребуетсяСФ, СтруктураОтбора = Неопределено) Экспорт
	
	СчетФактура = Неопределено;
	НадписьСФ   = ВернутьСтр("ru='Ввести счет-фактуру'");
	
	Если НЕ ТребуетсяСФ Тогда
		
		НадписьСФ = ВернутьСтр("ru='Не требуется'");
		
	ИначеЕсли ЗначениеЗаполнено(ОснованиеСФ) Тогда
		
		РеквизитыСФ = УчетНДСВызовСервера.РеквизитыДляНадписиОСчетеФактуреВыданном(ОснованиеСФ, СтруктураОтбора);
		
		Если РеквизитыСФ <> Неопределено Тогда
			СчетФактура = РеквизитыСФ.Ссылка;
			НадписьСФ = РеквизитыСФ.КраткоеПредставление;
			//Если РеквизитыСФ.Исправление Тогда
			//	НадписьСФ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			//		ВернутьСтр("ru='Исправление № %1 от %2 г. к сч/ф № %3 от %4 г. (%5)'"),
			//		?(ЗначениеЗаполнено(РеквизитыСФ.НомерИсправления), РеквизитыСФ.НомерИсправления, "..."),
			//		?(ЗначениеЗаполнено(РеквизитыСФ.ДатаИсправления),  Формат(РеквизитыСФ.ДатаИсправления, "ДЛФ=D"), "..."),
			//		?(ЗначениеЗаполнено(РеквизитыСФ.НомерСчетаФактуры), РеквизитыСФ.НомерСчетаФактуры, "..."),
			//		?(ЗначениеЗаполнено(РеквизитыСФ.ДатаСчетаФактуры),  Формат(РеквизитыСФ.ДатаСчетаФактуры, "ДЛФ=D"), "..."),
			//		РеквизитыСФ.Представление);
			//Иначе
			//	НадписьСФ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			//		ВернутьСтр("ru='№ %1 от %2 г. (%3)'"),
			//		?(ЗначениеЗаполнено(РеквизитыСФ.НомерСчетаФактуры), РеквизитыСФ.НомерСчетаФактуры, "..."),
			//		?(ЗначениеЗаполнено(РеквизитыСФ.ДатаСчетаФактуры),  Формат(РеквизитыСФ.ДатаСчетаФактуры, "ДЛФ=D"), "..."),
			//		РеквизитыСФ.Представление);
			//КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("СчетФактура,НадписьСчетФактура", СчетФактура, НадписьСФ); 

КонецФункции

Функция ДанныеНадписиОСчетеНаОплату(Основание, СтруктураОтбора = Неопределено) Экспорт
	
	СчетФактура = Неопределено;
	Надпись   = ВернутьСтр("ru='Ввести счет на оплату'");
	
	Если ЗначениеЗаполнено(Основание) Тогда
		
		СчетНаОплату = ОбщегоНазначения.НайтиПодчиненныйДокумент(Основание, "СчетНаОплатуПокупателю");
		Если СчетНаОплату <> Неопределено Тогда 
			Надпись = Строка(СчетНаОплату);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("СчетНаОплату,НадписьСчетНаОплату", СчетНаОплату, Надпись); 

КонецФункции


