
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	SystemПриИзменении(Элементы.System);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьВкладки()

	Элементы.PO.Видимость = Ложь;
	Элементы.GL.Видимость = Ложь;
	Элементы.IC.Видимость = Ложь;
	Элементы.AR.Видимость = Ложь;
	Элементы.AM.Видимость = Ложь;
	Элементы.RJ.Видимость = Ложь;
	Элементы.CB.Видимость = Ложь;
	Элементы.BL.Видимость = Ложь;
	Элементы.AP.Видимость = Ложь;
	
	ЭтоПроводкаAPAP = (Объект.System = "AP" И Объект.SourceCode = "AP");
	Элементы.ТипПроводки.Видимость = ЭтоПроводкаAPAP;
	Элементы.Ваучер.Видимость = ЭтоПроводкаAPAP;	

КонецПроцедуры 

&НаКлиенте
Процедура SystemПриИзменении(Элемент)

	СкрытьВкладки();
	
	Текст = ВРег(Элемент.ТекстРедактирования);	
	
	Если Текст = "PO" ИЛИ Текст = "GL" ИЛИ Текст = "IC" ИЛИ Текст = "AR" ИЛИ Текст = "AM" ИЛИ Текст = "RJ" 
		ИЛИ Текст = "CB" ИЛИ Текст = "BL" ИЛИ Текст = "AP"  Тогда
		
		Элементы[Текст].Видимость = Истина;	
		
	КонецЕсли;  	
	
	Если Текст = "MN" Тогда
	
		Элементы["AP"].Видимость = Истина;	
		Элементы.ApInvoiceAP.ТолькоПросмотр = Ложь;
		Элементы.AktOfAcceptance.ТолькоПросмотр = Ложь;
	
	КонецЕсли; 
	
КонецПроцедуры





 
