
Функция ПолучитьМассивUIDs(Account) Экспорт
	
	// Получает массив всех UIDs в регистре
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	UIDsOfProcessedEmails.UID
		|ИЗ
		|	РегистрСведений.UIDsOfProcessedEmails КАК UIDsOfProcessedEmails
		|ГДЕ
		|	UIDsOfProcessedEmails.Account = &Account";
	
	Запрос.УстановитьПараметр("Account", Account);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("UID");
	
КонецФункции

Процедура ДобавитьНесколько(МассивUIDs, Account) Экспорт
	
	// Добавляет несколько UIDs в регистр
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Account.Установить(Account);
	
	Для Каждого UID Из МассивUIDs Цикл
		
		НаборЗаписей.Очистить();
		Запись = НаборЗаписей.Добавить();
		Запись.Account = Account;
		Запись.UID = UID;
		НаборЗаписей.Отбор.UID.Установить(UID);
		НаборЗаписей.Записать();
			
	КонецЦикла;
	
КонецПроцедуры