Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда
		
		Если ОтнесениеРасходовКДеятельностиЕНВД.Пустая() Тогда
			Сообщить("Укажите вид отнесения расходов к деятельности, облагаемой ЕНВД!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если ОтнесениеРасходовКДеятельностиЕНВД = Перечисления.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКЕНВД Тогда
			ПринятиеКналоговомуУчету = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	
	Если Не ЭтоГруппа Тогда
		ПринятиеКналоговомуУчету = Истина;
		ОтнесениеРасходовКДеятельностиЕНВД = Перечисления.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКнеЕНВД;
	КонецЕсли;

КонецПроцедуры