
///////////////////////////////////////////////////////////////////////////////
// ФОРМА

// ПРИ СОЗДАНИИ НА СЕРВЕРЕ

// ДОДЕЛАТЬ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	UnallocatedSum = CustomsСервер.ПолучитьCustomsPaymentUnallocatedSum(Объект.Ссылка);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		CustomsPaymentsAllocations.Отбор,
		"CustomsPayment",
		ВидСравненияКомпоновкиДанных.Равно,
		?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено));
		
	// НАДО ЭТО КАК-ТО АВТОМАТИЗИРОВАТЬ. И В ДРУГИХ ОБЪЕКТАХ КОНФИГУРАЦИИ.	
	Если НЕ ЗначениеЗаполнено(Объект.Номер) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Номер;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Дата;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.TypeOfPayment) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.TypeOfPayment;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.BankAccount) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.BankAccount;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Customs) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Customs;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.CCDReference) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.CCDReference;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.CheckNo) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.CheckNo;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.PaymentKind) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.PaymentKind;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Sum) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Sum;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Description) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Description;
	Иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.CustomsPaymentsAllocations;
	КонецЕсли; 	
		
КонецПроцедуры

// ПЕРЕД ЗАПИСЬЮ НА СЕРВЕРЕ

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.LastModified = ТекущаяДата();
	ОбщегоНазначения.УстановитьЗначение(ТекущийОбъект.Responsible, ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

// ПОСЛЕ ЗАПИСИ НА СЕРВЕРЕ

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	UnallocatedSum = CustomsСервер.ПолучитьCustomsPaymentUnallocatedSum(Объект.Ссылка);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		CustomsPaymentsAllocations.Отбор,
		"CustomsPayment",
		Объект.Ссылка,
		ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

// ОБРАБОТКА ОПОВЕЩЕНИЯ

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененДокументCustomsPaymentAllocation"
		И Параметр.CustomsPayment = Объект.Ссылка Тогда
		UnallocatedSum = CustomsСервер.ПолучитьCustomsPaymentUnallocatedSum(Объект.Ссылка);
	КонецЕсли; 
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// РЕКВИЗИТЫ

&НаКлиенте
Процедура BankAccountНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.TypeOfPayment) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле ""Type of payment"" не заполнено!",
			, "TypeOfPayment", "Объект");
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// CUSTOMS PAYMENTS ALLOCATIONS

&НаКлиенте
Процедура CustomsPaymentsAllocationsПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Попытка
			Записать(Новый Структура);
		Исключение
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры
