
Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
		
	Запрос = Новый Запрос;
	Запрос.Текст  = "ВЫБРАТЬ
	                |	1
	                |ИЗ
	                |	Справочник.ВнешниеОбработки.Принадлежность КАК ЭтаФорма
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВнешниеОбработки.Принадлежность КАК ОстальныеФормы
	                |		ПО ЭтаФорма.СсылкаОбъекта = ОстальныеФормы.СсылкаОбъекта
					|		И ЭтаФорма.Ссылка.Наименование = ОстальныеФормы.Ссылка.Наименование 
					|		И ЭтаФорма.Ссылка <> ОстальныеФормы.Ссылка
					|		И НЕ ОстальныеФормы.Ссылка.ПометкаУдаления
	                |ГДЕ
	                |	ЭтаФорма.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Ответ = Вопрос("Для объектов, которым предназначена данная печатная форма, уже 
						|назначена другая форма с таким же именем. Рекомендуется изменить 
						|имя формы. Записать объект?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	#КонецЕсли

КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры
