&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Остатки.Параметры.УстановитьЗначениеПараметра("AU", Параметры.AU);
	Остатки.Параметры.УстановитьЗначениеПараметра("Factor", Параметры.UOM.ConversionFactor);
	Остатки.Параметры.УстановитьЗначениеПараметра("Период", Параметры.Период);
	Остатки.Параметры.УстановитьЗначениеПараметра("Location", Параметры.Location);
	Остатки.Параметры.УстановитьЗначениеПараметра("Good", Параметры.Good);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Элемент.ДанныеСтроки(ВыбраннаяСтрока));
	
КонецПроцедуры

