
//Процедура Инициализировать(Объект, ИмяТабличнойЧасти = Неопределено, ТабличноеПолеОбъекта = Неопределено) Экспорт
//	
//	
//	ТабЧастьТовары = Объект.Товары;
//	ТипыЦен = Объект.ТипыЦен;
//	
//	Если //ТабЧастьЦены.Количество() > 0  ИЛИ 
//		ТабЧастьТовары.Количество() > 0 Тогда
//		
//		ТекстВопроса = "Перед заполнением табличная часть будет очищена. Продолжить?";
//		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да,);
//		Если Ответ <> КодВозвратаДиалога.Да Тогда
//			Возврат;
//		КонецЕсли; 
//		
//		ТабЧастьТовары.Очистить();
//		//ТабЧастьЦены.Очистить();
//	КонецЕсли;
//	
//	//Открыть форму, произвести загрузку
//	ФормаЗагрузки = ПолучитьФорму("Форма");
//	Параметры = ФормаЗагрузки.ОткрытьМодально();
//	
//	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
//		ПутьКФайлу = Параметры.ПутьКФайлу;
//		Валюта = Параметры.Валюта;
//	Иначе
//		Сообщить("Не удалось расшифровать параметры");
//		Возврат;
//	КонецЕсли; 
//	
//	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда	
//		Сообщить("Не выбран файл загрузки!");
//		Возврат;	
//	КонецЕсли; 
//	
//	Если НЕ ЗначениеЗаполнено(Валюта) Тогда	
//		Сообщить("Не выбрана валюта!");
//		Возврат;	
//	КонецЕсли;
//	
//	ТаблицаЗначений = ОсновныеДействияФормыВыполнитьЗагрузку();
//	
//	//заполнить табличную часть
//	
//	//Добавлено РГ-Софт Зарецкая 06.09.2013
//	Если ТаблицаЗначений.Количество() > 0 Тогда
//		Для каждого Стр Из ТаблицаЗначений Цикл
//			НайденнаяНоменклатура = Справочники.Номенклатура.НайтиПоКоду(Стр.Код1С);
//			Если НайденнаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
//				Сообщить("Не удалось определить номенклатуру из строки "+(Стр.НомерСтроки+1)+" файла выгрузки (код1С: "+Стр.Код1С+")");
//			Иначе
//				Для каждого тЦен Из ТипыЦен Цикл
//					НоваяСтрока = ТабЧастьТовары.Добавить();
//					НоваяСтрока.Номенклатура = НайденнаяНоменклатура;
//					НоваяСтрока.ЕдиницаИзмерения = НайденнаяНоменклатура.ЕдиницаДляОтчетов;
//					НоваяСтрока.Валюта = Стр.Валюта;
//					НоваяСтрока.Цена = Стр.Цена;
//					НоваяСтрока.ТипЦен = тЦен.ТипЦен;
//				КонецЦикла; 
//			КонецЕсли; 
//		КонецЦикла; 
//		//ЗаполнитьТаблицуЦенФормы(ТипыЦен,ТабЧастьТовары,ТабЧастьЦены);
//		Объект.vkБылаЗагрузка = Истина;
//	КонецЕсли; 
//	
//КонецПроцедуры

Функция ОсновныеДействияФормыВыполнитьЗагрузку()
	//Загрузить из файла
	
	//Создать объект и открыть книгу
	Попытка
		Книга = Новый COMОбъект("Excel.Application");
	Исключение
		Сообщить(ОписаниеОшибки() + " Программа Exсel не установлена на данном компьютере!");
		Возврат Ложь;
	КонецПопытки;
	Попытка
		Книга.WorkBooks.Open(ПутьКФайлу); 
	Исключение
		Сообщить(ОписаниеОшибки() + " Не удалось открыть файл!");
		Возврат Ложь;
	КонецПопытки;
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	//сформировать таблицу
	ВыполнитьЗагрузку(Книга, ТаблицаЗначений);
	
	//Закрыть данные
	Книга.WorkBooks.Close();
	Книга.Quit(); 
	
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Процедура ВыполнитьЗагрузку(Книга, Таблица)
	//Выберем первый лист
	Лист1 = Книга.WorkSheets(1); 	
	
	//Создадим таблицу значений для загрузки таблицы
	//С определенными столбцами типа "Строка"
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(Тип("Строка"));
	КС = Новый КвалификаторыСтроки(500, ДопустимаяДлина.Переменная);
	ОписаниеТиповСтрока = Новый ОписаниеТипов (МассивТипов,,,КС);
	МассивТипов.Очистить();
	
	МассивТипов.Добавить(Тип("Число"));
	КЧ = Новый КвалификаторыЧисла(15,2);
	ОписаниеТиповЧисло = Новый ОписаниеТипов (МассивТипов);
	МассивТипов.Очистить();
	
	МассивТипов.Добавить(Тип("СправочникСсылка.Валюты"));
	ОписаниеТиповВалюта = Новый ОписаниеТипов (МассивТипов);
	МассивТипов.Очистить();
	
	
	Таблица.Колонки.Очистить();
	Таблица.Колонки.Добавить("НомерСтроки", ОписаниеТиповЧисло,"НомерСтроки");
	Таблица.Колонки.Добавить("Код1С",ОписаниеТиповСтрока,"Код1С");
	Таблица.Колонки.Добавить("Цена", ОписаниеТиповЧисло,"Цена");
	Таблица.Колонки.Добавить("Валюта", ОписаниеТиповВалюта,"Валюта");
	
	
	//Обход таблицы с записью
	ТекущаяСтрока = 2;
	Пока ЗначениеЗаполнено(Лист1.Cells(ТекущаяСтрока,1).Value) Цикл
		//Обработка табличной части документа
		НоваяСтрока = Таблица.Добавить();
		
		номНомер = Лист1.Cells(ТекущаяСтрока,1).Value;
		Если ТипЗнч(номНомер) = Тип("Число") Тогда
			номНомер = Формат(номНомер,"ЧГ=");
		КонецЕсли;
		НоваяСтрока.Код1С = номНомер;
		
		НоваяСтрока.Валюта = Валюта;
		НоваяСтрока.Цена = Лист1.Cells(ТекущаяСтрока,2).Value;
		НоваяСтрока.НомерСтроки = ТекущаяСтрока-1;
		ТекущаяСтрока = ТекущаяСтрока + 1;
	КонецЦикла;
	
	Таблица.Сортировать("НомерСтроки Возр");
КонецПроцедуры


