
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Specialist",
		ПараметрыСеанса.ТекущийПользователь,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Ложь,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"StageForFilter",
		,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Ложь,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Ссылка.ПометкаУдаления",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
	КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ПрочитанныеСвойства = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TransportRequest1.Ссылка,
	|	ЕСТЬNULL(StagesOfTransportRequests.Stage, ЗНАЧЕНИЕ(Перечисление.TransportRequestStages.ПустаяСсылка)) КАК Stage
	|ИЗ
	|	Документ.TransportRequest КАК TransportRequest1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.StagesOfTransportRequests КАК StagesOfTransportRequests
	|		ПО (TransportRequest1.Ссылка = StagesOfTransportRequests.TransportRequest)
	|ГДЕ
	|	TransportRequest1.Ссылка В(&Ссылки)";
	
	Запрос.УстановитьПараметр("Ссылки", Строки.ПолучитьКлючи());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//СтрокаСписка = Строки[ВыборкаДетальныеЗаписи.Ссылка];
		//СтрокаСписка.Данные.Stage = ВыборкаДетальныеЗаписи.Stage;
		Строки[ВыборкаДетальныеЗаписи.Ссылка].Данные.Stage = ВыборкаДетальныеЗаписи.Stage;
		
	КонецЦикла;
	
КонецПроцедуры
