
//Функция СтрРазделить(Знач Стр, Разделитель = ",", ВключатьПустые = Истина) Экспорт
//	
//	Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр, Разделитель, НЕ ВключатьПустые);
//	
//КонецФункции

//Функция СтрНайти(Строка, ПодстрокаПоиска) Экспорт
//	
//	Возврат Найти(Строка, ПодстрокаПоиска);
//	
//КонецФункции

//Функция СтрСоединить(МассивСтрок, Разделитель = "") Экспорт
//	
//	Возврат ОбщегоНазначения.ПолучитьСтрокуИзМассиваПодстрок(МассивСтрок, Разделитель);
//	
//КонецФункции