
&НаКлиенте
Процедура LoadUsers(Команда)
	
	LoadUsersНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура LoadUsersНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СведенияОПользователях.Пользователь КАК User,
	               |	СведенияОПользователях.ПоследнийИспользуемыйКлиент КАК Client1C,
	               |	СведенияОПользователях.ДатаПоследнейАктивности КАК LastActivityDate,
	               |	СведенияОПользователях.Пользователь.EMail КАК EMail,
	               |	СведенияОПользователях.Пользователь.ProcessLevel КАК ProcessLevel,
	               |	СведенияОПользователях.Пользователь.Код КАК Alias
	               |ИЗ
	               |	РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
	               |ГДЕ
	               |	ИСТИНА";
	
	Если ЗначениеЗаполнено(PeriodOfActivity) Тогда 
		
		Запрос.Текст = Запрос.Текст + "
		|	И СведенияОПользователях.ДатаПоследнейАктивности >= &МинДатаПоследнейАктивности
		|	И СведенияОПользователях.ДатаПоследнейАктивности <= &МаксДатаПоследнейАктивности";
		
		Запрос.УстановитьПараметр("МинДатаПоследнейАктивности", PeriodOfActivity.ДатаНачала);
		Запрос.УстановитьПараметр("МаксДатаПоследнейАктивности", PeriodOfActivity.ДатаОкончания);
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ProcessLevel) Тогда 
		
		Запрос.Текст = Запрос.Текст + "
		|	И СведенияОПользователях.Пользователь.ProcessLevel = &ProcessLevel";
		
		Запрос.УстановитьПараметр("ProcessLevel", ProcessLevel);
		
	КонецЕсли;

	ActiveUsers.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


&НаКлиенте
Процедура GenerateEmailsList(Команда)
	
	Emails = ПолучитьТекстовыйДокументWithSelectedEmails();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстовыйДокументWithSelectedEmails()
	
	SelectedEmails = "";
	
	Для Каждого СтрокаТаб из ActiveUsers Цикл
		
		Разделитель = ?(ПустаяСтрока(SelectedEmails), "", "; ");
		
		SelectedEmails = SelectedEmails + Разделитель + 
						 ?(ПустаяСтрока(СтрокаТаб.EMail), "", СтрокаТаб.EMail);
		
	КонецЦикла;
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.ДобавитьСтроку(SelectedEmails);
	
    Возврат ТекстДок;
	
КонецФункции
