
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ШаблонExcel(Команда)
	
	Адрес = ПолучитьАдрес();
	ИмяФайла = "BORGs combinations loading.xlsx";
	ПолучитьФайл(Адрес, ИмяФайла);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдрес()
	
	Возврат ПоместитьВоВременноеХранилище(РегистрыСведений.BORGSCombinations.ПолучитьМакет("ШаблонФайлаЗагрузки"));
	
КонецФункции

&НаКлиенте
Процедура LoadFromExcel(Команда)
	
	ТекстВопроса = "Вы действительно хотите загрузить данные из Excel?";
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		НастройкиДиалога = Новый Структура;
		НастройкиДиалога.Вставить("Фильтр", НСтр("ru = 'Файлы xlsx (*.xlsx)'") + "|*.xlsx" );
		
		Оповещение = Новый ОписаниеОповещения("LoadFile", ЭтаФорма);
		ОбменДаннымиКлиент.ВыбратьИПередатьФайлНаСервер(Оповещение, НастройкиДиалога, Новый УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура LoadFile(Знач РезультатПомещенияФайлов, Знач ДополнительныеПараметры) Экспорт
	
	АдресФайла = РезультатПомещенияФайлов.Хранение;
	РасширениеФайла = "xlsx";
	ЗагрузитьДанныеНаСервере(АдресФайла, РасширениеФайла, ДополнительныеПараметры);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьДанныеНаСервере(АдресФайла, РасширениеФайла, AP)
	
	РегистрыСведений.BORGSCombinations.ЗагрузитьДанные(АдресФайла, РасширениеФайла, AP);
	
КонецПроцедуры

#КонецОбласти