
//////////////////////////////////////////////////////////////////////
// ПРИ КОПИРОВАНИИ

Процедура ПриКопировании(ОбъектКопирования)
	
	РГСофт.ОчиститьCreationModification(ЭтотОбъект);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
	 
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизиты();

	ПроверитьЗаполнениеРеквизитов(Отказ);
	      	
КонецПроцедуры
     
///////////////////////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизиты()
	
	Если ЭтоНовый() Тогда
		РГСофт.ЗаполнитьCreation(ЭтотОбъект);
	КонецЕсли;

	Contractor = СокрЛП(Contractor);
	Location = СокрЛП(Location);
	Наименование = СокрЛП(Наименование);
				
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"'Agreement' is empty!",
		ЭтотОбъект, "Agreement", , Отказ);
		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Contractor) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"'Contractor' is empty!",
		ЭтотОбъект, "Contractor", , Отказ);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(LegalEntity) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"'Legal entity' is empty!",
		ЭтотОбъект, "LegalEntity", , Отказ);
		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Location) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"'Location' is empty!",
		ЭтотОбъект, "Location", , Отказ);
		
	КонецЕсли;

КонецПроцедуры