

Процедура ПередЗаписью(Отказ)
	
	Маршрут = Справочники.DistancesBetweenWarehouses.ПроверимМаршрут(SourceLocation, DestinationLocation, MOT);
	
	Если ЭтоНовый() И ЗначениеЗаполнено(Маршрут) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указанный маршрут уже имеется в каталоге");
		Отказ = Истина;
	ИначеЕсли Не ЭтоНовый() И ЗначениеЗаполнено(Маршрут) И Ссылка <> Маршрут Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указанный маршрут уже имеется в каталоге");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры




