
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//ТабДок = Новый ТабличныйДокумент;
	//Печать(ТабДок, ПараметрКоманды);

	//ТабДок.ОтображатьСетку = Ложь;
	//ТабДок.Защита = Ложь;
	//ТабДок.ТолькоПросмотр = Истина;
	//ТабДок.ОтображатьЗаголовки = Ложь;
	//ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//ТабДок.Показать();
	
	//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник) Тогда
	Если Не ПараметрыВыполненияКоманды.Источник.Модифицированность	Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.InventoryСписание",
			"АктПриемаПередачи",
			ПараметрКоманды,
			ПараметрыВыполненияКоманды,
			Неопределено);
		
	КонецЕсли;	
	//КонецЕсли;


КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
//	Документы.InventoryСписание.ПечатьАкта(ТабДок, ПараметрКоманды);
КонецПроцедуры