
Функция CheckAccessSettings(User, Password)
	
	
	Agents = Новый Массив;
	Agents.Добавить("DHL");
	Agents.Добавить("DGF");
	
	UserRef = Справочники.Пользователи.НайтиПоНаименованию(User, Истина);
	
	
	Если UserRef <> Справочники.Пользователи.ПустаяСсылка() И Agents.Найти(UserRef.CCA.Наименование) <> Неопределено Тогда
		
		UserDB = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(UserRef.ИдентификаторПользователяИБ);
		
		Если UserDB <> Неопределено Тогда
			
			
			
			Если НЕ UserDB.Роли.Содержит(Метаданные.Роли.БазовыеПрава) Тогда
				
				UserDB.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
				
			КонецЕсли;
			
			Если НЕ UserDB.Роли.Содержит(Метаданные.Роли.ImportExportBroker) Тогда
				
				UserDB.Роли.Добавить(Метаданные.Роли.ImportExportBroker);
				
			КонецЕсли;
			
			Если UserDB.АутентификацияОС Тогда
				
				UserDB.АутентификацияОС = Ложь;
				UserDB.ПользовательОС = Неопределено;
				
			КонецЕсли;
			
			Если НЕ UserDB.АутентификацияСтандартная Тогда
				
				UserDB.АутентификацияСтандартная = Истина;
				UserDB.ПоказыватьВСпискеВыбора = Ложь;
				
			КонецЕсли;
			
			Попытка
				
				UserDB.Записать();
				СтрокаРезультат = "Доступ успешно восстановлен!";
				
			Исключение
				СтрокаРезультат = "Ошибка восстановления доступа!";
			КонецПопытки;
			
		Иначе
			СтрокаРезультат = "Некорректно указаны данные пользователя: " + Строка(User) + "!";
		КонецЕсли;
		
	Иначе
		
		СтрокаРезультат = "Пользователь " + Строка(User) + " не найден!";
		
	КонецЕсли;
	
	Возврат СтрокаРезультат;
	
КонецФункции
