//Обновление рег. Отчетности на бух. Корп 3.0.36.18
//Добавленный модуль
//<=

////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контактная информация"
// 
////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устарело. Необходимо использовать УправлениеКонтактнойИнформацией.ПредыдущаяСтруктураКонтактнойИнформацииXML
//
Функция ПредыдущаяСтруктураКонтактнойИнформацииXML(Знач Данные, Знач ВидКонтактнойИнформации = Неопределено) Экспорт
	Возврат УправлениеКонтактнойИнформацией.ПредыдущаяСтруктураКонтактнойИнформацииXML(Данные, ВидКонтактнойИнформации);
КонецФункции   

#КонецОбласти
