
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает текст запроса для вычисления УСН
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   строка
//
Функция ТекстЗапросаУСН() Экспорт
	
    // УчетнаяПолитикаНалоговыйУчет
	// Таблица ВТУчетнаяПолитикаНалоговыйУчет - это список периодов, когда организация переходила на УСН
	// поля:
	//		УСН, 
	//		Месяц - месяц налогового периода
	// Описание:	
	//	Выбираем Из Периоды (таблица - список периодов с начала года по текущий период)
	//	Внутреннее соединение с "псевдосрезом" последних регистра УчетнаяПолитикаНалоговыйУчет
	//	по равенству периодов
	//  условие: что организация использует УСН
	
	Возврат 
	"ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаОрганизаций.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УСН
	|ПОМЕСТИТЬ ВТУчетнаяПолитикаНалоговыйУчет
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		МАКСИМУМ(УчетнаяПолитикаОрганизаций.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|			ПО Периоды.Период >= УчетнаяПолитикаОрганизаций.Период
	|				И (УчетнаяПолитикаОрганизаций.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаОрганизаций.Период
	|			И (УчетнаяПолитикаОрганизаций.Организация = &парамГоловнаяОрганизация)
	|			И (УчетнаяПолитикаОрганизаций.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная))";	
	
КонецФункции // ТекстПоляУСН()

Функция ТекстЗапросаУСНдляРасшифровки() Экспорт
	
	Возврат 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизаций.Организация
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|ГДЕ
	|	УчетнаяПолитикаОрганизаций.Организация = &Организация
	|	И (УчетнаяПолитикаОрганизаций.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная))
	|	И УчетнаяПолитикаОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.Организация
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&НачалоПериода, ) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|ГДЕ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.Организация = &Организация
	|	И УчетнаяПолитикаОрганизацийСрезПоследних.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)";
	
КонецФункции // ТекстПоляУСН()

Функция ИмяУчетнойПолитики() Экспорт

	Возврат "РегистрСведений.УчетнаяПолитикаОрганизаций"	

КонецФункции // ИмяУчетнойПолитики()

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ФОРМЫ 4-ФСС

// Возвращает текст запроса расчетов с фондом
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   строка
//
Функция ТекстРасчетовСФСС() Экспорт
	
	Возврат
	"ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	(ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС)
	|					ТОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) / &Делитель КАК ЧИСЛО(15, 1))) * &Делитель КАК НачисленоЗаМесяц,
	|	(ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС)
	|					ТОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) / &Делитель КАК ЧИСЛО(15, 1))) * &Делитель КАК РасходовЗаМесяц,
	|	(ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_НСиПЗ)
	|					ТОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) / &Делитель КАК ЧИСЛО(15, 1))) * &Делитель КАК РасходовНСиПЗ_ЗаМесяц,
	|	(ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_НСиПЗ)
	|					ТОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) / &Делитель КАК ЧИСЛО(15, 1))) * &Делитель КАК НачисленоНСиПЗ_ЗаМесяц
	|ПОМЕСТИТЬ ВТОтражениеЗарплатыВРеглУчетеНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтражениеЗарплатыВРеглУчете.ОтражениеВУчете КАК ОтражениеЗарплатыВРеглУчетеОтражениеВУчете
	|		ПО (ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.ПериодРегистрации МЕЖДУ &парамНачалоГода И КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ))
	|ГДЕ
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Организация = &парамОрганизация
	|	И ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Проведен
	|	И (ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_НСиПЗ))
	|			ИЛИ ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_НСиПЗ)))
	|
	|СГРУППИРОВАТЬ ПО
	|	МЕСЯЦ(Периоды.Период)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц";
	
КонецФункции // ТекстРасчетовСФСС()


// Возвращает текст запроса с изменением имени регистра учетной политики
//
Функция УстановитьНазваниеРегистраУчетнойПолитикиСтраховыхВзносов(ТекстЗапроса) Экспорт
	Возврат СтрЗаменить(ТекстЗапроса, "УчетнаяПолитикаНалоговыйУчет", "УчетнаяПолитикаОрганизаций");	
	
КонецФункции // УстановитьНазваниеРегистраУчетнойПолитикиСтраховыхВзносов()
////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ФОРМЫ 4а-ФСС

// Возвращает текст поля запроса для вычисления УСН
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   строка
//
Функция ТекстПоляУСН4аФСС() Экспорт

	Возврат "ЕСТЬNULL(ВЫБОР КОГДА УчетнаяПолитикаНалоговыйУчет.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ, ЛОЖЬ)"	

КонецФункции // ТекстПоляУСН()

// Возвращает текст дополнительных условий для отбора проводок
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   строка
//
Функция ТекстПроводок4аФСС() Экспорт

	Возврат 
	"ВЫБРАТЬ
	|	СУММА(ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма) КАК П000020002003,
	|	СУММА(ВЫБОР
	|			КОГДА (НЕ МЕСЯЦ(ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.ПериодРегистрации) В (&Месяц1, &Месяц2, &Месяц3))
	|				ТОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000020002101,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.ПериодРегистрации) = &Месяц1
	|				ТОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000020002301,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.ПериодРегистрации) = &Месяц2
	|				ТОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000020002401,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.ПериодРегистрации) = &Месяц3
	|				ТОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000020002501
	|ИЗ
	|	Документ.ОтражениеЗарплатыВРеглУчете.ОтражениеВУчете КАК ОтражениеЗарплатыВРеглУчетеОтражениеВУчете
	|ГДЕ
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.ПериодРегистрации МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|	И ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Организация = &парамОрганизация
	|	И ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_ДобровольныеВзносы)
	|	И ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Проведен";

КонецФункции // ТекстОтбораПроводок4аФСС()

                  

////////////////////////////////////////////////////////////////////////////////
// РАСШИФРОВКА ОТЧЕТОВ

#Если Клиент тогда
	
#КонецЕсли
