
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РГСофт.ЗаполнитьModification(ТекущийОбъект);
	
КонецПроцедуры

///////////////////////////////////////////////////////////

&НаКлиенте
Процедура MOTsВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Элементы.MOTs.ТекущиеДанные.MOT);	
	
КонецПроцедуры

&НаКлиенте
Процедура MOTsПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Имя", "ВыборИзEquipment");
	СтруктураНастройки.Вставить("МассивMOT", РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(Объект.MOTs, "MOT"));
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураНастройки", СтруктураНастройки);
	СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.MOTs.ФормаВыбора", СтруктураПараметров, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура MOTsОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив")
		И ВыбранноеЗначение.Количество() > 0
		И ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.MOTs") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Для ы = 0 По ВыбранноеЗначение.ВГраница() Цикл
			
			НоваяСтрока = Объект.MOTs.Добавить();
			НоваяСтрока.MOT = ВыбранноеЗначение[ы];
			
			Модифицированность = Истина;
			
		КонецЦикла;
			
	КонецЕсли;	
	
КонецПроцедуры



