
// { RGS ASeryakov 31.01.2018 16:36:35 - S-I-0004008
&НаКлиенте
Процедура TNVED_History(Команда)
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("PartNo",Объект.Ссылка);
	ДопПараметры.Вставить("Действие", "OpenHistory");
	
	TNVEDSLBName = ?(PR, "TNVEDSLB(PR):","TNVEDSLB: ");
	
	ДопПараметры.Вставить("Catalog", Объект.Ссылка);
	ДопПараметры.Вставить("TNVEDSLB", TNVEDSLB);
	ДопПараметры.Вставить("TNVEDSLBName", TNVEDSLBName);
	ДопПараметры.Вставить("Rate", TNVEDSLBRate);
	ДопПараметры.Вставить("PR", PR);
	
	ДопПараметры.Вставить("PartNoПредставление", "PartNo: " + СокрЛП(Объект.Код) + "; " + TNVEDSLBName + " " + СокрЛП(Строка(TNVEDSLB)) + "; " + "Rate: " + TNVEDSLBRate );
	
	Оповещение = Новый ОписаниеОповещения("OpenHistoryTNVEDЗавершение", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("ОбщаяФорма.TNVEDHistory", ДопПараметры , , СокрЛП(Объект.Код), , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура OpenHistoryTNVEDЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(Результат.Сообщение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.Сообщение);
		КонецЕсли;
		ЭтаФорма.Прочитать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеTNVED()
	
	ДанныеTNVED = РГСофтКлиентСервер.ПолучитьTNVEDWithMinimumRate(Объект.Ссылка, Объект.Код);
	
	Если ДанныеTNVED.Свойство("TNVED") Тогда
		
		MinTNVED = ДанныеTNVED.TNVED;
		MinTNVEDRate = Строка(ДанныеTNVED.TNVED.Rate);
		
		TNVEDSLB = MinTNVED;
		TNVEDSLBRate = MinTNVEDRate;
		PR = ДанныеTNVED.Priority;
		
	КонецЕсли;
	
	Если ДанныеTNVED.Свойство("LatestTNVED") Тогда
		
		TNVEDLatest = ДанныеTNVED.LatestTNVED;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьTNVEDSLB" Тогда
		
		Если Параметр.Добавление Тогда
			
			TNVEDSLB = Параметр.TNVEDSLB;
			TNVEDSLBRate = Параметр.TNVEDSLBRate;
			PR = Истина;
			
		Иначе
			TNVEDSLB = MinTNVED;
			TNVEDSLBRate = MinTNVEDRate;
			PR = Ложь;

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьДанныеTNVED();
	
	// { RGS VChaplygin 2018-10-26 - S-I-0006225
	Элементы.DescriptionRus.Видимость = Ложь;
	// { RGS VChaplygin 2018-10-26 - S-I-0006225
	
КонецПроцедуры

// } RGS ASeryakov 31.01.2018 16:36:35 - S-I-0004008
