
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьСинхронизацию = Константы.ИспользоватьСинхронизациюДанныхВЛокальномРежиме;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	Константы.ИспользоватьСинхронизациюДанныхВЛокальномРежиме.Установить(ИспользоватьСинхронизацию);
	Константы.ИспользоватьСинхронизациюДанных.Установить(ИспользоватьСинхронизацию);
	
	ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
		"СтандартныеПодсистемы.ОбменДанными\ПриВыгрузкеДанныхСлужебный");
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаУзловОбмена(Команда)
	ОткрытьФорму("ПланОбмена.rgsОбменКлиентамиЧерезУниверсальныйФормат.ФормаСписка");
КонецПроцедуры
