
Перем ДокументСсылка Экспорт;
Перем Контрагент Экспорт;
Перем РасшифровкаПлатежаДок Экспорт;
Перем ОтражатьВБухгалтерскомУчете Экспорт;
Перем ВидОперацииДок Экспорт;
Перем ДатаДок Экспорт;
Перем ТипЗадолженности Экспорт;
Перем ИмяРегистраПлан Экспорт;
Перем КурсДокумента Экспорт;
Перем КратностьДокумента Экспорт;
Перем ФормаОплаты Экспорт;
Перем ВалютаДокумента Экспорт;
Перем БанковскийСчетКасса Экспорт;
Перем Организация Экспорт;
Перем ДоговорКонтрагента Экспорт;
Перем Сделка Экспорт;
Перем Проект Экспорт;
Перем ВидОперацииПлан Экспорт;
Перем СтатьяДвиженияДенежныхСредств Экспорт;
Перем ВключенныеВПлатежныйКалендарь Экспорт;
Перем СчетНаПредоплату Экспорт;

#Если Клиент Тогда

// Отбирает неоплаченные задолженности по переданным контрагенту и типу задолженности
// и формирует таблицу для подбора.
//
Процедура СформироватьСписокДолгов() Экспорт
	
	Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ // Выбираем задолженности по договорам, ведущимся по расчетным документам или по заказам
	//|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//|	РасчетыСКонтрагентамиОстатки.Сделка КАК Сделка,
	//|	NULL КАК СчетНаПредоплату,
	//|	РасчетыСКонтрагентамиОстатки.Сделка.Дата КАК ДатаВозникновения,
	//|	ВЫБОР
	//|		КОГДА &Ограничивать
	//|			ТОГДА ВЫБОР
	//|					КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	//|						ТОГДА НомераИнвойсовLawson.Сумма
	//|					ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|				КОНЕЦ
	//|		ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|	КОНЕЦ КАК СуммаВзаиморасчетов,
	//|	КурсыДоговоры.Курс * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 КАК КурсВзаиморасчетов,
	//|	КурсыДоговоры.Кратность КАК КратностьВзаиморасчетов,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|			КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	//|				ТОГДА ВЫБОР
	//|						КОГДА &Ограничивать
	//|							ТОГДА ВЫБОР
	//|									КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	//|										ТОГДА НомераИнвойсовLawson.Сумма
	//|									ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|								КОНЕЦ
	//|						ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|					КОНЕЦ
	//|			КОГДА (НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента)
	//|					И (НЕ КурсыДоговоры.Курс = 0)
	//|					И (НЕ &КурсДокумента = 0)
	//|				ТОГДА ВЫБОР
	//|						КОГДА &Ограничивать
	//|							ТОГДА ВЫБОР
	//|									КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	//|										ТОГДА НомераИнвойсовLawson.Сумма
	//|									ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|								КОНЕЦ
	//|						ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|					КОНЕЦ * Выразить(ВЫБОР
	// |							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	// |								ТОГДА КурсыДоговоры.Курс
	// |							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	// |						КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15,4) )
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаПлатежа,
	//|	ЛОЖЬ КАК ДвиженияДокумента,
	//|	СчетНаОплатуПокупателю.Номер КАК НомерСчета,
	//|	СчетФактураВыданный.Номер КАК НомерСФ,
	//|	НомераИнвойсовLawson.Номер КАК НомерLawson
	//|	ИЗ
	//|	РегистрНакопления."+ИмяРегистраДолг+".Остатки(, ДоговорКонтрагента.Владелец=&Контрагент
	//|"+?(НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(Организация)," И (ДоговорКонтрагента.Организация=&Организация ИЛИ ДоговорКонтрагента.Организация=&ПустаяОрганизация)","")+"
	//|			И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)
	//|			И (ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоРасчетнымДокументам)) КАК РасчетыСКонтрагентамиОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	//|		ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыДоговоры.Валюта
	//|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	//|	ПО РасчетыСКонтрагентамиОстатки.Сделка = СчетФактураВыданный.ДокументОснование
	//|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	//|	ПО РасчетыСКонтрагентамиОстатки.Сделка = СчетНаОплатуПокупателю.ДокументОснование
	//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераИнвойсовLawson КАК НомераИнвойсовLawson
	//|	ПО РасчетыСКонтрагентамиОстатки.Сделка = НомераИнвойсовLawson.Документ
	//|
	//|	ГДЕ
	//|	(РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток "+ТипЗадолженности+")
	//|
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|
	//|	ВЫБРАТЬ // Выбираем задолженности по договорам, ведущимся по договору в целом
	//|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	//|	РасчетыСКонтрагентамиОстатки.Сделка,
	//|	NULL КАК СчетНаПредоплату,
	//|	ПоследнееДвижение.Период,
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток"+?(ТипЗадолженности="<0","*(-1)","")+",
	//|	КурсыДоговоры.Курс*(100+РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент)/100,
	//|	КурсыДоговоры.Кратность,
	//|	ВЫРАЗИТЬ 
	//|	(ВЫБОР 
	//|		КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов=&ВалютаДокумента
	//|			ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток"+?(ТипЗадолженности="<0","*(-1)","")+"
	//|		КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов=&ВалютаДокумента 
	//|			И НЕ КурсыДоговоры.Курс=0 
	//|			И НЕ &КурсДокумента=0
	//|			ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток"+?(ТипЗадолженности="<0","*(-1)","")+"*ВЫРАЗИТЬ(ВЫБОР
	// |							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	// |								ТОГДА КурсыДоговоры.Курс
	// |							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	// |						КОНЕЦ*(100+РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент)/100  * &КратностьДокумента 
	//|			/ (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15,4))
	//|		ИНАЧЕ
	//|			0
	//|		КОНЕЦ КАК ЧИСЛО (15,2)) КАК СуммаПлатежа,
	//|	ЛОЖЬ КАК ДвиженияДокумента,
	//|	NULL,
	//|	NULL,
	//|	NULL
	//|	ИЗ
	//|	РегистрНакопления."+ИмяРегистраДолг+".Остатки(, ДоговорКонтрагента.Владелец=&Контрагент 
	//|"+?(НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(Организация)," И (ДоговорКонтрагента.Организация=&Организация ИЛИ ДоговорКонтрагента.Организация=&ПустаяОрганизация)","")+"
	//|			И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)
	//|			И ДоговорКонтрагента.ВедениеВзаиморасчетов=&ПоДоговоруВЦелом) КАК РасчетыСКонтрагентамиОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	//|		ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыДоговоры.Валюта
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			МАКСИМУМ(РасчетыСКонтрагентами.Период) КАК Период,
	//|			РасчетыСКонтрагентами.ДоговорКонтрагента КАК ДоговорКонтрагента
	//|		ИЗ
	//|			РегистрНакопления.ВзаиморасчетыСПокупателями КАК РасчетыСКонтрагентами
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			РасчетыСКонтрагентами.ДоговорКонтрагента) КАК ПоследнееДвижение
	//|		ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента = ПоследнееДвижение.ДоговорКонтрагента
	//|	ГДЕ
	//|	(РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток "+ТипЗадолженности+")
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|
	//|	ВЫБРАТЬ // Выбираем задолженности по счетам на предоплату
	//|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	//|	NULL,
	//|	РасчетыСКонтрагентамиОстатки.СчетНаОплату КАК СчетНаПредоплату,
	//|	РасчетыСКонтрагентамиОстатки.СчетНаОплату.Дата КАК Период,
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток"+?(ТипЗадолженности="<0","*(-1)","")+",
	//|	КурсыДоговоры.Курс*(100+РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент)/100,
	//|	КурсыДоговоры.Кратность,
	//|	ВЫРАЗИТЬ 
	//|	(ВЫБОР 
	//|		КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов=&ВалютаДокумента
	//|			ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток"+?(ТипЗадолженности="<0","*(-1)","")+"
	//|		КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов=&ВалютаДокумента 
	//|			И НЕ КурсыДоговоры.Курс=0 
	//|			И НЕ &КурсДокумента=0
	//|			ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток"+?(ТипЗадолженности="<0","*(-1)","")+"*ВЫРАЗИТЬ(ВЫБОР
	// |							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	// |								ТОГДА КурсыДоговоры.Курс
	// |							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	// |						КОНЕЦ*(100+РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент)/100  * &КратностьДокумента 
	//|			/ (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15,4))
	//|		ИНАЧЕ
	//|			0
	//|		КОНЕЦ КАК ЧИСЛО (15,2)) КАК СуммаПлатежа,
	//|	ЛОЖЬ КАК ДвиженияДокумента,
	//|	РасчетыСКонтрагентамиОстатки.СчетНаОплату.Номер КАК НомерСчета,
	//|	NULL,
	//|	NULL
	//|	ИЗ
	//|	РегистрНакопления.СчетаНаПредоплату.Остатки(, ДоговорКонтрагента.Владелец=&Контрагент 
	//|"+?(НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(Организация)," И (ДоговорКонтрагента.Организация=&Организация ИЛИ ДоговорКонтрагента.Организация=&ПустаяОрганизация)","")+"
	//|			И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)) КАК РасчетыСКонтрагентамиОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	//|		ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыДоговоры.Валюта
	//|	ГДЕ
	//|	(РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток "+ТипЗадолженности+")
	//|";
	//
	//Если Не ОбщегоНазначения.ЗначениеНеЗаполнено(ДокументСсылка) Тогда
	//
	//	Запрос.Текст = Запрос.Текст+"
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|	ВЫБРАТЬ
	//	|	ТЧДокументаПлатежа.ДоговорКонтрагента,
	//	|	ТЧДокументаПлатежа.Сделка,
	//	|	NULL КАК СчетНаПредоплату,
	//	|	ТЧДокументаПлатежа.Ссылка.Дата,
	//	|	ТЧДокументаПлатежа.СуммаВзаиморасчетов,
	//	|	ТЧДокументаПлатежа.КурсВзаиморасчетов,
	//	|	ТЧДокументаПлатежа.КратностьВзаиморасчетов,
	//	|	ТЧДокументаПлатежа.СуммаПлатежа,
	//	|	ИСТИНА КАК ДвиженияДокумента,
	//	|	ТЧДокументаПлатежа.НомерСчета,
	//	|	NULL,
	//	|	ТЧДокументаПлатежа.НомерLawson
	//	|	ИЗ
	//	|	ДОКУМЕНТ."+ДокументСсылка.Метаданные().Имя+".РасшифровкаПлатежа КАК ТЧДокументаПлатежа
	//	|	ГДЕ
	//	|		ТЧДокументаПлатежа.Ссылка = &Регистратор И
	//	|		ТЧДокументаПлатежа.Ссылка.Проведен";
	//	
	//КонецЕсли;
	
	
	
	
	// начало изменения, RG-Soft, Карасев В.В., 11.04.2016
	// в запрос добавлен учет галки "ОплатаПоКурсуММВБ" в договоре
	
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//|	РасчетыСКонтрагентамиОстатки.Сделка КАК Сделка,
	//|	NULL КАК СчетНаПредоплату,
	//|	РасчетыСКонтрагентамиОстатки.Сделка.Дата КАК ДатаВозникновения,
	//|	ВЫБОР
	//|		КОГДА &Ограничивать
	//|			ТОГДА ВЫБОР
	//|					КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	//|						ТОГДА НомераИнвойсовLawson.Сумма
	//|					ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|				КОНЕЦ
	//|		ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|	КОНЕЦ КАК СуммаВзаиморасчетов,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс > 0
	//|			ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	//|		ИНАЧЕ КурсыДоговоры.Курс
	//|	КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 КАК КурсВзаиморасчетов,
	//|	КурсыДоговоры.Кратность КАК КратностьВзаиморасчетов,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|			КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	//|				ТОГДА ВЫБОР
	//|						КОГДА &Ограничивать
	//|							ТОГДА ВЫБОР
	//|									КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	//|										ТОГДА НомераИнвойсовLawson.Сумма
	//|									ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|								КОНЕЦ
	//|						ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|					КОНЕЦ
	//|			КОГДА (НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента)
	//|					И (НЕ КурсыДоговоры.Курс = 0)
	//|					И (НЕ &КурсДокумента = 0)
	//|				ТОГДА ВЫБОР
	//|						КОГДА &Ограничивать
	//|							ТОГДА ВЫБОР
	//|									КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	//|										ТОГДА НомераИнвойсовLawson.Сумма
	//|									ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|								КОНЕЦ
	//|						ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|					КОНЕЦ * (ВЫРАЗИТЬ(ВЫБОР
	// |							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	// |								ТОГДА КурсыДоговоры.Курс
	// |							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	// |						КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15, 4)))
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаПлатежа,
	//|	ЛОЖЬ КАК ДвиженияДокумента,
	//|	СчетНаОплатуПокупателю.Номер КАК НомерСчета,
	//|	СчетФактураВыданный.Номер КАК НомерСФ,
	//|	НомераИнвойсовLawson.Номер КАК НомерLawson
	//|ИЗ
	//|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	//|			,
	//|			ДоговорКонтрагента.Владелец = &Контрагент
	//|				И (ДоговорКонтрагента.Организация = &Организация
	//|					ИЛИ ДоговорКонтрагента.Организация = &ПустаяОрганизация)
	//|				И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)
	//|				И ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоРасчетнымДокументам) КАК РасчетыСКонтрагентамиОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	//|		ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыДоговоры.Валюта
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	//|		ПО РасчетыСКонтрагентамиОстатки.Сделка = СчетФактураВыданный.ДокументОснование
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	//|		ПО РасчетыСКонтрагентамиОстатки.Сделка = СчетНаОплатуПокупателю.ДокументОснование
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераИнвойсовLawson КАК НомераИнвойсовLawson
	//|		ПО РасчетыСКонтрагентамиОстатки.Сделка = НомераИнвойсовLawson.Документ
	//|ГДЕ
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	//|	РасчетыСКонтрагентамиОстатки.Сделка,
	//|	NULL,
	//|	ПоследнееДвижение.Период,
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс > 0
	//|			ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	//|		ИНАЧЕ КурсыДоговоры.Курс
	//|	КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100,
	//|	КурсыДоговоры.Кратность,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|			КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	//|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|			КОГДА (НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента)
	//|					И (НЕ КурсыДоговоры.Курс = 0)
	//|					И (НЕ &КурсДокумента = 0)
	//|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * (ВЫРАЗИТЬ(ВЫБОР
	// |							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	// |								ТОГДА КурсыДоговоры.Курс
	// |							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	// |						КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15, 4)))
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК ЧИСЛО(15, 2)),
	//|	ЛОЖЬ,
	//|	NULL,
	//|	NULL,
	//|	NULL
	//|ИЗ
	//|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	//|			,
	//|			ДоговорКонтрагента.Владелец = &Контрагент
	//|				И (ДоговорКонтрагента.Организация = &Организация
	//|					ИЛИ ДоговорКонтрагента.Организация = &ПустаяОрганизация)
	//|				И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)
	//|				И ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоДоговоруВЦелом) КАК РасчетыСКонтрагентамиОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	//|		ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыДоговоры.Валюта
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			МАКСИМУМ(РасчетыСКонтрагентами.Период) КАК Период,
	//|			РасчетыСКонтрагентами.ДоговорКонтрагента КАК ДоговорКонтрагента
	//|		ИЗ
	//|			РегистрНакопления.ВзаиморасчетыСПокупателями КАК РасчетыСКонтрагентами
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			РасчетыСКонтрагентами.ДоговорКонтрагента) КАК ПоследнееДвижение
	//|		ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента = ПоследнееДвижение.ДоговорКонтрагента
	//|ГДЕ
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	//|	NULL,
	//|	РасчетыСКонтрагентамиОстатки.СчетНаОплату,
	//|	РасчетыСКонтрагентамиОстатки.СчетНаОплату.Дата,
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс > 0
	//|			ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	//|		ИНАЧЕ КурсыДоговоры.Курс
	//|	КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100,
	//|	КурсыДоговоры.Кратность,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|			КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	//|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|			КОГДА (НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента)
	//|					И (НЕ КурсыДоговоры.Курс = 0)
	//|					И (НЕ &КурсДокумента = 0)
	//|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * (ВЫРАЗИТЬ(ВЫБОР
	// |							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	// |								ТОГДА КурсыДоговоры.Курс
	// |							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	// |						КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15, 4)))
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК ЧИСЛО(15, 2)),
	//|	ЛОЖЬ,
	//|	РасчетыСКонтрагентамиОстатки.СчетНаОплату.Номер,
	//|	NULL,
	//|	NULL
	//|ИЗ
	//|	РегистрНакопления.СчетаНаПредоплату.Остатки(
	//|			,
	//|			ДоговорКонтрагента.Владелец = &Контрагент
	//|				И (ДоговорКонтрагента.Организация = &Организация
	//|					ИЛИ ДоговорКонтрагента.Организация = &ПустаяОрганизация)
	//|				И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)) КАК РасчетыСКонтрагентамиОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	//|		ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыДоговоры.Валюта
	//|ГДЕ
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ТЧДокументаПлатежа.ДоговорКонтрагента,
	//|	ТЧДокументаПлатежа.Сделка,
	//|	NULL,
	//|	ТЧДокументаПлатежа.Ссылка.Дата,
	//|	ТЧДокументаПлатежа.СуммаВзаиморасчетов,
	//|	ТЧДокументаПлатежа.КурсВзаиморасчетов,
	//|	ТЧДокументаПлатежа.КратностьВзаиморасчетов,
	//|	ТЧДокументаПлатежа.СуммаПлатежа,
	//|	ИСТИНА,
	//|	ТЧДокументаПлатежа.НомерСчета,
	//|	NULL,
	//|	ТЧДокументаПлатежа.НомерLawson
	//|ИЗ
	//|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ТЧДокументаПлатежа
	//|ГДЕ
	//|	ТЧДокументаПлатежа.Ссылка = &Регистратор
	//|	И ТЧДокументаПлатежа.Ссылка.Проведен";
	
	//	Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//|	РасчетыСКонтрагентамиОстатки.Сделка КАК Сделка,
	//|	NULL КАК СчетНаПредоплату,
	//|	РасчетыСКонтрагентамиОстатки.Сделка.Дата КАК ДатаВозникновения,
	//|	ВЫБОР
	//|		КОГДА &Ограничивать
	//|			ТОГДА ВЫБОР
	//|					КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	//|						ТОГДА НомераИнвойсовLawson.Сумма
	//|					ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|				КОНЕЦ
	//|		ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|	КОНЕЦ КАК СуммаВзаиморасчетов,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс > 0
	//|			ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	//|		ИНАЧЕ КурсыДоговоры.Курс
	//|	КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 КАК КурсВзаиморасчетов,
	//|	КурсыДоговоры.Кратность КАК КратностьВзаиморасчетов,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|			КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	//|				ТОГДА ВЫБОР
	//|						КОГДА &Ограничивать
	//|							ТОГДА ВЫБОР
	//|									КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	//|										ТОГДА НомераИнвойсовLawson.Сумма
	//|									ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|								КОНЕЦ
	//|						ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|					КОНЕЦ
	//|			КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	//|					И НЕ КурсыДоговоры.Курс = 0
	//|					И НЕ &КурсДокумента = 0
	//|				ТОГДА ВЫБОР
	//|						КОГДА &Ограничивать
	//|							ТОГДА ВЫБОР
	//|									КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	//|										ТОГДА НомераИнвойсовLawson.Сумма
	//|									ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|								КОНЕЦ
	//|						ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|					КОНЕЦ * (ВЫРАЗИТЬ(ВЫБОР
	//|							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	//|								ТОГДА КурсыДоговоры.Курс
	//|							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	//|						КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15, 4)))
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаПлатежа,
	//|	ЛОЖЬ КАК ДвиженияДокумента,
	//|	СчетНаОплатуПокупателю.Номер КАК НомерСчета,
	//|	СчетФактураВыданный.Номер КАК НомерСФ,
	//|	НомераИнвойсовLawson.Номер КАК НомерLawson
	//|ИЗ
	//|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	//|			&МоментВремени,
	//|			ДоговорКонтрагента.Владелец = &Контрагент
	//|				И (ДоговорКонтрагента.Организация = &Организация
	//|					ИЛИ ДоговорКонтрагента.Организация = &ПустаяОрганизация)
	//|				И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)
	//|				И ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоРасчетнымДокументам) КАК РасчетыСКонтрагентамиОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	//|		ПО (ВЫБОР
	//|				КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ОплатаПоКурсуММВБ
	//|					ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов
	//|				ИНАЧЕ &ВалютаПоКурсуММВБ
	//|			КОНЕЦ = КурсыДоговоры.Валюта)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	//|		ПО РасчетыСКонтрагентамиОстатки.Сделка = СчетФактураВыданный.ДокументОснование
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	//|		ПО РасчетыСКонтрагентамиОстатки.Сделка = СчетНаОплатуПокупателю.ДокументОснование
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераИнвойсовLawson КАК НомераИнвойсовLawson
	//|		ПО РасчетыСКонтрагентамиОстатки.Сделка = НомераИнвойсовLawson.Документ
	//|ГДЕ
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	//|	РасчетыСКонтрагентамиОстатки.Сделка,
	//|	NULL,
	//|	ПоследнееДвижение.Период,
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс > 0
	//|			ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	//|		ИНАЧЕ КурсыДоговоры.Курс
	//|	КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100,
	//|	КурсыДоговоры.Кратность,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|			КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	//|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|			КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	//|					И НЕ КурсыДоговоры.Курс = 0
	//|					И НЕ &КурсДокумента = 0
	//|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * (ВЫРАЗИТЬ(ВЫБОР
	//|							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	//|								ТОГДА КурсыДоговоры.Курс
	//|							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	//|						КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15, 4)))
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК ЧИСЛО(15, 2)),
	//|	ЛОЖЬ,
	//|	NULL,
	//|	NULL,
	//|	NULL
	//|ИЗ
	//|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	//|			&МоментВремени,
	//|			ДоговорКонтрагента.Владелец = &Контрагент
	//|				И (ДоговорКонтрагента.Организация = &Организация
	//|					ИЛИ ДоговорКонтрагента.Организация = &ПустаяОрганизация)
	//|				И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)
	//|				И ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоДоговоруВЦелом) КАК РасчетыСКонтрагентамиОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	//|		ПО (ВЫБОР
	//|				КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ОплатаПоКурсуММВБ
	//|					ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов
	//|				ИНАЧЕ &ВалютаПоКурсуММВБ
	//|			КОНЕЦ = КурсыДоговоры.Валюта)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			МАКСИМУМ(РасчетыСКонтрагентами.Период) КАК Период,
	//|			РасчетыСКонтрагентами.ДоговорКонтрагента КАК ДоговорКонтрагента
	//|		ИЗ
	//|			РегистрНакопления.ВзаиморасчетыСПокупателями КАК РасчетыСКонтрагентами
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			РасчетыСКонтрагентами.ДоговорКонтрагента) КАК ПоследнееДвижение
	//|		ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента = ПоследнееДвижение.ДоговорКонтрагента
	//|ГДЕ
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	//|	NULL,
	//|	РасчетыСКонтрагентамиОстатки.СчетНаОплату,
	//|	РасчетыСКонтрагентамиОстатки.СчетНаОплату.Дата,
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток,
	//|	ВЫБОР
	//|		КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс > 0
	//|			ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	//|		ИНАЧЕ КурсыДоговоры.Курс
	//|	КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100,
	//|	КурсыДоговоры.Кратность,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|			КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	//|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	//|			КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	//|					И НЕ КурсыДоговоры.Курс = 0
	//|					И НЕ &КурсДокумента = 0
	//|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * (ВЫРАЗИТЬ(ВЫБОР
	//|							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	//|								ТОГДА КурсыДоговоры.Курс
	//|							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	//|						КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15, 4)))
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК ЧИСЛО(15, 2)),
	//|	ЛОЖЬ,
	//|	РасчетыСКонтрагентамиОстатки.СчетНаОплату.Номер,
	//|	NULL,
	//|	NULL
	//|ИЗ
	//|	РегистрНакопления.СчетаНаПредоплату.Остатки(
	//|			&МоментВремени,
	//|			ДоговорКонтрагента.Владелец = &Контрагент
	//|				И (ДоговорКонтрагента.Организация = &Организация
	//|					ИЛИ ДоговорКонтрагента.Организация = &ПустаяОрганизация)
	//|				И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)) КАК РасчетыСКонтрагентамиОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	//|		ПО (ВЫБОР
	//|				КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ОплатаПоКурсуММВБ
	//|					ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов
	//|				ИНАЧЕ &ВалютаПоКурсуММВБ
	//|			КОНЕЦ = КурсыДоговоры.Валюта)
	//|ГДЕ
	//|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ТЧДокументаПлатежа.ДоговорКонтрагента,
	//|	ТЧДокументаПлатежа.Сделка,
	//|	NULL,
	//|	ТЧДокументаПлатежа.Ссылка.Дата,
	//|	ТЧДокументаПлатежа.СуммаВзаиморасчетов,
	//|	ТЧДокументаПлатежа.КурсВзаиморасчетов,
	//|	ТЧДокументаПлатежа.КратностьВзаиморасчетов,
	//|	ТЧДокументаПлатежа.СуммаПлатежа,
	//|	ИСТИНА,
	//|	ТЧДокументаПлатежа.НомерСчета,
	//|	NULL,
	//|	ТЧДокументаПлатежа.НомерLawson
	//|ИЗ
	//|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ТЧДокументаПлатежа
	//|ГДЕ
	//|	ТЧДокументаПлатежа.Ссылка = &Регистратор
	//|	И ТЧДокументаПлатежа.Ссылка.Проведен";
	//
	//Запрос.УстановитьПараметр("ВалютаПоКурсуММВБ",Справочники.Валюты.НайтиПоКоду("000"));
	//
	// конец изменения, RG-Soft, Карасев В.В., 11.04.2016
	
		Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РасчетыСКонтрагентамиОстатки.Сделка КАК Сделка,
	|	NULL КАК СчетНаПредоплату,
	|	РасчетыСКонтрагентамиОстатки.Сделка.Дата КАК ДатаВозникновения,
	|	ВЫБОР
	|		КОГДА &Ограничивать
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	|						ТОГДА НомераИнвойсовLawson.Сумма
	|					ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	|				КОНЕЦ
	|		ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	|	КОНЕЦ КАК СуммаВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс > 0
	|			ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	|		ИНАЧЕ КурсыДоговоры.Курс
	|	КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 КАК КурсВзаиморасчетов,
	|	КурсыДоговоры.Кратность КАК КратностьВзаиморасчетов,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	|				ТОГДА ВЫБОР
	|						КОГДА &Ограничивать
	|							ТОГДА ВЫБОР
	|									КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	|										ТОГДА НомераИнвойсовLawson.Сумма
	|									ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	|								КОНЕЦ
	|						ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	|					КОНЕЦ
	|			КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	|					И НЕ КурсыДоговоры.Курс = 0
	|					И НЕ &КурсДокумента = 0
	|				ТОГДА ВЫБОР
	|						КОГДА &Ограничивать
	|							ТОГДА ВЫБОР
	|									КОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > НомераИнвойсовLawson.Сумма
	|										ТОГДА НомераИнвойсовLawson.Сумма
	|									ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	|								КОНЕЦ
	|						ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	|					КОНЕЦ * (ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	|								ТОГДА КурсыДоговоры.Курс
	|							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	|						КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15, 4)))
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаПлатежа,
	|	ЛОЖЬ КАК ДвиженияДокумента,
	|	СчетНаОплатуПокупателю.Номер КАК НомерСчета,
	|	СчетФактураВыданный.Номер КАК НомерСФ,
	|	НомераИнвойсовLawson.Номер КАК НомерLawson
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	|			&МоментВремени,
	|			ДоговорКонтрагента.Владелец = &Контрагент
	|				И (ДоговорКонтрагента.Организация = &Организация
	|					ИЛИ ДоговорКонтрагента.Организация = &ПустаяОрганизация)
	|				И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)
	|				И ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоРасчетнымДокументам) КАК РасчетыСКонтрагентамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	|		ПО (ВЫБОР
	|				КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ОплатаПоКурсуММВБ
	|					ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|				ИНАЧЕ &ВалютаПоКурсуММВБ
	|			КОНЕЦ = КурсыДоговоры.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО РасчетыСКонтрагентамиОстатки.Сделка = СчетФактураВыданный.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|		ПО РасчетыСКонтрагентамиОстатки.Сделка = СчетНаОплатуПокупателю.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераИнвойсовLawson КАК НомераИнвойсовLawson
	|		ПО РасчетыСКонтрагентамиОстатки.Сделка = НомераИнвойсовLawson.Документ
	|ГДЕ
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	|	РасчетыСКонтрагентамиОстатки.Сделка,
	|	NULL,
	|	ПоследнееДвижение.Период,
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток,
	|	ВЫБОР
	|		КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс > 0
	|			ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	|		ИНАЧЕ КурсыДоговоры.Курс
	|	КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100,
	|	КурсыДоговоры.Кратность,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	|			КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	|					И НЕ КурсыДоговоры.Курс = 0
	|					И НЕ &КурсДокумента = 0
	|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * (ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	|								ТОГДА КурсыДоговоры.Курс
	|							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	|						КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15, 4)))
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)),
	|	ЛОЖЬ,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	|			&МоментВремени,
	|			ДоговорКонтрагента.Владелец = &Контрагент
	|				И (ДоговорКонтрагента.Организация = &Организация
	|					ИЛИ ДоговорКонтрагента.Организация = &ПустаяОрганизация)
	|				И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)
	|				И ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоДоговоруВЦелом) КАК РасчетыСКонтрагентамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	|		ПО (ВЫБОР
	|				КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ОплатаПоКурсуММВБ
	|					ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|				ИНАЧЕ &ВалютаПоКурсуММВБ
	|			КОНЕЦ = КурсыДоговоры.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(РасчетыСКонтрагентами.Период) КАК Период,
	|			РасчетыСКонтрагентами.ДоговорКонтрагента КАК ДоговорКонтрагента
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСПокупателями КАК РасчетыСКонтрагентами
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РасчетыСКонтрагентами.ДоговорКонтрагента) КАК ПоследнееДвижение
	|		ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента = ПоследнееДвижение.ДоговорКонтрагента
	|ГДЕ
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	|	NULL,
	|	РасчетыСКонтрагентамиОстатки.СчетНаОплату,
	|	РасчетыСКонтрагентамиОстатки.СчетНаОплату.Дата,
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток,
	|	ВЫБОР
	|		КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс > 0
	|			ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	|		ИНАЧЕ КурсыДоговоры.Курс
	|	КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100,
	|	КурсыДоговоры.Кратность,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	|			КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаДокумента
	|					И НЕ КурсыДоговоры.Курс = 0
	|					И НЕ &КурсДокумента = 0
	|				ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * (ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс = 0
	|								ТОГДА КурсыДоговоры.Курс
	|							ИНАЧЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Курс
	|						КОНЕЦ * (100 + РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Процент) / 100 * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность) КАК ЧИСЛО(15, 4)))
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)),
	|	ЛОЖЬ,
	|	РасчетыСКонтрагентамиОстатки.СчетНаОплату.Номер,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.СчетаНаПредоплату.Остатки(
	|			&МоментВремени,
	|			ДоговорКонтрагента.Владелец = &Контрагент
	|				И (ДоговорКонтрагента.Организация = &Организация
	|					ИЛИ ДоговорКонтрагента.Организация = &ПустаяОрганизация)
	|				И ДоговорКонтрагента.ВидДоговора В ИЕРАРХИИ (&ВидДоговора)) КАК РасчетыСКонтрагентамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	|		ПО (ВЫБОР
	|				КОГДА НЕ РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ОплатаПоКурсуММВБ
	|					ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|				ИНАЧЕ &ВалютаПоКурсуММВБ
	|			КОНЕЦ = КурсыДоговоры.Валюта)
	|ГДЕ
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0";
	
	Запрос.УстановитьПараметр("ВалютаПоКурсуММВБ",Справочники.Валюты.НайтиПоКоду("000"));
	Запрос.УстановитьПараметр("МоментВремени",КонецДня(ДокументСсылка.ДатаПроведения)-1);
	
	
	Запрос.УстановитьПараметр("ПоРасчетнымДокументам",Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам);
	Запрос.УстановитьПараметр("ПоДоговоруВЦелом",Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
		
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Ограничивать",Ограничивать);
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ПустаяОрганизация",Справочники.Организации.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВалютаДокумента",ВалютаДокумента);
	Запрос.УстановитьПараметр("КурсДокумента",КурсДокумента);
	Запрос.УстановитьПараметр("КратностьДокумента",КратностьДокумента);
	Запрос.УстановитьПараметр("ДатаПлатежа",ДатаДок);
	Запрос.УстановитьПараметр("ВидДоговора",УправлениеВзаиморасчетами.ОпределитьВидДоговораСКонтрагентом(ВидОперацииДок));
	Запрос.УстановитьПараметр("Регистратор",ДокументСсылка);
	
	РасшифровкаПлатежа.Загрузить(Запрос.Выполнить().Выгрузить());
	
	РасшифровкаПлатежа.Сортировать("ДатаВозникновения Возр");
	
КонецПроцедуры // СформироватьСписокДолгов()

Процедура ЗаполнитьРасшифровкуПоДолгам(ПодборПоСуммеПлатежа=Истина,КурсПоДоговору=Истина) Экспорт
	
	СформироватьСписокДолгов();
	
	СтавкаНДС=УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь,"ОсновнаяСтавкаНДС");
	ВсегоПлатежей=0;
	
	РеглУчет=НЕ ОтражатьВБухгалтерскомУчете=Неопределено;
	
	Если Не СпособЗаполнения="ТЧ" Тогда
	
		Если СпособЗаполнения="ЛИФО" Тогда
			
			РасшифровкаПлатежа.Сортировать("ДатаВозникновения Убыв");
			
		КонецЕсли;
					
		Для Каждого СтрокаДолг Из РасшифровкаПлатежа Цикл
			
			Если ПодбиратьСумму Тогда
				
				Если ВсегоПлатежей+СтрокаДолг.СуммаПлатежа <= СуммаДляПодбора Тогда
					
					СуммаПлатежа=СтрокаДолг.СуммаПлатежа;
					СуммаВзаиморасчетов=СтрокаДолг.СуммаВзаиморасчетов;
					
					ВсегоПлатежей=ВсегоПлатежей+СтрокаДолг.СуммаПлатежа;
					
				ИначеЕсли ВсегоПлатежей<СуммаДляПодбора Тогда
					
					СуммаПлатежа=СуммаДляПодбора-ВсегоПлатежей;
					СуммаВзаиморасчетов=ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СуммаПлатежа,ВалютаДокумента,СтрокаДолг.ДоговорКонтрагента.ВалютаВзаиморасчетов,
																	КурсДокумента,СтрокаДолг.КурсВзаиморасчетов,
																	КратностьДокумента,СтрокаДолг.КратностьВзаиморасчетов);
					ВсегоПлатежей=СуммаДляПодбора;												
																	
				Иначе
					
					Прервать;
					
				КонецЕсли;
				
			Иначе
				
				СуммаПлатежа=СтрокаДолг.СуммаПлатежа;
				СуммаВзаиморасчетов=СтрокаДолг.СуммаВзаиморасчетов;
				
			КонецЕсли;
			
			СтрокаПлатеж=РасшифровкаПлатежаДок.Добавить();
			СтрокаПлатеж.ДоговорКонтрагента=СтрокаДолг.ДоговорКонтрагента;
			СтрокаПлатеж.Сделка=СтрокаДолг.Сделка;
			СтрокаПлатеж.СуммаПлатежа=СуммаПлатежа;
			СтрокаПлатеж.КурсВзаиморасчетов=СтрокаДолг.КурсВзаиморасчетов;
			СтрокаПлатеж.КратностьВзаиморасчетов=СтрокаДолг.КратностьВзаиморасчетов;
			СтрокаПлатеж.СуммаВзаиморасчетов=СуммаВзаиморасчетов;
						
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрокаПлатеж Из РасшифровкаПлатежаДок Цикл

			СтруктураОтбора=Новый Структура;
			СтруктураОтбора.Вставить("ДоговорКонтрагента",СтрокаПлатеж.ДоговорКонтрагента);
			СтруктураОтбора.Вставить("Сделка",СтрокаПлатеж.Сделка);
			
			СтрокаДолг = ОбработкаТабличныхЧастей.НайтиСтрокуТабЧасти(РасшифровкаПлатежа, СтруктураОтбора);
			
			Если НЕ СтрокаДолг=Неопределено Тогда
				
				КурсВзаиморасчетов=?(СтрокаПлатеж.КурсВзаиморасчетов=0,СтрокаДолг.КурсВзаиморасчетов,СтрокаПлатеж.КурсВзаиморасчетов);
				КратностьВзаиморасчетов=?(СтрокаПлатеж.КратностьВзаиморасчетов=0,СтрокаДолг.КратностьВзаиморасчетов,СтрокаПлатеж.КратностьВзаиморасчетов);
				
				Если ПодбиратьСумму Тогда
					
					Если ВсегоПлатежей+СтрокаДолг.СуммаПлатежа <= СуммаДляПодбора Тогда
						
						СтрокаПлатеж.СуммаПлатежа=СтрокаДолг.СуммаПлатежа;
						ВсегоПлатежей=ВсегоПлатежей+СтрокаДолг.СуммаПлатежа;
						
					ИначеЕсли ВсегоПлатежей<СуммаДляПодбора Тогда
						
						СтрокаПлатеж.СуммаПлатежа=СуммаДляПодбора-ВсегоПлатежей;
						ВсегоПлатежей=СуммаДляПодбора;
						
					Иначе
						
						Прервать;
						
					КонецЕсли;
					
				Иначе
					
					СтрокаПлатеж.СуммаПлатежа=СтрокаДолг.СуммаПлатежа;
					
				КонецЕсли;
				
				СтрокаПлатеж.СуммаВзаиморасчетов=ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаПлатежа,ВалютаДокумента,СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов,
															КурсДокумента,КурсВзаиморасчетов,
															КратностьДокумента,КратностьВзаиморасчетов);
																		
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если РеглУчет Тогда
		
		Для Каждого СтрокаПлатеж Из РасшифровкаПлатежаДок Цикл
			
			SalesBook.ЗаполнитьРеквизитыРеглУчета(СтрокаПлатеж,Организация, Контрагент, СтавкаНДС,ОтражатьВБухгалтерскомУчете);
			
		КонецЦикла;
		
	КонецЕсли;
			
КонецПроцедуры // ЗаполнитьРасшифровкуПоДолгам()

#КонецЕсли
