Процедура ПриказНаСписание(Объект) Экспорт
	ТабДок = ПечатьПриказНаСписание(Объект);
	ТабДок.Показать();
КонецПроцедуры

Функция ПечатьПриказНаСписание(Объект)
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_InventoryКорректировка_ПечатьПриказаНаСписание";
	Макет = Документы.InventoryКорректировка.ПолучитьМакет("Junk_ПриказОСписании"); 	
	//[РКХ->]
	Если ОбщегоНазначенияПовтИсп.ИдентификаторРабочейКонфигурации() = "PA" Тогда
   		ОбластьШапки = Макет.ПолучитьОбласть("ОбластьШапкаВариант2");
		ОбластьШапки.Параметры.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация");
	Иначе
		ОбластьШапки = Макет.ПолучитьОбласть("ОбластьШапкаВариант1");
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьШапки);
	//[<-РКХ]     	
	ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПечати");	
	ОбластьМакета.Параметры.НомерПриказа = Объект.OrdNum;
	ОбластьМакета.Параметры.ДатаДокумента = Формат(Объект.Дата,"ДФ='""''""dd""''''"" MMMM yyyy'");
	ОбластьМакета.Параметры.КонецГода = Формат(КонецГода(Объект.Дата),"ДФ='""''""dd""''''"" MMMM yyyy'");
	ТабДокумент.Вывести(ОбластьМакета);
	Возврат ТабДокумент;	
КонецФункции

Процедура АктОСписании(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	InventoryКорректировкаGoods.Good КАК Гуд
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	Документ.InventoryКорректировка.Goods КАК InventoryКорректировкаGoods
	|ГДЕ
	|	InventoryКорректировкаGoods.Ссылка = &Регистратор
	|	И InventoryКорректировкаGoods.Reference.Наименование ПОДОБНО ""%dispos%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(InventoryBatches.Quantity) КАК Quantity,
	|	МАКСИМУМ(InventoryBatches.Sum) КАК Sum,
	|	InventoryBatches.Good.Код,
	|	ВЫРАЗИТЬ(InventoryBatches.Good.DescriptionRus КАК Строка(200)) КАК GoodНаименование,
	|	InventoryBatches.Good.StandardUOM.BasicUOM.Наименование
	|ИЗ
	|	РегистрНакопления.InventoryBatches КАК InventoryBatches
	|ГДЕ
	|	InventoryBatches.Регистратор = &Регистратор
	|	И InventoryBatches.Good В
	|			(ВЫБРАТЬ
	|				тч.Гуд
	|			ИЗ
	|				тч)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(InventoryBatches.Good.DescriptionRus КАК Строка(200)),
	|	InventoryBatches.Good.Код,
	|	InventoryBatches.Good.StandardUOM.BasicUOM.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	GoodНаименование";
	Запрос.УстановитьПараметр("Регистратор", Объект);
	Результат = Запрос.Выполнить().Выгрузить();
	ТабДок = ПечатьАктОСписании(Объект,Результат);
	ТабДок.Показать();
КонецПроцедуры

Функция ПечатьАктОСписании(Объект,ТаблицаЗаписей)
	Перем мВалютаРегламентированногоУчета;
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаПечати = мВалютаРегламентированногоУчета;
	ТабДокумент = Новый ТабличныйДокумент;
	ДопДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_InventoryКорректировка_ПечатьАктаОСписании";
	Макет = Документы.InventoryКорректировка.ПолучитьМакет("Junk_АктОСписанииМатЗапасов");
	//Первая Страница
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакетаПодвал.Параметры.Итого = Формат(ТаблицаЗаписей.Итог("Sum"),"ЧЦ=15; ЧДЦ=2");
	ОбластьМакетаПодвал.Параметры.СуммаПрописью = РаботаСДиалогами.СформироватьСуммуПрописью(ТаблицаЗаписей.Итог("Sum"),ВалютаПечати);
	ОбластьМакета.Параметры.ДатаДокумента = Формат(Объект.Дата,"ДФ='""''""dd""''''"" MMMM yyyy'");
	ОбластьМакета.Параметры.ДатаКратко = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
	//-> RG-Soft VIvanov 07/06/12
	//Орг = Справочники.Организации.НайтиПоКоду("00001"); 
	Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	//<- RG-Soft
	ОбластьМакета.Параметры.ОрганизацияПолноеНаим = Орг.НаименованиеПолное;
	ОбластьМакета.Параметры.ОрганизацияОКПО = Орг.КодПоОКПО;
	ОбластьМакета.Параметры.Подразделение = Объект.TaxRegistration.НаименованиеПолное;
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакетаШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТабл1");
	ТабДокумент.Вывести(ОбластьМакетаШапкаТаблицы);
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка1");
	ОбластьМакетаСтрокаПустая = Макет.ПолучитьОбласть("Строка1");
	Для каждого стр Из ТаблицаЗаписей Цикл
		ОбластьМакетаСтрока.Параметры.Good = стр.GoodНаименование;
		ОбластьМакетаСтрока.Параметры.itemCode = стр.GoodКод;
		ОбластьМакетаСтрока.Параметры.UOM	= стр.GoodStandardUOMBasicUOMНаименование;
		ОбластьМакетаСтрока.Параметры.Qty = Формат(стр.Quantity,"ЧЦ=15; ЧДЦ=3");
		Если стр.Quantity <> 0 Тогда
		ОбластьМакетаСтрока.Параметры.Price = Формат(стр.Sum / стр.Quantity,"ЧЦ=15; ЧДЦ=2; ЧН=");
		КонецЕсли;
		ОбластьМакетаСтрока.Параметры.Sum = Формат(стр.Sum,"ЧЦ=15; ЧДЦ=2");
		Если ТабДокумент.ПроверитьВывод(ОбластьМакетаСтрока) Тогда
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
		Иначе
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьМакетаШапкаТаблицы);
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
   		КонецЕсли;
	КонецЦикла;
	Если НЕ ТабДокумент.ПроверитьВывод(ОбластьМакетаПодвал) Тогда
		Пока ТабДокумент.ПроверитьВывод(ОбластьМакетаСтрокаПустая) Цикл
			ТабДокумент.Вывести(ОбластьМакетаСтрокаПустая);	
		КонецЦикла;
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокумент.Вывести(ОбластьМакетаШапкаТаблицы);
		ТабДокумент.Вывести(ОбластьМакетаСтрокаПустая);
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
	Иначе
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
	КонецЕсли;	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьАктОСписании()

Процедура БухСправка(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	InventoryКорректировкаGoods.Good КАК Гуд
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	Документ.InventoryКорректировка.Goods КАК InventoryКорректировкаGoods
	|ГДЕ
	|	InventoryКорректировкаGoods.Ссылка = &Регистратор
	|	И InventoryКорректировкаGoods.Reference.Наименование ПОДОБНО ""%eturn%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(InventoryBatches.Quantity) КАК Quantity,
	|	МАКСИМУМ(InventoryBatches.Sum) КАК Sum,
	|	InventoryBatches.Good.Код
	|ИЗ
	|	РегистрНакопления.InventoryBatches КАК InventoryBatches
	|ГДЕ
	|	InventoryBatches.Регистратор = &Регистратор
	|	И InventoryBatches.Good В
	|			(ВЫБРАТЬ
	|				тч.Гуд
	|			ИЗ
	|				тч)
	|
	|СГРУППИРОВАТЬ ПО
	|	InventoryBatches.Good.Код";
	Запрос.УстановитьПараметр("Регистратор", Объект);
	Результат = Запрос.Выполнить().Выгрузить();
	ТабДок = ПечатьБухСправка(Объект,Результат);
	ТабДок.Показать();
	
КонецПроцедуры

Функция ПечатьБухСправка(Объект,ТаблицаЗаписей)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_InventoryКорректировка_ПечатьБухСправка";
	Макет = Документы.InventoryКорректировка.ПолучитьМакет("Return_БухСправка");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подписи");
	Орг = Объект.TaxRegistration;
	СведенияОбОрганизации = КонтактнаяИнформация.СведенияОЮрФизЛице(Орг,Объект.Дата);
	
	Шапка.Параметры.Наименование = СведенияОбОрганизации.ПолноеНаименование;
	Шапка.Параметры.ИНН = СведенияОбОрганизации.ИНН;
	Шапка.Параметры.КПП = СведенияОбОрганизации.КПП;
	Шапка.Параметры.Адрес = СведенияОбОрганизации.ФактическийАдрес;
	Шапка.Параметры.Телефон = СведенияОбОрганизации.Телефоны;
	Шапка.Параметры.Номер = Объект.Номер;
	Шапка.Параметры.Дата = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(Шапка);
	ТабДокумент.Вывести(ШапкаТаблицы);
	
	сч = 1;
	Для каждого стр Из ТаблицаЗаписей Цикл
		Строка.Параметры.N = сч;
		Строка.Параметры.НомСписания = Объект.InventoryСписание.Номер;
		Строка.Параметры.TaxRegСписания = Объект.InventoryСписание.TaxRegistration.Код;
		Строка.Параметры.КодGood = стр.GoodКод;
		Строка.Параметры.Количество = Формат(стр.Quantity,"ЧЦ=15; ЧДЦ=3");
		Строка.Параметры.Сумма = Формат(стр.Sum,"ЧЦ=15; ЧДЦ=2");
		ТабДокумент.Вывести(Строка);
		сч = сч + 1;
	КонецЦикла;
	ТабДокумент.Вывести(Подвал);
	Возврат ТабДокумент;	
	
КонецФункции


Процедура БухСправкаReclas(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	InventoryКорректировкаGoods.Good КАК Гуд
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	Документ.InventoryКорректировка.Goods КАК InventoryКорректировкаGoods
	|ГДЕ
	|	InventoryКорректировкаGoods.Ссылка = &Регистратор
	|	И InventoryКорректировкаGoods.Reference.Наименование ПОДОБНО ""%recl%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(InventoryBatches.Quantity) КАК Quantity,
	|	МАКСИМУМ(InventoryBatches.Sum) КАК Sum,
	|	InventoryBatches.Good.Код
	|ИЗ
	|	РегистрНакопления.InventoryBatches КАК InventoryBatches
	|ГДЕ
	|	InventoryBatches.Регистратор = &Регистратор
	|	И InventoryBatches.Good В
	|			(ВЫБРАТЬ
	|				тч.Гуд
	|			ИЗ
	|				тч)
	|
	|СГРУППИРОВАТЬ ПО
	|	InventoryBatches.Good.Код";
	Запрос.УстановитьПараметр("Регистратор", Объект);
	Результат = Запрос.Выполнить().Выгрузить();
	ТабДок = ПечатьБухСправкаReclas(Объект,Результат);
	ТабДок.Показать();
	
КонецПроцедуры

Функция ПечатьБухСправкаReclas(Объект,ТаблицаЗаписей)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_InventoryКорректировка_ПечатьБухСправкаReclas";
	Макет = Документы.InventoryКорректировка.ПолучитьМакет("ReclasToMAndS_БухСправка");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подписи");
	Орг = Объект.TaxRegistration;
	СведенияОбОрганизации = КонтактнаяИнформация.СведенияОЮрФизЛице(Орг,Объект.Дата);
	
	Шапка.Параметры.Наименование = СведенияОбОрганизации.ПолноеНаименование;
	Шапка.Параметры.ИНН = СведенияОбОрганизации.ИНН;
	Шапка.Параметры.КПП = СведенияОбОрганизации.КПП;
	Шапка.Параметры.Адрес = СведенияОбОрганизации.ФактическийАдрес;
	Шапка.Параметры.Телефон = СведенияОбОрганизации.Телефоны;
	Шапка.Параметры.Номер = Объект.Номер;
	Шапка.Параметры.Дата = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(Шапка);
	ТабДокумент.Вывести(ШапкаТаблицы);
	
	сч = 1;
	Для каждого стр Из ТаблицаЗаписей Цикл
		Строка.Параметры.N = сч;
		Если стр.Quantity > 0 ИЛИ стр.Quantity = 0 Тогда 
		Строка.Параметры.НомСписанияДТ = "inventory";
		Строка.Параметры.НомСписанияКТ = "M&S";
	Иначе
		Строка.Параметры.НомСписанияДТ = "M&S";
		Строка.Параметры.НомСписанияКТ = "inventory";
        КонецЕсли;
		Строка.Параметры.TaxRegСписания = Объект.TaxRegistration.Код;
		Строка.Параметры.КодGood = стр.GoodКод;
		Строка.Параметры.Количество = Формат(стр.Quantity,"ЧЦ=15; ЧДЦ=3");
		Строка.Параметры.Сумма = Формат(стр.Sum,"ЧЦ=15; ЧДЦ=2");
		ТабДокумент.Вывести(Строка);
		сч = сч + 1;
	КонецЦикла;
	ТабДокумент.Вывести(Подвал);
	Возврат ТабДокумент;	
	
КонецФункции