
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ДоговорЗаполнен(ПараметрКоманды) Тогда
		
		ПараметрыПечати = ОткрытьФормуМодально("Документ.СчетНаОплатуПокупателю.Форма.ФормаНастройкиУправляемая");
		Если ПараметрыПечати = Неопределено Тогда
			ПараметрыПечати = Новый Структура;
			ПараметрыПечати.Вставить("ВыводитьСкидку", Ложь);
			ПараметрыПечати.Вставить("ПроцентСкидки", 20);
		КонецЕсли;
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетНаОплатуПокупателю", "ИнвойсСНастройкой", ПараметрКоманды,
														 ПараметрыВыполненияКоманды, ПараметрыПечати);
	КонецЕсли;
													 
КонецПроцедуры

&НаСервере
Функция ДоговорЗаполнен(Док)
	
	Если Не ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Необходимо заполнить договор контрагента!");
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции
