#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// { RGS VShamin 06.04.2016 13:10:14 - S-I-0001590
	//ОбменДаннымиКлиент.ОткрытьСоставОтправляемыхДанных(ПараметрКоманды);
	Если ПараметрКоманды = Неопределено Тогда
		ОбменДаннымиКлиент.ОткрытьСоставОтправляемыхДанных(ПараметрыВыполненияКоманды.Источник.Элементы.Список.ТекущаяСтрока);
	Иначе
		ОбменДаннымиКлиент.ОткрытьСоставОтправляемыхДанных(ПараметрКоманды);
	КонецЕсли;
	// } RGS VShamin 06.04.2016 13:10:22 - S-I-0001590
	
КонецПроцедуры

#КонецОбласти