
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Если Не РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS() Тогда 
		СтандартнаяОбработка = Ложь;
		Поля.Добавить("NameEng");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Не РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS() Тогда 
		СтандартнаяОбработка = Ложь;
	  	Представление = Данные.NameEng;
	КонецЕсли;
	 	       
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS() 
		И ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("NameEng", Параметры.СтрокаПоиска + "%");
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	SegmentsOfNonLawsonCompanies.Ссылка
		               |ИЗ
		               |	Справочник.SegmentsOfNonLawsonCompanies КАК SegmentsOfNonLawsonCompanies
		               |ГДЕ
		               |	SegmentsOfNonLawsonCompanies.NameEng ПОДОБНО &NameEng
		               |	И Не SegmentsOfNonLawsonCompanies.ПометкаУдаления";
					   
		Если Параметры.Отбор.Свойство("Владелец") Тогда
			Запрос.Текст = Запрос.Текст + "
				|И SegmentsOfNonLawsonCompanies.Владелец = &Владелец";
			Запрос.УстановитьПараметр("Владелец", Параметры.Отбор.Владелец);
		КонецЕсли;
             					   
		ТаблицаРезультатов = Запрос.Выполнить().Выгрузить();
		МассивСсылок = ТаблицаРезультатов.ВыгрузитьКолонку("Ссылка");
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(МассивСсылок);
		
	КонецЕсли;
	
КонецПроцедуры
