
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначениеПараметровОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьLeg7();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	 УстановитьЗначениеПараметровОтбора();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПараметровОтбора()
	
	ЗначениеОтбора = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
	 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(SettingsOfCustomsFilesToLawson.Отбор,
															"ParentCompany",
															ЗначениеОтбора,
															ВидСравненияКомпоновкиДанных.Равно,
															, 
															Истина);
															
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(LocalDistributionSettingsForNonLawsonCompanies.Отбор,
															"Company",
															ЗначениеОтбора,
															ВидСравненияКомпоновкиДанных.Равно,
															, 
															Истина);
														
															
КонецПроцедуры

&НаКлиенте
Процедура Leg7LegalEntityDeterminingПриИзменении(Элемент)
	
	НастроитьВидимостьLeg7();		
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьLeg7()
	
	Элементы.LegalEntityForLeg7.Видимость = 
		(Объект.Leg7LegalEntityDetermining = ПредопределенноеЗначение("Перечисление.Leg7LegalEntityDetermining.DefaultLegalEntity"));		
	
КонецПроцедуры

