
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыАутентификации = РГСофт.ПроверитьWindowsАутентификацию();
	Если НЕ ПараметрыАутентификации.ЕстьWindowsАутентификация Тогда
		ПоказатьПредупреждение(, ПараметрыАутентификации.ОписаниеОшибки,,НСтр("ru = 'Windows аутентификация недоступна'; en = 'OS Authentication is not avaliable'"));			
	иначе	
		ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма", , ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
		
КонецПроцедуры
