
Процедура ДобавитьЗапись(Item, CustomsFile=Неопределено, CustomsFileNo, CustomsFileLineNo=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Item) Тогда
		ВызватьИсключение "Item is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(CustomsFileNo)) Тогда
		ВызватьИсключение "Customs file no. is empty!";	
	КонецЕсли;
	
	Движение = Добавить();
	Движение.Item = Item;
	Движение.CustomsFile = CustomsFile;
	Движение.DTNo = СокрЛП(CustomsFileNo);
	Движение.DTLineNo = CustomsFileLineNo;
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизитыБезДополнительныхДанных();
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных()
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Запись.DTNo = СокрЛП(Запись.DTNo);
		
	КонецЦикла;
	
КонецПроцедуры
