
///////////////////////////////////////////////////////////////////////////////////////////////
// ПРИ КОПИРОВАНИИ

Процедура ПриКопировании(ОбъектКопирования)
	
	РГСофт.ОчиститьCreationModification(ЭтотОбъект);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизиты();	
	
	ПроверитьЗаполнениеРеквизитов(Отказ);
		
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизиты()
	
	Код = СокрЛП(ВРег(Код));	
	TMSID = СокрЛП(TMSID);
	
	Если ЭтоНовый() Тогда
		РГСофт.ЗаполнитьCreation(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Code' is empty!",
			ЭтотОбъект, "Код", , Отказ);	
	КонецЕсли;
	
	Если InTMS Тогда
		
		Если НЕ ЗначениеЗаполнено(TMSID) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"'TMS ID' is empty!",
				ЭтотОбъект, "TMSID", , Отказ);
				
		Иначе
			
			//Запрос = Новый Запрос;
			//Запрос.УстановитьПараметр("TMSID", TMSID);
			//Запрос.УстановитьПараметр("Ссылка", Ссылка);
			//Запрос.Текст =
			//	"ВЫБРАТЬ
			//	|	PackingTypes.Представление
			//	|ИЗ
			//	|	Справочник.PackingTypes КАК PackingTypes
			//	|ГДЕ
			//	|	НЕ PackingTypes.ПометкаУдаления
			//	|	И PackingTypes.Ссылка <> &Ссылка
			//	|	И PackingTypes.TMSID = &TMSID
			//	|	И PackingTypes.InTMS";
			//	
			//Выборка = Запрос.Выполнить().Выбрать();
			//Если Выборка.Следующий() Тогда
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			//		"TMS ID '" + TMSID + "' is already used in Packing type '" + СокрЛП(Выборка.Представление) + "'!",
			//		ЭтотОбъект, "TMSID", , Отказ);	
			//КонецЕсли;
					
		КонецЕсли;
			
	КонецЕсли;
		
КонецПроцедуры
